[
  {
    "elem_id": 1455601,
    "title": "Chuyên Viên Digital Marketing",
    "company": "Công Ty Cổ Phần Đầu Tư Và Phát Triển Y Tế Việt Nhật (JVC)",
    "address": "Tầng 24, tòa nhà Icon 4, 243A, Đê La Thành, phường Láng Thượng, quận Đống Đa",
    "url": "/chuyen-vien-digital-marketing-279-1455601-jv",
    "benefits": "Bonus, Healthcare Plan, Training",
    "minSalary": "0",
    "maxSalary": "0",
    "description": "1.Số lượng: 01 \n2. Giới tính: Nam\n3. Mô tả: \n- Xây dựng chiến lược Marketing cho thương hiệu, các sản phẩm, dịch vụ của công ty. Đóng góp các ý tưởng nội dung sáng tạo, quản lý tổ chức các chương trình truyền thông, promotion, sự kiện theo định hướng công ty. \n- Lập kế hoạch và triển khai, báo cáo và đánh giá hiệu quả các hoạt động Digital Marketing của công ty\n- Nghiên cứu thị trường, khách hàng, sản phẩm, nắm bắt hoạt động của các đơn vị cùng ngành\n- Cập nhật công nghệ, xu hướng, thuật toán của các kênh truyền thông\n - Định vị và phát triển thương hiệu, sản phẩm trên các kênh online và các nền tảng mạng xã hội (Google, Facebook, Youtube, Zalo, TikTok, ......) \n- Xây dựng nội dung và triển khai các chiến dịch quảng cáo qua các kênh Digital: (SEO/SEM, Google Ads, Facebook Ads, Email Marketing, SMS, Affiliate Marketing...), bao gồm cả triển khai thử nghiệm và đánh giá kết quả. Nắm rõ quy định kỹ thuật của từng kênh digital để tối ưu hóa nội dung, hình ảnh và chất lượng quảng cáo. \n- Quản lý các kênh truyền thông online, kênh truyền thông nội bộ của Công ty \n- Phối hợp tổ chức các sự kiện truyền thông và hoạt động nội bộ Các công việc khác theo yêu cầu của công ty \n- Thực hiện kết nối và chăm sóc khách hàng trên các nền tảng Công ty quản lý. \n- Các công việc khác theo chỉ đạo của cấp trên.",
    "post_time": "20211227094903"
  },
  {
    "elem_id": 1455602,
    "title": "R&D Engineer (Software Developer, C, C++)",
    "company": "Branch of Panasonic Appliances Vietnam In Hung Yen",
    "address": "Plot G2 - Thang Long II IP - Yen My - Hung Yen",
    "url": "/r-d-engineer-software-developer-c-c-plus-plus-1455602-jv",
    "benefits": "Bonus, Training, Healthcare Plan",
    "minSalary": "0",
    "maxSalary": "0",
    "description": "We are looking for R&D Engineers who are willing to work for R&D Center and take the role of Software Developer as below:\n•    Develop embedded Software for Refrigerators: make development schedule, make samples.\n•     Perform testing (unit test, integration test, system test, etc.) and implement with actual Refrigerators.\n•     Create new functions related to software programming.\n•     Follow Waterfall process model when develop software.\n•     Prepare software development documents following by respective ISO standards.\n\nBENEFITS:\n•     Health Insurance Package.\n•     Competitive salary package with annual salary review and performance bonus twice a year.\n•     100% salary in probation time.\n•     Life support, languages allowance (English & Japanese) etc.\n•     Various training courses by company and from Panasonic Group\n•     Company bus picking up from Hanoi (including Dong Anh, Soc Son), Hai Duong, Hung Yen, Bac Ninh.\n•     All Sundays & 02 Saturdays off per month.\n•     Career development opportunity by internal recruiting program.",
    "post_time": "20211227094904"
  },
  {
    "elem_id": 1455460,
    "title": "Giám Đốc Phát Triển Dự Án Tại Nha Trang",
    "company": "Capital House Group",
    "address": "Ha Noi",
    "url": "/giam-doc-phat-trien-du-an-tai-nha-trang-1455460-jv",
    "benefits": "Bonus, Others, Paid Leave",
    "minSalary": "2000",
    "maxSalary": "4000",
    "description": "- Làm việc tại Thành Phố Nha Trang\r\n- Thiết lập và duy trì công tác chặt chẽ với các Sở ban ngành các tỉnh và các tổ chức tư vấn thiết kế, các cơ quan chuyên môn kỹ thuật cần thiết để phục vụ công tác triển khai các hoạt động Lập và thẩm định Chủ trương đầu tư, thiết kế quy hoạch, cấp phép ...theo chức năng nhiệm vụ của Ban đầu tư\r\n- Triển khai thực hiện các thủ tục đầu tư dự án từ giai đoạn chuẩn bị đầu tư đến khi có giấy phép xây dựng\r\n- Lập kế hoạch thực hiện các thủ tục đầu tư của dự án. Tham mưu cho lãnh đạo và chỉ đạo thực hiện các trình\r\n- Tự triển khai dự án, đề xuất các kế hoạch cho các dự án\r\n- Phối hợp với Lãnh đạo Ban/Tập đoàn trong các công tác ngoại giao, cung cấp thông tin kỹ thuật, biện pháp nghiệp vụ, hồ sơ kỹ thuật cho các Sở ban ngành tại dự án\r\n- Các công việc khác theo sự phân công của Lãnh đạo quản lý trực tiếp",
    "post_time": "20211227094840"
  },
  {
    "elem_id": 1455605,
    "title": "Quản Trị Dự Án Phần Mềm (PM) - Phỏng Vấn Trước Tết Đi Làm Sau Tết",
    "company": "Công Ty Cổ Phần Công Nghệ Savis Việt Nam",
    "address": "Tầng 9 tòa nhà Việt Á, số 9 Duy Tân, Dịch Vọng Hậu, Cầu Giấy, Hà Nội.",
    "url": "/quan-tri-du-an-phan-mem-pm-phong-van-truoc-tet-di-lam-sau-tet-1455605-jv",
    "benefits": "Paid Leave, Healthcare Plan, Bonus",
    "minSalary": "1000",
    "maxSalary": "2500",
    "description": "-\tĐề xuất, lập kế hoạch triển khai các dự án phần mềm được phân công, bao gồm: phạm vi công việc, yêu cầu dự án, mức độ ưu tiên của dự án, phân tích các yêu cầu đầu tư cho dự án.\n-\tTổ chức và quản lý triển khai các dự án, xác định các rủi ro và quản trị phòng ngừa rủi ro dự án, báo cáo kịp thời các vấn đề phát sinh cho các bên liên quan.\n-\tQuản lý điều hành các hoạt động, tài chính của dự án; xử lý các vấn đề vướng mắc, phát sinh nhanh chóng, hiệu quả, đảm bảo hoàn thành các công việc của dự án theo đúng yêu cầu.\n-\tQuản lý, đánh giá chất lượng công việc của các thành viên trong dự án.\n-\tTiếp nhận các yêu cầu của khách hàng và đề xuất hướng giải quyết.\n-\tCập nhật các kiến thức về công nghệ và nghiệp vụ theo yêu cầu. \n-\tĐào tạo nhân sự trong bộ phận quy trình triển khai, quản lý dự án, đảm bảo chất  lượng dự án.\n-\tBáo cáo hàng tuần cho Khách hàng, Ban giám đốc.\n\nQuyền lợi: \n- Mức lương hấp dẫn, thỏa thuận theo năng lực và kinh nghiệm.\n- Đóng BHXH đầy đủ theo quy định.\n- Được hỗ trợ 100% công tác phí trong và ngoài nước.\n- Hỗ trợ gửi xe miễn phí.\n- Thưởng các ngày lễ tết, lương tháng 13 +++, các chế độ phúc lợi khác theo quy định công ty.\n- Được tham gia các chương trình Đào tạo nâng cao chuyên môn trong và ngoài nước.\n- Được làm việc trong môi trường chuyện nghiệp, thân thiện, trẻ trung và tham gia các hoạt động teambuilding thường kỳ của công ty.\n\nTHỜI GIAN LÀM VIỆC: 8h/ngày và 5,5 ngày/tuần.",
    "post_time": "20211227094906"
  },
  {
    "elem_id": 1455619,
    "title": "Java Leader/senior",
    "company": "Idealogic Vietnam Co., Ltd.",
    "address": "117-119 Ly Chinh Thang street, Vo Thi Sau ward, district 3, Ho Chi Minh City",
    "url": "/java-leader-senior-1455619-jv",
    "benefits": "Healthcare Plan, Bonus, Training",
    "minSalary": "0",
    "maxSalary": "0",
    "description": "The program we are working on is called Ariane and it is about replacing our many local and custom legacy Content Management systems by a central and modern CMS landscape. The content that the landscape holds is about legislation, jurisprudence, commentaries, handbooks and journals. Each of those so called \"document types\" has different structures and different management processes that the new landscape needs to support. With this new landscape, we intend not only to hold the content itself rather than gaining insights about the \"Content Knowledge\" as well. So, what is the meaning behind it and how can we use this knowledge to support our customer. Being able to do so, we need future oriented knowledge models managed in a triple-store database called Allegrograph. Next to that we are integrating recognition tools (partially in the direction of AI) to extract the knowledge out of the content and store it as triples. Building up the new CMS landscape and migrating away from the legacy systems to this new landscape is a multi-year project with future driven technology in a inspiring international environment",
    "post_time": "20211227094914"
  },
  {
    "elem_id": 1453757,
    "title": "PHP Developer (1200$++, Sign on Bonus) - Top Edtech Companies in South East Asia",
    "company": "Educa CORPORATION",
    "address": "Tòa Comatce, 61 Ngụy Như Kon Tum, Phường Nhân Chính, Quận Thanh Xuân, Hà Nội",
    "url": "/php-developer-1200-sign-on-bonus-top-edtech-companies-in-south-east-asia-1453757-jv",
    "benefits": "Team Activities, Bonus, Training",
    "minSalary": "800",
    "maxSalary": "1500",
    "description": "- Tham gia xây dựng hệ thống backend, cấu trúc và module nền tảng cho các sản phẩm\n- Tham gia đóng góp giải pháp, xây dựng nền tảng API dành cho ứng dụng\n- Xây dựng hệ thống WEB quản lý, cung cấp nội dung sản phẩm\n- Thực hiện các công việc theo yêu cầu khác của Trưởng bộ phận",
    "post_time": "20211227093046"
  },
  {
    "elem_id": 1453187,
    "title": "Chuyên Viên Quan Hệ Đối Tác và Dịch Vụ Bảo Hiểm",
    "company": "Ngân Hàng Thương Mại Cổ Phần Bảo Việt",
    "address": "Tầng 5, số 16 Phan Chu Trinh, Quận Hoàn Kiếm, Tp.Hà Nội",
    "url": "/chuyen-vien-quan-he-doi-tac-va-dich-vu-bao-hiem-1453187-jv",
    "benefits": "Travel Opportunities, Bonus, Healthcare Plan",
    "minSalary": "500",
    "maxSalary": "1000",
    "description": "- Thực hiện kế hoạch phát triển đối tác theo phân công của giám đốc trung tâm để bán sản phẩm dịch vụ theo chuỗi dành cho Khách hàng cá nhân và doanh nghiệp phù hợp với định hướng kinh doanh của BAOVIET Bank;\n- Xây dựng các chỉ tiêu để lựa chọn được đối tác chất lượng đồng thời xây dựng chính sách tương ứng để duy trì quan hệ lâu dài, hiệu quả với đối tác;\n- Tìm kiếm, liên kết hợp tác với các đối tác, quản lý hợp tác đối tác để hỗ trợ các đơn vị kinh doanh trong việc triển khai các sản phẩm dịch vụ dành cho Khách hàng cá nhân và Khách hàng doanh nghiệp của BAOVIET Bank;\n- Đàm phán và trình ban lãnh đạo ký kết hợp đồng với các đối tác;\n- Giám sát hiệu quả hợp tác đối tác và giải quyết những vấn đề phát sinh với đối tác trong thời gian hợp tác;\n- Xây dựng, triển khai các chương trình thúc đẩy kinh doanh, chính sách chăm sóc đối tác;\n- Soạn thảo các chính sách, quy chế, quy định và quy trình phục vụ cho công tác liên kết đối tác trên toàn hệ thống;\n- Tham mưu cho Giám đốc Trung tâm xây dựng kế hoạch hợp tác kinh doanh bảo hiểm, kế hoạch phát triển sản phẩm và trực tiếp triển khai kế hoạch kinh doanh bảo hiểm;\n- Thúc đẩy bán các sản phẩm bảo hiểm, xây dựng và triển khai/ Phối hợp xây dựng và triển khai các chiến dịch hợp tác kinh doanh bảo hiểm:\n+ Đầu mối tổ chức, theo dõi, quản lý, thúc đẩy bán và đánh giá việc triển khai các chương trình, chiến dịch hợp tác kinh doanh bảo hiểm;\n+ Tham gia phân phối trực tiếp các sản phẩm, dịch vụ bảo hiểm theo quy định của BAOVIET Bank và thỏa thuận hợp tác với các đối tác bảo hiểm.",
    "post_time": "20211227093046"
  },
  {
    "elem_id": 1452907,
    "title": "Junior Developer (Java, Scala, Python)",
    "company": "Công Ty TNHH Flinters Việt Nam",
    "address": "Discovery Complex , 302 Cau Giay, Ha Noi",
    "url": "/junior-developer-java-scala-python-1-1452907-jv",
    "benefits": "Healthcare Plan, Team Activities, Training",
    "minSalary": "0",
    "maxSalary": "0",
    "description": "-\tDevelop and maintain web application.\n-\tUnderstanding the requirements needed to perform the software/application development work required by each project.\n-\tResearching, designing, implementing and managing software programs based on company’s procedures.\n-\tEager to learn new things and ready to improve yourself in a Talented and Passionate Team.",
    "post_time": "20211227093045"
  },
  {
    "elem_id": 1450815,
    "title": "Dealer Operation Assistant Manager",
    "company": "Hino Motors Vietnam, LTD.",
    "address": "83 Ngoc Hoi, Hoang Liet, Hoang Mai, Hanoi",
    "url": "/dealer-operation-assistant-manager-1450815-jv",
    "benefits": "Bonus, Training, Travel Opportunities",
    "minSalary": "0",
    "maxSalary": "0",
    "description": "Main responsibility for Dealer Audit and Dealer Management as following:  \n1. Monthly Audit vehicle sales result (Retail, Stock, Registration)\n2. SOP Evaluation:  Sales performance & facility condition.\n3. Follow up progress of dealer developments.\n4. Other tasks assigned by Manager",
    "post_time": "20211227093048"
  },
  {
    "elem_id": 1450037,
    "title": "【2500$】Tuyển Kỹ Sư Cầu Nối BrSE",
    "company": "Neos Vietnam International Co., Ltd",
    "address": "7th Floor, Ocean Park Building, No.1 Dao Duy Anh, Phuong Mai, Dong Da, Ha Noi",
    "url": "/2500-tuyen-ky-su-cau-noi-brse-1-1-1-1-1-1-1-1450037-jv",
    "benefits": "Travel Opportunities, Healthcare Plan, Bonus",
    "minSalary": "1500",
    "maxSalary": "2500",
    "description": "- Kỹ sư cầu nối cho đội phát triển ở Việt Nam với khách hàng Nhật \n- Hiểu nội dung dự án thực hiện trao đổi Q&A trực tiếp với khách hàng qua email skype (or chatwork) \n- Quản lý tiến độ dự án báo cáo công việc định kỳ với khách hàng và ban giám đốc\n- Thực hiện coding testing fixing bugs theo yêu cầu của công việc\n\nĐịa điểm làm việc: 1 Đào Duy Anh Hà Nội",
    "post_time": "20211227093045"
  }
]
