[{"address": ["Helios Bldg + QTSC9, Quang Trung Software City, Tan Chanh Hiep Ward, District 12, Ho Chi Minh City, Vietnam, District 12, Ho Chi Minh", "Floor 6th, Phi Long Bldg, 52 Nguyen Van Linh Street, Nam Duong Ward, Hai Chau District, Danang City, Vietnam, Hai Chau, Da Nang"], "company": "Hitachi Vantara", "description": "International working environment\nCompetitive compensation package and benefits\nInteracting with leading-edge technologies\nDesign and build mobile applications for the Android platform.\nCollaborate with cross-functional teams to define, design, and ship new features.\nUnit-test code for robustness, including usability, and reliability.\nWork on bug fixing and optimization for application performance.\n2 - 5 year’s experience in Android development\nProficient in Java, Kotlin and strong understanding of Functional Program.\nExperience with concurrency including Thread, Handler, Rxjava, Coroutines and scheduling techniques.\nExperience in Unit test, UI test\nGood understanding about MVP/MVVM architecture for Android, Reactive patterns and dependency injection\nExperience with Git source control, Git Flow\nGood communication and interpersonal skills when working with external developers\nFluency in English.\nUnique opportunity to work with multinational team of Hitachi in over 130 countries.\nIncomparable chance to participate in full Software Development Life Cycle (SDLCs) and comprehensive soft skills training.\nCompetitive remuneration with attractive allowances & bonuses.\nOpportunities for advanced career development overseas, including the US, Japan...\nCompetitive & attractive compensation and benefits packages:Allowance for academy degrees and language certification, i.e. Master, Ph.D., English, Japanese language certifications.Subsidy for transportation and meals.13th salary & BonusAdditional International Insurance Package for employees.Company trip for employees.\nAllowance for academy degrees and language certification, i.e. Master, Ph.D., English, Japanese language certifications.\nSubsidy for transportation and meals.\n13th salary & Bonus\nAdditional International Insurance Package for employees.\nCompany trip for employees.\nBeing an integral part of a dynamic and fast growing global enterprise.\nAn open, professional and nourishing environment with out-side of work activities, such as football, tennis, badminton, dancing, music, and charity.\nAllowance for academy degrees and language certification, i.e. Master, Ph.D., English, Japanese language certifications.\nSubsidy for transportation and meals.\n13th salary & Bonus\nAdditional International Insurance Package for employees.\nCompany trip for employees.\n", "elem_id": "job_81767", "salary": "You'll love it", "title": "Android Developer (Java, Kotlin)", "url": "/it-jobs/android-developer-java-kotlin-hitachi-vantara-5636/content"},
{"address": ["02 Tan Vien, ward 2 Tan Binh, Tan Binh, Ho Chi Minh", "2/9 Street, Hai Chau, Da Nang"], "company": "KMS Technology", "description": "Inspired Leadership Team and Talented Colleagues\nOnsite opportunities: North America, Europe, Asia\nAttractive salary and benefits\nActively participate in the delivery and implementation of Informatics products and services by understanding customer requirements and demands and thoroughly investigating technical issues to ensure successful resolution.\nCommunicate effectively between customers, consultants, partners and the Services Management in a timely manner.\nOn time delivery against project and technical support plans ensuring customer satisfaction.\nTroubleshoot problems with Informatics software and solutions, reproduce difficult issues and develop workarounds and solutions where appropriate, sharing findings Work with other consultants to develop skills to lead project deliverables\nAttain technical knowledge to deliver standard and customized training courses to customers, and staff.\nRequirements analysis, documentation understanding.\nSystem configuration.\nTesting and validation of configured systems.\nSystem training for users.\nMaintain product and industry knowledge.\nGood spoken and written English\nHave experience in .NET, C#\nFast learning and willing to develop new skills\nStrong customer focus.\nAbility to work to set deadlines.\nAbility to set and meet expectations.\nAble to work as part of a team and be self-motivated.\nWell organized with an ability to prioritize work\nGood research, negotiation and problem-solving skills.\nGood written and oral communication skills.\nGood interpersonal skills.\nGood organizational skills.\nElementary or above in speaking and written Korean is big PLUS\nUnderstanding of Computer System Validation processes\nUnderstanding of the use of IT within the laboratory environment\nKnowledge of the pharmaceutical life science industries\nExperienced in Laboratory Informatics, for example inLIMS (preferred)ELNSDMS\nLIMS (preferred)\nELN\nSDMS\nInstrument Integration\nProject Management experience\nRecent higher degree graduates with a scientific and/or IT background and relevant work experience.\nLIMS (preferred)\nELN\nSDMS\nFrom Vietnam, we have crafted brilliant products for millions of global users.\nWe build awesome global products to conquer the world from Vietnam: QASymphony, Kobiton, Katalon, Grove, Witurn, Sprynkl and many more to come.\nWe’re committed to investing in our people and building a workplace you’ll love coming to every day.\nWorking in one of the Best Places to Work in Vietnam\nBuilding large-scale & global software products\nWorking & growing with Passionate & Talented Team\nDiverse careers opportunities with Software Outsourcing, Software Product Development, IT Solutions & Consulting\nAttractive Salary and Benefits\nPerformance appraisals every year\nOnsite opportunities: short-term and long-term assignments in U.S, Europe, Asia.\nFlexible working time\nVarious training on hot-trend technologies, best practices and soft skills\nPremium healthcare insurance for you and your loved ones\nCompany trip, big annual year-end party every year, team building, etc.\nFitness & sport activities: football, tennis, table-tennis, badminton, yoga, swimming…\nJoining community development activities: 1% Pledge, charity every quarter, blood donation, public seminars, career orientation talks,…\nFree in-house entertainment facilities (foosball, ping pong, gym…), coffee (latte, cappuccino, espresso) and snack (instant noodles, cookies, candies…)\n", "elem_id": "job_81760", "salary": "You'll love it", "title": "Sr. Technical Consultant (.NET, C#)", "url": "/it-jobs/sr-technical-consultant-net-c-kms-technology-3210/content"},
{"address": ["Tầng 14, 444 Hoàng Hoa Thám, Thụy Khuê, Tay Ho, Ha Noi", "2 Quang Trung, Hai Chau, Da Nang"], "company": "Ruby Development Vietnam", "description": "Cơ hội trở thành thành viên chủ chốt\nMôi trường trẻ, nhiều cơ hội thăng tiến\nCơ hội phát triển chuyên môn cao qua các dự án\nLập trình Ruby on Rails tuỳ yêu cầu của từng dự án.\nThực hiện thiết kế, coding, unit test các dự án cho khách hàng Nhật.\nTham gia vào tất cả các khâu trong quá trình phát triển phần mềm gồm: phân tích, thiết kế, tìm hiểu công nghệ, coding, test và maintain...\nTương tác với các thành viên trong nhóm và khách hàng theo điều phối của Manager.\nBáo cáo công việc cho Manager\nTừ 2-3 năm kinh nghiệm trở lên làm việc với Ruby, Ruby on rails, JavaScript\nCó kinh nghiệm về MySQL\nCó kinh nghiệm với một trong các Framework Javascript hiện đại: Angular 1/2, React.js, Vue.js\nHiểu biết về MVC, ORM, RESTful, OOP\nKiến thức tốt về kiểm thử phần mềm, kiểm thử tự động hóa (Rspec, Capybara)\nCó kinh nghiệm với HTML/CSS, Responsive web\nKỹ năng đọc tiếng Anh khá\nKỹ năng làm việc nhóm tốt\nCó kinh nghiệm làm việc trong quy trình phát triển Agile\nLàm quen với PostgreSQL, MongoDB, Dịch vụ web Amazon, GitLab, CircleCI, CodeClimate\nMức lương hấp dẫn upto 1500$\nLàm việc với các khách hàng, tập đoàn hàng đầu Nhật bản.\nCó thể luân chuyển công tác sang Nhật từ 2-12 năm tại Head Office và các chi nhánh của Ruby.\nTrở thành những kỹ sư hàng đầu về Ruby để tiếp tục đào tạo và hướng dẫn thế hệ tiếp theo.\nThưởng tháng lương thứ 13.\nThực hiện xét tăng lương 2 lần trên năm\nTrợ cấp xăng xe, ăn trưa, nhà ở, các phúc lợi khác trong năm.\nChế độ nghỉ phép và bảo hiểm theo Luật lao động.\nKhám sức khỏe định kỳ hằng năm\nCơ hội thăng tiến rõ ràng và trở thành thành viên chủ chốt.\nTham gia các dự án trọng điểm cùng đội ngũ kỹ sư chuyên nghiệp\nTham gia các buổi seminar hàng tuần nâng cao skill bản thân\nLàm việc từ thứ 2 đến thứ 6\nĐược hưởng 2 ngày phép trong 2 tháng thử việc khi vào làm chính thức.\nLàm việc từ 3 năm trở lên sẽ được hưởng thêm 3 ngày phép, từ 5 năm trở lên sẽ thêm 5 ngày phép\nDu lịch công ty 1 lần/năm, các hoạt động team building và hoạt động sinh hoạt hàng tháng khác: du lịch, picnic, sinh nhật, ăn uống hàng tháng, thưởng các ngày lễ, Tết, thưởng thi đua….\nCó nhiều cơ hội đi onsite tại Nhật Bản. Trong thời gian onsite tại Nhật Bản, ngoài lương nhận tại Việt Nam, trợ cấp sinh hoạt và toàn bộ vé máy bay, chi phí visa, đi lại, nhà trọ do công ty chi trả.\nMôi trường làm việc trẻ trung, năng động.\nSếp và đồng nghiệp cực thân thiện, vuitính.\n", "elem_id": "job_82453", "salary": "Up to $1500", "title": "3 Ruby on Rails/JavaScript Dev (VueJS)", "url": "/it-jobs/3-ruby-on-rails-javascript-dev-vuejs-ruby-development-vietnam-3954/content"},
{"address": ["02 Tan Vien, ward 2 Tan Binh, Tan Binh, Ho Chi Minh", "2/9 Street, Hai Chau, Da Nang"], "company": "KMS Technology", "description": "Inspired Leadership Team and Talented Colleagues\nOnsite opportunities: North America, Europe, Asia\nAttractive salary and benefits\nStrong experience in software analysis, design, and development in JAVA.\nExpertise in most of the following: Spring Framework, Hibernate, Junit, SQL, NoSQL.\nExperience with Object-Oriented Design (OOD)\nGood delegation and time management skills\nProblem-solving abilities\nNice to have, experienced in Testing Management system, Data Migration, ETL process.\nGood spoken and written in English\nEffective working relationships with all functional units of the organization,\nWorking ability to effectively recognize and manage interpersonal communication needs,\nAbility to work as part of a cross-cultural team including flexibility to support multiple locations when necessary,\nExcellent interpersonal skills in areas such as teamwork, facilitation, and negotiation, and\nAble to work independently or as part of a team.\nEffective communication skills; verbal, non-verbal and written; and ability to communicate on all levels of the organization.\nMaintenance and implement new features for tools/scripts based on customer requests.\nResponds to user requests and incident tickets\nResponsible for the creation of software support related documentation.\nResearch, recommend and provide solutions for project lead to win the deals.\nFrom Vietnam, we have crafted brilliant products for millions of global users.\nWe build awesome global products to conquer the world from Vietnam: QASymphony, Kobiton, Katalon, Witurn, Sprynkl and many more to come.\nWe’re committed to investing in our people and building a workplace you’ll love coming to every day.\nWorking in one of the Best Places to Work in Vietnam\nBuilding large-scale & global software products\nWorking & growing with Passionate & Talented Team\nDiverse careers opportunities with Software Outsourcing, Software Product Development, IT Solutions & Consulting\nAttractive Salary and Benefits\nPerformance appraisals every year\nOnsite opportunities: short-term and long-term assignments in U.S, Europe, Asia.\nFlexible working time\nVarious training on hot-trend technologies, best practices and soft skills\nPremium healthcare insurance for you and your loved ones\nCompany trip, big annual year-end party every year, team building, etc.\nFitness & sport activities: football, tennis, table-tennis, badminton, yoga, swimming…\nJoining community development activities: 1% Pledge, charity every quarter, blood donation, public seminars, career orientation talks,…\nFree in-house entertainment facilities (foosball, ping pong, gym…), coffee (latte, cappuccino, espresso) and snack (instant noodles, cookies, candies…)\n", "elem_id": "job_81742", "salary": "You'll love it", "title": "Senior Java Engineer, KMS Solutions", "url": "/it-jobs/senior-java-engineer-kms-solutions-kms-technology-5254/content"},
{"address": ["39 Le Thach Street, District 4, Ho Chi Minh", "110/5 Nguyen Huu Tho, Hoa Thuan Nam, Hai Chau, Da Nang"], "company": "Wonderlabs", "description": "Working with leading companies from Singapore\nAttractive salaries\nFun & dynamic working environment\nresponsible for designing, developing and testing an end to end solution to the platform\nassist in activities such as setting up build CI/CD and other software delivery automation and assist in deploying solution in the customer environment\nStrong verbal and written communication skills\nNODE JS, Python, Java Script, AWS, Typescript, Docker, Kubernetes and docker compose\nfamiliarity with machine learning and deep learning techniques\n4-8 years of experience B2B product start up experience is highly preferred\nExcellent communication in English\nProfessional development – Our software engineers are led by industry experts. Even the most experienced engineers will have opportunity to further develop their skill-sets and perceptions.\nGreat environment – Awesome team spirit. Creativity and innovations are our driving force. We are expanding very fast and you will be part of that success.\nApart from attractive salary and benefits, you get to work with fun colleagues that constantly challenge your thinking and ideas.\n", "elem_id": "job_82455", "salary": "2,000 - 3,500 USD", "title": "Sr Backend NodeJS Engineer(>4 years B2B)", "url": "/it-jobs/senior-backend-engineer-b2b-wonderlabs-4424/content"},
{"address": ["72 Lê Thánh Tôn, District 1, Ho Chi Minh", "23F Crystal Tower - 65 Hai Phong street, Hai Chau, Da Nang"], "company": "NFQ Asia", "description": "We truly value your thoughts and opinions\nGlobal and professional\nHonest, Transparent, Open-minded, Respect, Empathy\nYou will be joining an awesome startup team to build cool applications that serve millions of users, from idea to production.\nAs our customers are typically ambitious foreign startups, you will have a chance to improve your English, learn about startup culture and product mindset along the way. If you want to make a great impact on the world, this is your chance now.\nManaging full lifecycle customer projects with Agile methods.\nDeveloping strong relationships with customers, acting as the primary point of contact as well as managing stakeholder expectations and always seek for solution improvement.\nDesign, develop, test internal REST API\nDesign and implement scalable and robust applications\nAnalyze functional requirements and creation of software design\nParticipate in code and design reviews to maintain our high development standards\nWork closely with the infrastructure team in building and scaling back-end services as well as performing root-cause analysis investigations\nWrite API documentation for better communication with front-end developers\n5+ years of overall software development experience, with an emphasis on web applications and back-end technologies.\nWork experience in PHP (strongly preferred with Symfony)\nProficient understanding of code versioning tools (Git is preferred)\nDeep knowledge of web frameworks\nExperience in unit testing frameworks\nExperience in CI/CD methodologies\n2 years of experience in leading engineering teams\nGood at English communication\nExperience in these business domains: hotel booking, car rental, eCommerce platform\nProficiency in database design & SQL skills\nExperience in REST API development\nKnowledge on Realtime Communication (Pusher, PubNub, FireBase)\nStrong understanding of system performance and scaling\nTech Rockstar : Apply the latest technology\nExciting Projects : Working with overseas clients and awesome projects.\nGrowing Opportunity : Work with top-notch experts from around the world.\nOur core value:Honest we only tell the truth (upfront)Transparent we share information adequately, and openlyEmpathy sharing feelings mattersOpen-minded we approach things with candid attitudeRespect we treat everyone with the same kindness\nHonest we only tell the truth (upfront)\nTransparent we share information adequately, and openly\nEmpathy sharing feelings matters\nOpen-minded we approach things with candid attitude\nRespect we treat everyone with the same kindness\nHonest we only tell the truth (upfront)\nTransparent we share information adequately, and openly\nEmpathy sharing feelings matters\nOpen-minded we approach things with candid attitude\nRespect we treat everyone with the same kindness\nLaptop is provided.\nA fun & dynamic environment and freedom to be creative.\nRock in open-mind, kind & humble band.\nModern office with the flexible relaxing zone.\nCompany trip, team building & other community Tech activities.\nYear-end bonus.\nPerformance review  2 times/ year.\nExtra Medical Insurance.\n15 days annual leaves, working Monday – Friday.\n", "elem_id": "job_81728", "salary": "Up to $4,000", "title": "PHP Tech Lead (Laravel/Symfony)", "url": "/it-jobs/php-tech-lead-laravel-symfony-nfq-asia-0829/content"},
{"address": ["72 Lê Thánh Tôn, District 1, Ho Chi Minh", "23F Crystal Tower - 65 Hai Phong street, Hai Chau, Da Nang"], "company": "NFQ Asia", "description": "We truly value your thoughts and opinions\nGlobal and professional\nHonest, Transparent, Open-minded, Respect, Empathy\nAs a Technical Architect you’ll work as part of a team to deliver innovative, cost-effective and efficient IT solutions to an organization.\nYou will be responsible for driving technology strategy, building out the technology team of one of our main competencies (PHP, NodeJS, Javascript, Cloud Computing) and delivering on the shared growth vision. Deep understanding of Tech and Hands-On Attitude are a must (yes, sometimes you will need to jump in and show the boys how to code…)\nYou’ll be working with cutting edge frameworks, automation, and use the latest technologies for error tracking, reporting, and testing, with a high level of test coverage to maintain high-quality products that our clients use to run their entire business. We take pride in clean code built for our highly scalable systems. We work in small teams for clients from all around the world, follow agile work methods, and use continuous integration and delivery methodologies to move fast without sacrificing quality.\nYour task is to help firefight problems in the various teams as well as educate the teams to avoid them at all.\nDeveloping strong relationships with customers, acting as the primary point of contact as well as managing stakeholder expectations and always seeking for solution improvement.\nWork closely with the DevOps team in building and scaling back-end services as well as performing root-cause analysis investigations.\nReport directly to the Head of Engineering.\n5+ years of overall software development experience, with an emphasis on web applications, both Frontend (ReactJS / VueJS), Backend (PHP / Python / RoR) and DevOps.\nDeep knowledge of web frameworks and Cloud technologies.\nExperience in Automation Test frameworks\nExperience in CI/CD methodologies\n2 years of experience working as a Technical Architect.\nGood at verbal and written in English\nExperience in booking business domain (hotel booking, car rental)\nWork experience in Symfony, Elasticsearch, React (strongly preferred)\nProficiency in database design & SQL skills\nKnowledge on Real Time Communication (Pusher, PubNub, FireBase)\nStrong understanding of system performance and scaling\nTech Rockstar : Apply the latest technology\nExciting Projects : Working with overseas clients and awesome projects.\nGrowing Opportunity : Work with top-notch experts from around the world.\nOur core value:Honest we only tell the truth (upfront)Transparent we share information adequately, and openlyEmpathy sharing feelings mattersOpen-minded we approach things with candid attitudeRespect we treat everyone with the same kindness\nHonest we only tell the truth (upfront)\nTransparent we share information adequately, and openly\nEmpathy sharing feelings matters\nOpen-minded we approach things with candid attitude\nRespect we treat everyone with the same kindness\nHonest we only tell the truth (upfront)\nTransparent we share information adequately, and openly\nEmpathy sharing feelings matters\nOpen-minded we approach things with candid attitude\nRespect we treat everyone with the same kindness\nLaptop is provided.\nA fun & dynamic environment and freedom to be creative.\nRock in open-mind, kind & humble band.\nModern office with the flexible relaxing zone.\nCompany trip, team building & other community Tech activities.\nYear-end bonus.\nPerformance review  2 times/ year.\nExtra Medical Insurance.\n15 days annual leaves, working Monday – Friday.\n", "elem_id": "job_81727", "salary": "Up to 4,000 usd", "title": "Technical Architect (PHP, JavaScript)", "url": "/it-jobs/technical-architect-php-javascript-nfq-asia-0551/content"},
{"address": ["72 Lê Thánh Tôn, District 1, Ho Chi Minh", "23F Crystal Tower - 65 Hai Phong street, Hai Chau, Da Nang"], "company": "NFQ Asia", "description": "We truly value your thoughts and opinions\nGlobal and professional\nHonest, Transparent, Open-minded, Respect, Empathy\nWork with super nice clients, make sure that we understand their needs, and deliver their dreams.\nAs a central point of contact with our foreign clients, you will have a significant influence on our company’s success by using your excellent English communication skills, your head, and common sense.\nCollaborate with clients/business users to research and validate functional requirements\nCollaborate with team members throughout the Software Development Life Cycle process using Agile methodologies for requirements gathering, feedback on proposed designs and models\nDevelop and maintain E-commerce web applications for the global market.\nProven leadership skills. Your management skills and technical depth allows you to develop and mentor others as well as build credibility with your team while executing broader engineering strategies.\nExtensive knowledge of the platform's API\nStrong experience in PHP and Javascript\nBasic knowledge of HTML, CSS, jQuery\nIntermediate and higher English level.\nProficiency in searching and customization of the 3rd party Shopify plugins.\nExperience in site optimization and performance.\nExperience in solving cross-browser compatibility issues.\nStrong communication skills.\nAbility to work independently and in a team as well.\nTech Rockstar : Apply the latest technology\nExciting Projects : Working with overseas clients and awesome projects.\nGrowing Opportunity : Work with top-notch experts from around the world.\nOur core value:Honest we only tell the truth (upfront)Transparent we share information adequately, and openlyEmpathy sharing feelings mattersOpen-minded we approach things with candid attitudeRespect we treat everyone with the same kindness\nHonest we only tell the truth (upfront)\nTransparent we share information adequately, and openly\nEmpathy sharing feelings matters\nOpen-minded we approach things with candid attitude\nRespect we treat everyone with the same kindness\nHonest we only tell the truth (upfront)\nTransparent we share information adequately, and openly\nEmpathy sharing feelings matters\nOpen-minded we approach things with candid attitude\nRespect we treat everyone with the same kindness\nLaptop is provided.\nA fun & dynamic environment and freedom to be creative.\nRock in open-mind, kind & humble band.\nModern office with the flexible relaxing zone.\nCompany trip, team building & other community Tech activities.\nYear-end bonus.\nPerformance review  2 times/ year.\nExtra Medical Insurance.\n15 days annual leaves, working Monday – Friday.\n", "elem_id": "job_81725", "salary": "Up-to 3000$", "title": "Shopify Developer (PHP, Javascript)", "url": "/it-jobs/shopify-developer-php-javascript-nfq-asia-0445/content"},
{"address": ["Luxury Buildinng - Floor 6, 205 Tran Phu, Phuoc Ninh, Hai Chau, Da Nang"], "company": "Ubisoft", "description": "We DARE\nWe CARE\nWe WIN together\nWork with designers and game teams to build an engaging game hub application (PWA – Progressive Web App for mobile and web)\nOptimize game code and ensure game quality.\nProvide workload estimates to leads and management.\nCollaborate with local and remote team members.\nOther tasks assignment by Technical Director/Product Manager\n1+ year experience working with React Native\nExperience shipping applications for Android and iOS platforms\nExperience integrating third-party libraries and plugins\nSolid knowledge of Web client technologies HTML, CSS, H5\nExperience with one or more Web client frameworks such as Angular, React, etc\nProficient in JavaScript, Typescript\n", "elem_id": "job_81710", "salary": "You'll love it", "title": "React Native Developer", "url": "/it-jobs/react-native-developer-ubisoft-2434/content"},
{"address": ["Helios Bldg + QTSC9, Quang Trung Software City, Tan Chanh Hiep Ward, District 12, Ho Chi Minh City, Vietnam, District 12, Ho Chi Minh", "Floor 6th, Phi Long Bldg, 52 Nguyen Van Linh Street, Nam Duong Ward, Hai Chau District, Danang City, Vietnam, Hai Chau, Da Nang"], "company": "Hitachi Vantara", "description": "International working environment\nCompetitive compensation package and benefits\nInteracting with leading-edge technologies\nWork with project members, responsible for the design/code review, development, and implementation & testing.\nImplement task lists, estimate deliver assignments as functional specifications, quality standards and project schedules.\nConsistently delivers high-quality services and meet customer requirements. Other assignments from Project Manager.\n2 years of programming in C/C++\nJunior/Experienced Profiles are both welcomed\nNewcomers will be trained before working\nBasic knowledge of Embedded system\nPassionate about C/C++ programming\nHave knowledge in Object Oriented Programming Methodology.\nAbility to analyze/study new technical, new frameworks.\nHave knowledge in advanced programming techniques such as Multithread programming, Memory Management.\nUnique opportunity to work with multinational team of Hitachi in over 130 countries.\nIncomparable chance to participate in full Software Development Life Cycle (SDLCs) and comprehensive soft skills training.\nCompetitive remuneration with attractive allowances & bonuses.\nOpportunities for advanced career development overseas, including the US, Japan...\nCompetitive & attractive compensation and benefits packages:Allowance for academy degrees and language certification, i.e. Master, Ph.D., English, Japanese language certifications.Subsidy for transportation and meals.13th salary.Additional International Insurance Package for employees.Company trip for employees.\nAllowance for academy degrees and language certification, i.e. Master, Ph.D., English, Japanese language certifications.\nSubsidy for transportation and meals.\n13th salary.\nAdditional International Insurance Package for employees.\nCompany trip for employees.\nBeing an integral part of a dynamic and fast growing global enterprise.\nAn open, professional and nourishing environment with out-side of work activities, such as football, tennis, badminton, dancing, music, and charity.\nAllowance for academy degrees and language certification, i.e. Master, Ph.D., English, Japanese language certifications.\nSubsidy for transportation and meals.\n13th salary.\nAdditional International Insurance Package for employees.\nCompany trip for employees.\n", "elem_id": "job_81370", "salary": "You'll love it", "title": "C/C++ Developer (HCM - DaNang)", "url": "/it-jobs/c-c-developer-hcm-danang-hitachi-vantara-2940/content"},
{"address": ["364 Cong Hoa, Tan Binh, Ho Chi Minh", "Da Nang Viet Nam, Other, Da Nang"], "company": "NashTech", "description": "13th Salary + Yearly Performance Bonus\nPremium Health Insurance Package\nIntensive Training Program\nBuild automated testing tools and scripts for driving application tests.\nDefine, develop, implement, and maintain the automation test scripts.\nRecord and maintain source control of automation scripts.\nParticipate in review of project requirements to understand test objectives, to provide input on testability of requirements and estimation for the testing activities.\nProvide the testing approach, develop the automation test strategy, testing framework for automation testing projects..\nDesign the test case, writing the automation scripts.\nProvide training and mentoring to test automation engineers. This includes conducting code reviews, training test automation engineers on new coding and testing methodologies, guidelines, and best practices.\nContribute to the building of continuous Integration (CI) environment and ongoing Process improvement activities.\nCollaborative with project team to understand project objectives, gather automation requirements, design automated tests, and troubleshoot issues.\nParticipate in project meetings to discuss and agree on automation testing approach.\nDo manual testing when the project needed.\nUniversity level with bachelor’s degree in computer science.\nUnderstand the different kind of Test automation frameworks and automated testing approach.\nHave 3+ years of experience in automation testing for web or mobile applications.\nExperience in building the automation test framework using Selenium WebDriver\nProficiency in using automation test by scripting with any object-oriented programming language\nExperience in working with Agile/Scrum methodology at least 1 year.\nGood English communication (3/5)\nISTQB Certificate or equivalence.\nExperience in working with the CI/CD processes and tools (Jenkins, Git, or equivalent)\nExperience in Automated API Testing, Performance Testing and Security Testing\nExcellent problem solving skills and attention to detail.\n13 month salary per year\nPerformance bonus (up to 2-month salary)\nSocial – Health – Insurance paid fully\nHealthcare: Annual health check-up, Premium Health Insurance (plus 1 slot for your dependent)\nAnnual leaves: 14 ~ 18 days\nClubs program: Football, Badminton, Swimming, Tennis, Rock, Yoga…\nTraining courses: Technical skills – Soft skills – English\nProfessional and Flexible Working Environment\nGreat Teamwork\nInternational Assignments\nWeCare - WeShare - WeDare - WeInnovate Engagement Program\n", "elem_id": "job_82399", "salary": "You'll love it", "title": "Senior Automation Test Engineer", "url": "/it-jobs/senior-automation-test-engineer-nashtech-2304/content"},
{"address": ["364 Cong Hoa, Tan Binh, Ho Chi Minh", "Da Nang Viet Nam, Other, Da Nang"], "company": "NashTech", "description": "13th Salary + Yearly Performance Bonus\nPremium Health Insurance Package\nIntensive Training Program\nTo write software programs from design specifications that are in compliance with established coding quality standard of the company.\nPerform the code review, code refactor if required\nTo be trained or self-train on new technologies.\nPlans, executes and document unit/functional/integration tests\nEncourage to contribute the ideas for system architecture and design decisions.\nJoin in all required phases from planning, estimation, designing, developing the implementation, testing, and deployment to maintenance.\nAt least 3 years of experience in Java development\nHands-on practice with either Spring/Spring Boot with JPA/Hibernate/MongoDB or Java EE, Play Framework, OSGI…\nGood knowledge of web service development (RESTful/SOAP)\nExperience with OOP, DI/IoC, SOLID principles and software development best practices\nProficient in code review, code refactoring, Unit Testing\nAbility to work independently with high self-motivation and self-management and good team player\nGood in communication, especially in English\nPrefer for additional skills:JavaScript frameworks like Angular, ReactJS and VueJS…CMS like Liferay Portal, CQ5TDD / BDDDockerKotlinKafka\nJavaScript frameworks like Angular, ReactJS and VueJS…\nCMS like Liferay Portal, CQ5\nTDD / BDD\nDocker\nKotlin\nKafka\nJavaScript frameworks like Angular, ReactJS and VueJS…\nCMS like Liferay Portal, CQ5\nTDD / BDD\nDocker\nKotlin\nKafka\n13 month salary per year\nPerformance bonus (up to 2-month salary)\nSocial – Health – Insurance paid fully\nHealthcare: Annual health check-up, Premium Health Insurance (plus 1 slot for your dependent)\nAnnual leaves: 14 ~ 18 days\nClubs program: Football, Badminton, Swimming, Tennis, Rock, Yoga…\nTraining courses: Technical skills – Soft skills – English\nProfessional and Flexible Working Environment\nGreat Teamwork\nInternational Assignments\nWeCare - WeShare - WeDare - WeInnovate Engagement Program\n", "elem_id": "job_82398", "salary": "You'll love it", "title": "Senior Java Engineer (Spring, J2EE)", "url": "/it-jobs/senior-java-engineer-spring-j2ee-nashtech-2001/content"},
{"address": ["Thanh Loi 2 Building, 03 Le Dinh Ly, Thanh Khe, Da Nang"], "benefits": "Cutting-edge cloud technology, Attractive benefits and salary, We Care about People!", "company": "Vietnam IPS Software", "description": "Cutting-edge cloud technology\nAttractive benefits and salary\nWe Care about People!\nDevelop scalable cloud-based solutions utilizing latest web technologies (.NET, .NET core or JavaScript frameworks), MS Azure services, micro-services and NoSQL databases\nExplore the Industry 4.0 via IoT, AR, machine learning and more\nInvolve actively in technical and architectural decisions with your team and European colleagues\nLearn and improve gradually in accordance with your career path, trainings and certifications\nNurture your team-spirit in daily life of agile-driven projects, as well as off-work teambuilding activities\nMinimum 3 years of web development on commercial projects\nAffinity to work as frontend specialist, backend specialist or full stack developer\nKnowledge of .NET framework and related technologies (ASP.NET MVC/Core, WebAPI/REST, dependency injection, etc.) or web technologies such as AngularJS/Angular/ReactJS/VueJS, Typescript, ES6, SASS/LESS, Bootstrap, Gulp/Grunt, Webpack, etc.\nFundamental knowledge of Object-oriented programming, Domain Driven Design\nWriting clean and maintainable code\nUsage of source control systems (Git or TFS) and team collaboration tools\nEfficient communication in English\nOpenness to learn and adopt new technologies\nAnalytical thinking, independence, and reliability\nPro-active attitude\nKnowledge of relational databases concepts and object-oriented mapping tools (MS SQL, Entity Framework, PostgreSQL, MySQL etc.)\nExperience with implementing highly scalable and available applications\nExperience with NoSQL databases (MongoDB, Cosmos DB, etc.)\nExperience with MS Azure services or equivalent (AWS, Google Cloud)\nMulti paradigm (Functional and Object Oriented Programming) knowledge, knowledge of F#.\nFamiliar with CQRS, ES, Event-driven and Actor model principles.\nExperience with Docker, Kubernetes, CD/CI Jenkins or TFS\nExperience with automated testing and TDD (unit, integration, load, end to end etc.)\nExperience with hybrid mobile application development (Ionic, Cordova, React Native, Xamarin)\nWorking on exciting international high-tech projects with high quality standards\nAttractive salary with guaranteed 13th month salary\nRegular performance and salary reviews\nPerformance/contribution bonus based on company revenue, referral bonus, loyalty bonus\n20 days off (annual leaves and days off), work-life balance\nPrivate health-insurance with annual health-checks\nOpportunity to travel to Europe\nIn-house English lessons with native English teachers\nTrainings supported by dev sessions, hands-on trainings, certifications for your professional growth\nBrand new office in attractive location, paid motorbike parking, meal allowance\nFlexible working hours, occasional home office\nRegular company events, team building trip\n", "elem_id": "job_82322", "salary": "You'll love it", "title": "Web Developer (.NET/Angular/JavaScript)", "url": "/it-jobs/web-developer-net-angular-javascript-vietnam-ips-software-1817/content"},
{"address": ["Da Nang, Other, Da Nang"], "company": "Pascalia Asia Vietnam", "description": "New opportunities like Upper phases, DevOps and AI\nThousands of motivation like sharing the profit\nEnvironment like a company house and a lot of food\nAgile development, etc.\nPull request base using Github, etc.\nBackend: PHP / Node.js / Go / Java / Python / C # / VB etc.\nFront end: React.js / Angular.js / Vue.js etc.\nMysql / MongoDB / Oracle / RDS / dynamodb / SQLServer / Access etc.\nAWS / GCP / ECS / kubernetes etc.\nYou can handle numbers such as data analysis\nYou can always catch up the latest technological trends and incorporate them into yourself.\nYou can get a wide view of things in terms of structure\nPeople who like to move their hands and output by themselves\nA person who feels doubts about the current situation and can found the issue out what it should be (critical thinking)\nYou can understand things positively\nYou can honestly tell the other person what you are thinking without two faced\nYou can relax the place and reassure the members around you\nYou can ask what you don't understand, and genuinely and humbly related with people.\nHas the strength to express opinions frankly (but does not hurt the other party excessively)\nYou like to think about new things and mechanisms\nYou can be persistent in dealing with difficult situations for results\nYou can work with others toward your goals and get involved (need to be considerate and considerate of others)\nYou can learn from others without overconfidence in your skills\nThoughtful but not too obsessive, it can be evolved in discussions with others\nYou can create your own value while cooperating with others in various environments\nYou can feel the significance of existence by creating new value in society.\nConsidering the role of the team and the skills of the members, you can find the shortage and take the initiative to deal with it.\nI am delighted to improve my technical skills and acquire knowledge\nYou can connect what you want to do with your contribution to society\n", "elem_id": "job_81261", "salary": "800 - 2,800 USD", "title": "Angular.js/Vue.js/Node.js/React.js", "url": "/it-jobs/angular-js-vue-js-node-js-react-js-pascalia-asia-vietnam-2112/content"},
{"address": ["Tầng 21, Tòa nhà HANDICO, Phạm Hùng, Nam Tu Liem, Ha Noi", "Toà nhà Thông Tấn Xã Việt Nam số 81 Quang Trung, Hai Chau, Da Nang"], "company": "RIKKEISOFT", "description": "Môi trường làm việc đa quốc gia\nCơ hội thăng tiến, phát triển bản thân\nTrải nghiệm làm việc ngắn/dài hạn tại Nhật Bản\nPhát triển các dự án cho khách hàng trong nước và nước ngoài về hệ thống thương mại điện tử, sàn giao dịch tiền ảo, hệ thống bảo hiểm, quản lý tài sản, quản lý vận tải, du lịch, khách sạn.\nPhạm vi công việc từ làm rõ yêu cầu của khách hàng, viết tài liệu thiết kế hệ thống cho đế develop, testing, deploy và vận hành hệ thống cho khách hàng.\nThiết kế, coding và kiểm thử hệ thống hoặc chức năng sau khi hoàn thành.\nXây dựng kế hoạch và quản lý tiến độ lập trình theo kế hoạch.\nNghiên cứu nắm bắt công nghệ mới.\nTham gia các khóa đào tạo liên quan tới công việc do Công ty tổ chức.\nMức lương: $500 - $1500\nTối thiểu 13 tháng lương/năm. Xét TĂNG 2 lần/năm.\nThưởng Tết, thưởng dự án, thưởng ngày lễ, thưởng giới thiệu nhân sự...\nCó tiếng Nhật, nhận phụ cấp mỗi tháng (N1: 5 triệu đồng, N2: 3 triệu đồng, N3: 1 triệu đồng).\nPhụ cấp thâm niên (thời gian làm việc từ 2 năm trở lên).\nTham gia lớp học tiếng Nhật miễn phí có giáo viên bản địa giảng dạy.\n5 ngày làm việc chính thức/ tuần, nghỉ phép 1 ngày/tháng. Tham gia hoạt động Thứ 7 Truyền Nghề hàng tuần, có phụ cấp và hỗ trợ ăn trưa.\nNghỉ thứ 7, chủ nhật + 12 ngày phép/ năm (Cộng dồn tối đa 20 ngày phép/năm, các ngày phép còn thừa sau cộng dồn sẽ được trả 500.000đ/ngày).\nCâu lạc bộ và nhiều hoạt động văn hóa - thể thao - nghệ thuật được công ty tài trợ hoặc hỗ trợ (Ví dụ: Bóng đá, bóng bàn, cầu lông, bơi lội, âm nhạc, tiếng anh, game...)\nĐảm bảo sức khỏe: Khám sức khỏe định kỳ, hỗ trợ mua bảo hiểm sức khỏe chất lượng cao...\nTham gia Chương trình bảo hiểm sức khỏe Rikkei Care.\nThoải mái tinh thần: Phát nhạc theo yêu cầu mỗi ngày, hoa quả tươi, các hoạt động teambuilding gắn kết... Đi chơi gần xa khắp nơi.\nCơ hội đi Nhật Bản làm việc và du lịch khắp nơi.\n", "elem_id": "job_81199", "salary": "You'll love it", "title": "Java Developers (Spring, MVC, SQL)", "url": "/it-jobs/java-developers-spring-mvc-sql-rikkeisoft-4138/content"},
{"address": ["150 Ly Trien, Thanh Khe, Da Nang"], "company": "COMINIT", "description": "Tham gia vào các dự án thiết kế, phát triển các sản phẩm mới theo yêu cầu của khách hàng và các sản phẩm chiến lược của công ty.\nTư vấn, nghiên cứu, phát triển sản phẩm theo các công nghệ mới.\nTham gia bảo trì, nâng cấp chức năng, giao diện theo yêu cầu của khách hàng trên hệ thống website hiện có.\nTốt nghiệp đại học, cao đẳng chuyên ngành CNTT hoặc liên quan\nCó kiến thức nền tảng về giải thuật và cấu trúc dữ liệu\nCó nền tảng về PHP, có hiểu biết về MySQL, CSS, HTML, JavaScript\nDatabase: RDBM (MySQL)\nHiểu biết về HTML5, CSS3, JS (Jquery)\nCó khả năng sử dụng các ngôn ngữ khác như (Nodejs, Java, ...) là một lợi thế\nMôi trường làm việc năng động, tích cực, thoải mái cùng với đồng nghiệp cởi mở, thân thiện\nVăn hóa làm việc chuyên nghiệp, được hỗ trợ phát huy tối đa năng lực cá nhân\nĐược hỗ trợ về thời gian và người hướng dẫn để thích nghi với công việc mới\nNhận mức lương từ 400 USD đến 1000 USD (Net) và thưởng hấp dẫn, xứng đáng với thành quả công việc\nĐược tăng lương định kỳ\nĐược hưởng đầy đủ các chế độ đãi ngộ và khoản bảo hiểm BHXH, BHYT, BHTN.\nKhám sức khỏe định kì hằng năm\nĐược hưởng tháng lương 13 ( hoặc nhiều hơn tùy năng lực)\nChế độ teambuilding hằng tháng\nChế độ sinh nhật, lễ, du lịch hằng năm\nỨng viên có tiếng Nhật sẽ được trao cơ hội làm việc và đào tạo tại Nhật Bản\nThời gian làm việc: 8h-12h và 13h-17h, từ thứ 2 đến thứ 6.\n", "elem_id": "job_81149", "salary": "You'll love it", "title": "Web System Dev (PHP, HTML5, MySQL)", "url": "/it-jobs/web-system-dev-php-html5-mysql-cominit-0455/content"},
{"address": ["02 Quang Trung, Hai Chau, Da Nang"], "company": "IF Vietnam", "description": "Xây dựng Theme WordPress theo yêu cầu\nPhát triển plugin\nChi tiết công việc sẽ được trao đổi khi phỏng vấn\nCó kinh nghiệm làm WordPress trên 3 năm.\nHoan nghênh những ứng viên có kinh nghiệm về các lĩnh vực khác của CMS.\nLương thưởng theo năng lực làm việc\nĐược hưởng bảo hiểm xã hội, bảo hiểm y tế, bảo hiểm thất nghiệp theo chế độ nhà nước ban hành.\nĐánh giá và xét lương hàng năm\n12 ngày phép/ năm\nCompany trip hàng năm\nKhám sức khỏe 1 năm/1 lần\n", "elem_id": "job_81565", "salary": "You'll love it", "title": "Wordpress Developer (PHP)", "url": "/it-jobs/wordpress-developer-php-if-vietnam-2238/content"},
{"address": ["Tòa nhà FPT Complex, Đường Nam Kỳ Khởi Nghĩa, Phường Hòa Hải, Ngu Hanh Son, Da Nang"], "company": "FPT Software", "description": "Global Exposure\nFast Track Career\nDiversified Jobs & Technologies\nCheck the contents of the monitoring event and share the contents with the person in charge of the system\nBuild, release, and manage the configuration of all production systems\nWork alongside architecture and engineering teams to design and implement any scalable software services\nInvestigate incident on Teradata Job Services\nTeradata Job Management\nStrong Teradata SQL skills\nStrong UNIX skills\nStrong data debugging skills\nStrong BTEQ Skills\nFamiliarity with Control-M\nProblem solving skills and ability to think algorithmically\nAWS Certificate is plus\nFluent English is plus\nITIL process knowledge and experience is plus.\nSalary : up to 2,000$\nSigning bonus up to 20M\n“FPT care” health insurance provided by AON and is exclusive for FPT employees.\nCompany shuttle buses provide convenient way of transportation for all employees.\nAnnual Summer Vacation: follows company’s policy and starts from May every year\nSalary review 1 times/year or on excellent performance\nInternational, dynamic, friendly working environment\nAnnual leave, working conditions follow Vietnam labor laws.\n", "elem_id": "job_82218", "salary": "Up to 2,000$", "title": "Teradata Engineer (Database, SQL) ~$2000", "url": "/it-jobs/teradata-engineer-up-to-2000-fpt-software-1544/content"},
{"address": ["Tòa nhà FPT Complex, Đường Nam Kỳ Khởi Nghĩa, Phường Hòa Hải, Ngu Hanh Son, Da Nang"], "company": "FPT Software", "description": "Global Exposure\nFast Track Career\nDiversified Jobs & Technologies\nTham gia tư vấn/ triển khai các dự án nâng cấp, chuyển đổi công nghệ (SQL, Oracle, NoSQL,...).\nHỗ trợ bộ phận Phát triển phần mềm các vấn đề liên quan đến Cơ sở dữ liệu trong việc xây dựng ứng dụng như nền tảng công nghệ (Data models, Data visualization, Dashboard & Ad hoc Reporting), thiết lập môi trường phát triển, môi trường kiểm thử.\nTài liệu hóa thiết kế, quy trình, hướng dẫn tiêu chuẩn. Phát triển tài liệu kịch bản xử lý khắc phục sự cố cơ sở dữ liệu, chiến lược sao lưu & phục hồi dữ liệu, dự phòng thảm họa (Business Continuity Plan/ Disaster Recovery Plan).\nXây dựng các giải pháp High Availability hệ thống Cơ sở dữ liệu như: Replication, Clustering, Always-On, RAC, GoldenGate, DataGuard, Sharding,...\nThiết kế, tuning Store Procedure, Functions, View, Trigger, Package...\nLập bản đồ và giám sát hiệu suất cơ sở dữ liệu;\nBảo trì chuẩn đoán hệ thống, đánh giá nâng cấp hệ thống Cơ sở dữ liệu.\nPhân tích, xử lý khắc phục các sự cố liên quan đến hệ thống CSDL. Sao lưu/Phục hồi, dự phòng.\nThực hiện các báo cáo hệ thống theo yêu cầu.\nTốt nghiệp Đại học chính quy chuyên ngành Hệ thống thông tin, Khoa học máy tính, Công nghệ thông tin.\nTrung thực, cẩn thận, cầu tiến. Yêu thích công việc DBA\nCó kỹ năng lập trình tốt T-SQL, PL/SQL. Có kiến thức chuyên môn tốt về Performance và Tuning, Data models, Data Structure, các hệ quản trị CSDL (SQL, Oracle, MySQL, PostGres, MongoDB...).\nKhả năng đọc hiểu tài liệu tiếng anh tốt, giao tiếp cơ bản.\nKỹ năng thuyết trình tốt, tự tin, làm việc nhóm, năng động, dám vượt trội, tuân thủ kỷ luật, trách nhiệm.\nKhả năng nghiên cứu, làm việc độc lập, dưới áp lực lớn.\nMức lương cạnh tranh.\nThưởng nóng lên đến 20 triệu\nCơ hội làm việc với các khách hàng lớn của Nhật, công nghệ tiên tiến, phát triển bản thân…\nMôi trường làm việc cởi mở, dân chủ, đặc trưng văn hóa FPT\nChế độ chăm sóc sức khỏe đặc biệt dành cho nhân viên và người thân (FPTcare)\nVà rất nhiều quyền lợi hấp dẫn khác …\n", "elem_id": "job_82213", "salary": "You'll love it", "title": "Database Administrator (SQL)", "url": "/it-jobs/db-administrator-fpt-software-0352/content"},
{"address": ["Tòa nhà FPT Complex, Đường Nam Kỳ Khởi Nghĩa, Phường Hòa Hải, Ngu Hanh Son, Da Nang"], "company": "FPT Software", "description": "Global Exposure\nFast Track Career\nDiversified Jobs & Technologies\nMonitoring system performance and recommend corrective action\nAnalysing and supporting infrastructure in AWS\nService request handling (AWS Security Group added, OS authorization granted,…)\nConfiguration Management (Backup, Restore,…)\nChange management: AWS EC2 Type change, AWS EC2 deployment, OS (Windows, Linux) setting change,…\nAWS resource inventory management\nCollege graduated or higher in Computer Science, IT, Engineering, or related filed\nTo have experience working with AWS or other cloud platform administration\nAt least 3+ years' experience working as Solution Architect/AWS Operations Engineer or experience in a similar roles.\nAssociates Degree in a related field (Networking, Software Development, Database Administration)\nBasic at reading / writing in English\nTo have knowledge of the following items:Scripting languages such as Bash, Python, and PowershellLinux and Linux AdministrationContainerization technologies such as Docker, Kubernetes, Amazon ECS\nScripting languages such as Bash, Python, and Powershell\nLinux and Linux Administration\nContainerization technologies such as Docker, Kubernetes, Amazon ECS\nITIL process knowledge and experience is plus.\nAWS SA/SysOps/Developer Associate certificate is plus.\nScripting languages such as Bash, Python, and Powershell\nLinux and Linux Administration\nContainerization technologies such as Docker, Kubernetes, Amazon ECS\nSalary : up to 2,000$\nSigning bonus up to 20M\n“FPT care” health insurance provided by AON and is exclusive for FPT employees.\nCompany shuttle buses provide convenient way of transportation for all employees.\nAnnual Summer Vacation: follows company’s policy and starts from May every year\nSalary review 1 times/year or on excellent performance\nInternational, dynamic, friendly working environment\nAnnual leave, working conditions follow Vietnam labor laws.\n", "elem_id": "job_82216", "salary": "Up to 2,000$", "title": "Cloud Operations Engineer (AWS)", "url": "/it-jobs/cloud-operations-engineer-aws-fpt-software-1250/content"},
{"address": ["2F Ricco building, 363 Nguyen Huu Tho, Cam Le, Da Nang"], "company": "SupremeTech", "description": "We appreciate your thoughts and opinions\nStart up to Scale up\nTop notch RnD team lead by Google Developer\n", "elem_id": "job_82183", "salary": "1,000 - 2,000 USD", "title": "Project Manager/Scrum Master (Agile)", "url": "/it-jobs/project-manager-scrum-master-agile-supremetech-1752/content"},
{"address": ["27 Che Viet Tan, Hoa Xuan, Cam Le, Da Nang"], "company": "Enlab Software", "description": "Open, friendly work environment with flexible time\nExclusive technical & soft skills training course\n6-month review, 13th month and performance bonus\nYou will liaise with different teams/clients to provide the best solutions for product requirements and designs.\nYou will collaborate with the team and work directly with clients to develop and provide high quality work products.\nWhen you are not coding, you will participate in reviewing other membersâ€™ code or researching new products and technologies.\nYou will get hands-on experience in delivering training, motivating your teammates to go beyond their potentials, or perhaps persuading people who do not agree with you.\nLast but not least, you will be trained and work with some latest and hot technologies/architectures such as: Micro-services, Azure, AWS cloud services, Angular, VueJS and Flutter.\nExperience in developing applications using Python (Scripting, Web Frameworks and REST APIs).\nGood knowledge at one of Python Web Framework such as Django, Flask, etc. depending on your technology stack.\nExperience in using databases like PostgreSQL, MySQL is desired.\nBasic understanding of Frontend technologies, such as JavaScript, HTML5, and CSS3.\nGood knowledge of web application development and Agile/SCRUM methodology.\nPassionate about programming, solving complex technical problems.\nGood written and verbal English communication skills.\nExperience in front-end development (Angular/VueJS)\nExperience working with REST APIs and Open API/Swagger.\nFamiliarity with some ORM (Object Relational Mapper) libraries.\nHands-on experience and thorough knowledge in data structures and algorithms.\nGood understanding about OOP, SOLID, Dependency injection.\nHands-on experience on Linux/Unix development environments is a plus.\nProficient understanding of code versioning tools such as Git, Bit Bucket.\nAttractive salary with 13th month salary and performance bonus - you get what you deserved.\nPerformance review and salary increase every 6 months.\nAll allowances and benefits by Vietnam's Labor Law.\nFlexible working time - in the end, only the result that matters.\nAnnual Health Check-up, mindfulness area and massage chair for your muscles - health is greatest wealth.\nAnnual company trip, internal events, party every month and club funding for team activities - work hard? let's play hard too.\nCafeteria area with snacks and drinks available all the time for your happy belly.\nFriendly, supportive and professional, yet hyper colleagues who are always there for you.\nExclusive technical, soft skills training and English course for personal development.\n", "elem_id": "job_81591", "salary": "You'll love it", "title": "Python Dev (Django/Flask)- Up to 1500$", "url": "/it-jobs/python-dev-django-flask-up-to-1500-enlab-software-1515/content"},
{"address": ["N/A, District 1, Ho Chi Minh", "N/A, Hai Chau, Da Nang"], "benefits": "Attractive salary, Good working environment, Work remote", "company": "Resola Inc", "description": "Attractive salary\nGood working environment\nWork remote\nUse markup languages like HTML to create user-friendly web pages\nMaintain and improve application\nOptimize applications for performance and usability\nDesign mobile-based features\nCollaborate with back-end developers and web designers to improve usability\nGet feedback from, and build solutions for, users and customers\nWrite functional requirement documents and guides\nHelp back-end developers with coding and troubleshooting\nEnsure high quality standards and brand consistency\nStay up-to-date on emerging technologies\nCan communicate in English both verbally and written\nProven work experience as a Front-end developer\nIn-depth understanding of the entire web development process (design,\nUnderstanding of layout aesthetics\nKnowledge of multiple front-end languages and libraries (e.g. HTML/ CSS,\nKnowledge of multiple frameworks (e.g. React)\nFamiliarity with browser testing and debugging\nFamiliarity with development tools (e.g. Git, Docker)development and deployment)\nFamiliarity with software like Adobe Suite\nExcellent communication and teamwork skills\nGreat attention to detail\nOrganizational skills\n", "elem_id": "job_82166", "salary": "1,800 - 3,000 USD", "title": "Remote React JS Frontend Engineer", "url": "/it-jobs/remote-react-js-frontend-engineer-resola-inc-0923/content"},
{"address": ["Luxury Buildinng - Floor 6, 205 Tran Phu, Phuoc Ninh, Hai Chau, Da Nang"], "benefits": "High remuneration package, Bonus and Rewards, Creative & endless fun project", "company": "Ubisoft", "description": "High remuneration package\nBonus and Rewards\nCreative & endless fun project\nWork with core technology team to create frameworks, APIs, and tools for use by large-scale online multiplayer casual games.\nCreate web-based dashboards and other tools to support live game operation, analytics, deployment, and testing.\nWork with game teams to build flexible, robust client and server-side APIs (Javascript/TS) which can be used for rapid creation and deployment of HTML5 games.\nProficiency in fundamental front-end languages such as HTML, CSS, and JavaScript.\nFamiliarity with JavaScript frameworks such as Angular JS, React, and Amber.\nExperience with one or more server frameworks, such as Node.js / Express, etc.\nExperience with REST-style interfaces and other web service-related technologies\nExperience with database technology such as MySQL, Oracle, and MongoDB, Redis\nExperience building/working with scalable systems for large numbers of users (load balancing, DB sharding)\nExperience with social platform integration such as Facebook, Wechat, etc.\nExperience with long-connection programmings, such as with TCP/IP, Websockets, Socket.io, etc.\nAn international, professional, collaborative, modern and creative environment\nAttractive remuneration package\nPerformance rewards\nCreative & endless fun projects\nFlexible working time\nPremium healthcare insurance for you and your family\nTeam building, Lunar New year Celebration, Projects celebration\nBeers and treats every Friday  (yay!)\nStaff clubs\nFree in-house entertainment facilities (PS5, Switch, Arcade Machine…), coffee, tea, and fresh fruits)\n", "elem_id": "job_81561", "salary": "You'll love it", "title": "Full stack Developer (React/ NodeJs)", "url": "/it-jobs/full-stack-developer-react-nodejs-ubisoft-5048/content"},
{"address": ["39 Le Thach Street, District 4, Ho Chi Minh", "110/5 Nguyen Huu Tho, Hoa Thuan Nam, Hai Chau, Da Nang"], "company": "Wonderlabs", "description": "Working with leading companies from Singapore\nAttractive salaries\nFun & dynamic working environment\nProfessional development – Our software engineers are led by industry experts. Even the most experienced engineers will have opportunity to further develop their skill-sets and perceptions.\nGreat environment – Awesome team spirit. Creativity and innovations are our driving force. We are expanding very fast and you will be part of that success.\nApart from attractive salary and benefits, you get to work with fun colleagues that constantly challenge your thinking and ideas.\n", "elem_id": "job_81541", "salary": "1,500 - 2,500 USD", "title": "Cloud Engineer (Microsoft Azure)", "url": "/it-jobs/cloud-engineer-microsoft-azure-wonderlabs-4210/content"},
{"address": ["539 Lầu 3,GMG Building,Lý Thường Kiệt, Tan Binh, Ho Chi Minh", "39 Quang Trung, Hai Chau, Da Nang"], "company": "Nexle Corporation", "description": "Attractive salary\nExcellent working environment\nHigh compensation\nReview business requirements working with team members\nPerform a technical analysis of requirements\nProduce a solid, detailed technical design\nWrite clean, modular, robust code to implement the desired requirements with little or no supervision\nWork with the other partners to triage and fix bugs with rapid turnaround\nContribute ideas for making the application better and easier to use\nDevelop and maintain application using .NET, C#, NodeJS or ReactJS\nActive participation in customer/partner design meetings and general engagements\nEnsure on time, on budget, and the quality of the product.\nB.S. in Computer Science, or equivalent\n3+ years experienced developing web application and API\n2+ years experienced working on .NET (C#)/NodeJS and ReactJS\nExperienced in Angular is a plus\nBe creative and good at user experiences\nA creative mind which can work alongside a very drunk design and creative team\nHighly organised driven individual with skills in an agency environment\nGood English communication skills\nA commitment to quality and a thorough approach to work\nGood teamwork and reliability\nDrive and enthusiasm with the ability to manage and co-ordinate multiple projects\nChance to work with people across continents U.S, Australia, United Kingdom\nChance to work overseas based on the request from clients\nChance to improve English skill since the main communication is English during working hours.\nChance to improve the technical skill during working with clients on new technology.\nBe encouraged and rewarded with attractive remuneration for initiating the ideas that brings the innovation\nEnglish training in VUS School for team leaders and key staff.\nTechnical and soft skill training.\nSpecial health care insurance:\nPersonal accident: 210,000,000/occurrence and no limited occurrences\nHealth insurance: 63,000,000/disability and no limited disabilities\n13rd month salary as permanent bonus,\nOther bonuses depend on the performance and contributions to the project/company.\nAnnual company trip\nThere are 1-2 PAs (Performance Appraisal) per year. The percentage of salary adjustment is 10%-24% depending on the individual’s performance within a specific period.\nAdhoc salary review and promotion are performed in the year.\nProvide laptop for working and can take home.\nFor iOS development, the company provides a MAC MINI for normal developers. For the team leader, the company provides a MAC BOOK PRO for working.\nProfessional working space in office building: Coffee is served every day, Microwave oven and refrigerator serving lunch in the office\nHaving monthly happy hour either in the office or outside\nSport clubs: Football, Badminton.\n", "elem_id": "job_81508", "salary": "Upto 1500 based on skills", "title": "Fullstack Developer (NodeJS/C#/ReactJS)", "url": "/it-jobs/fullstack-developer-nodejs-c-reactjs-nexle-corporation-4442/content"},
{"address": ["7 Phan Chau Trinh, Hải Châu 1, Hai Chau, Da Nang"], "company": "mgm technology partners Vietnam", "description": "Professional IT company - Globally connected\nSkilled and passionate developers\nYoung office environment with top-notch equipment\nWork for international customers\nWork with colleagues from Germany, France, the Czech Republic and the US\nBe responsible for the success of your project\nDesign, implement and test web applications\nCollaborate on requirement analysis and specifications\nShare knowledge and experience with your colleagues\nWorking time: 40 hours / week, flexible\nStrong skills in frontend development\nTypeScript, ReactJS, Redux is an advantage\nUnderstanding of software development tools, processes and architecture\nDegree in engineering or natural sciences (university or technical college)\nVery good English both written and spoken\nSense of responsibility, communication skills and team spirit\nWillingness to learn and build a deep understanding\nA passion for software development, new trends and technologies in IT\nFrom 2+ years of professional experience in international software projects\nGood salary and a bonus if things work well\nWorking & growing with an international team\nOnsite opportunities: short-term and long-term assignments in Europe\nRelocate support (for candidates from HN, HCMC want to move to DN): an apartment is provided for the first month in DN\n16 days off allowance per year\nPremium insurance for you and your spouse (husband or wife) & yearly check-up\nFlexible working time (40h/week)\nWorking from home policy\nHighly professional equipment (own laptop, 2 screens, adjustable desks)\nIntense English course for the first 3 months by our native English teachers\nOptional English seminars during the work time\nAn amazing company trip once a year, month-end with the whole company and team building with the project team every month covered by mgm\nFree in-house entertainment facilities (darts, piano, climbing wall), drinks (coffee, beer, soft drinks,…) and food (cookies, fruit,…) and out-house company-funded sport clubs (football, swimming, badminton).\n", "elem_id": "job_81482", "salary": "You will love it", "title": "Frontend Developer (JavaScript, ReactJS)", "url": "/it-jobs/frontend-developer-javascript-reactjs-mgm-technology-partners-vietnam-3531/content"},
{"address": ["7 Phan Chau Trinh, Hải Châu 1, Hai Chau, Da Nang"], "benefits": "Attractive Package, Private health care for family, Europe onsite opportunities", "company": "mgm technology partners Vietnam", "description": "Attractive Package\nPrivate health care for family\nEurope onsite opportunities\nWork for international customers\nWork with colleagues from Germany, France, the Czech Republic and the US\nBe responsible for the success of your project\nDesign, implement and test web applications\nCollaborate on requirement analysis and specifications\nShare knowledge and experience with your colleagues\nWorking time: 40 hours / week, flexible\nStrong skills in web technologies, JEE, SQL\nExperience with multi-tier or service-oriented web applications\nUnderstanding of software development tools, processes and architecture\nKnowledge of Typescript, Spring, Hibernate is an advantage\nIf you do DevOps or interested in Security, we are also curious to get to know you\nFrom 3 years of professional experience in international software projects\nDegree in engineering or natural sciences (university or technical college)\nVery good English both written and spoken\nSense of responsibility, communication skills and team spirit\nWillingness to learn and build a deep understanding\nA passion for software development, new trends and technologies in IT\nGood salary and a bonus if things work well\nWorking & growing with an international team\nRelocate support (for candidates from HN, HCMC want to move to DN): an apartment is provided for the first month in DN.\nOnsite opportunities: short-term and long-term assignments in Europe\n16 days off allowance per year (on top of public holidays like Tet)\nPremium insurance for you and your spouse (husband or wife) & yearly check-up.\nFlexible working time (40h/week)\nWorking from home policy\nHighly professional equipment (own laptop, 2 screens, adjustable desks)\nIntense English course for the first 3 months by our native English teachers\nOptional English seminars during the work time\nAn amazing company trip once a year, month-end with the whole company and team building with the project team every month covered by mgm\nFree in-house entertainment facilities (darts, piano, climbing wall), drinks (coffee, beer, soft drinks,…) and food (cookies, fruit,…) and out-house company-funded sport clubs (football, swimming, badminton).\n", "elem_id": "job_81481", "salary": "You will love it", "title": "Java Developer (Spring, Typescript)", "url": "/it-jobs/java-developer-spring-typescript-mgm-technology-partners-vietnam-3502/content"},
{"address": ["27 Che Viet Tan, Hoa Xuan, Cam Le, Da Nang"], "company": "Enlab Software", "description": "Open, friendly work environment with flexible time\nExclusive technical & soft skills training course\n6-month review, 13th month and performance bonus\nYou will liaise with different teams/clients to provide the best solutions for product requirements and designs.\nYou will collaborate with the team and work directly with clients to develop and provide high quality work products.\nWhen you are not coding, you will participate in reviewing other members’ code or researching new products and technologies.\nYou will get hands-on experience in delivering training, motivating your teammates to go beyond their potentials, or perhaps persuading people who do not agree with you.\nLast but not least, you will be trained and work with some latest and hot technologies/architectures such as: Micro-services, Azure, AWS cloud services, Angular, VueJS and Flutter.\nGood knowledge in software/web application development using C#, ASP.NET, .NET Core, Microservice.\nExperience in front-end development skill (HTML5/CSS3, JavaScript, Bootstrap, Angular, VueJS).\nExperience working with SQL/SQL Server, MongoDB.\nHave good knowledge and experience with Agile/SCRUM development method.\nDesire to solve complex problems and work with new technologies.\nStrong conceptual, analytic, and problem solving skills.\nAbility to communicate with clients in English clearly.\nA team player and an independent underground leader who is fearless to voice.\nHaving experience working with DevExtreme, KendoUI is an advantage.\nBackground in CI/CD, Docker, or distributed systems.\nSOLID, DRY and other best practices.\nAttractive salary with 13th month salary and performance bonus - you get what you deserved.\nPerformance review and salary increase every 6 months.\nAll allowances and benefits by Vietnam's Labor Law.\nFlexible working time - in the end, only the result that matters.\nAnnual Health Check-up, mindfulness area and massage chair for your muscles - health is greatest wealth.\nAnnual company trip, internal events, party every month and club funding for team activities - work hard? let's play hard too.\nCafeteria area with snacks and drinks available all the time for your happy belly.\nFriendly, supportive and professional, yet hyper colleagues who are always there for you.\nExclusive technical, soft skills training and English course for personal development.\n", "elem_id": "job_81480", "salary": "You'll love it", "title": "Full-stack .NET Developer - Up to $1500", "url": "/it-jobs/full-stack-net-developer-up-to-1500-enlab-software-3403/content"},
{"address": ["DITP Tower, Nam O 1, Lien Chieu, Da Nang, Lien Chieu, Da Nang"], "benefits": "Competitive salary & bonus, Attractive allowances, Flexible working time", "company": "LG Vehicle Component Solutions Development Center Vietnam (LG VS DCV)", "description": "Competitive salary & bonus\nAttractive allowances\nFlexible working time\nDetect vulnerabilities in the software to prevent the embedded systems against penetration by hackers regarding the in-vehicle network based on the understanding of SW features encompassing/through network;\nOpen Source Software Vulnerability Scanning (OSSVS): Performs patching of known vulnerabilities for open sources in the product;\nSecurity Feature Testing: investigate security features from the requirements to design and perform the security test cases.\nResponsible for cyber security test case validation and issue tracking & follow-up;\nComply with LGE engineering processes and methodologies.\nBachelor's degree in Computer Science, a related technical field or equivalent practical experience;\nAt least one year experience in any general coding language (C/C++, Java, Python, scripting language, etc.), know how to debug/trace log effectively;\nKnowledge of software testing technique (black box, grey box and white box testing), experience on doing unit test;\nKnowledge and a strong mindset of/interest in information security principles and practices (network security, cryptography, etc.) and apply those for the purpose of data protection;\nExperience of developing automated scripts diagnosing issues or solving problems;\nExperience in test analysis, test planning and execution.\nKnowledge in development tools (Git/SVN, Jenkins/Yocto…), platforms (Linux, Android …), as well as change management tools (JIRA);\nUnderstanding and experience of protocols dedicated to the car environment (DoIP, SOME/IP, Car Play, Android Auto);\nUnderstanding and experience of ECUs communicating with not only in-vehicle network but also external network (physical and logical connections);\nFluent English reading and writing to involve in security technical discussion with development team, HQ, Automotive OEMs,...;\nKnowledge in software development methodology (V-Model, Waterfall, Agile/Scrum).\nAttractive and competitive salary package (negotiable upon the interview);\n13th month salary + incentive bonus ( total remuneration package: UP TO 16-MONTH SALARY);\nRELOCATION PACKAGE UP-TO 20,000,000 VND for candidates from HN, HCMC with above 1-year working experience who willing to relocate to DN;\nLunch allowance & Transportation support;\n5 working days/ week: Mon – Fri with flexible working time;\nAnnual salary review;\n12 days of annual leave & 7 additional days of company holidays;\nPVI health & accident insurance;\nSupport fee to get TOEIC & Technical certifications;\nOn-site & training opportunities in Korea, US, UK, France, etc.;\nStaff trip, sporty clubs;\nMonthly budget for team building activities, etc.\n", "elem_id": "job_82140", "salary": "You'll love it", "title": "Security Test Engineer - Upto $2000 - DN", "url": "/it-jobs/security-test-engineer-upto-2000-dn-lg-vehicle-component-solutions-development-center-vietnam-lg-vs-dcv-0649/content"},
{"address": ["2 Nguyen The Loc, Ward 12, Tan Binh, Ho Chi Minh", "69 Quang Trung, Hai Chau, Da Nang"], "company": "Saigon Technology Solutions", "description": "Technical training sessions (internal – external)\nAttractive salary and benefits\nHealthcare insurance\nWork directly with Europe client to clarify requirements\nDesign application architecture and implement back-end and front-end tasks using Java.\nSupport to testing, deployment\nSolve difficult technical problems\nHave at least 5 years of experience in J2EE projects\nJ2EE 6, EJB, Java 7, 8\nFamiliar with Design patterns\nMaven\nSpring, Hibernate\nDatabase experience with at least one of the following: postgress, mongo, oracle, mysql\nFluent English communication\nWicket for the UI\nArchitecture, algorithm knowledge\nGood at analyzing & problem solving skill\nLeadership skill is a plus\nGood teamwork, generates enthusiasm among team members\nAttractive salary and benefits (13th, Salary review – twice/year)\nProject bonus\nFree English course\nPVI health care program\nCompany trip every year\nWeekly happy hour\nThe staff of the month/year reward\nParty celebration(Christmas, Birthday,...)\nTeam-building activities\nTechnical training sessions (internal-external)\nWeekly Knowledge Exchange\nA professional working environment with Agile – Scrum\nSports clubs (football, badminton…)\nEnjoy Relax and beautiful Pantry in the company\nPeriodic health examination\n", "elem_id": "job_82018", "salary": "Upto $2000 net", "title": "Mid/Sr Java Engineer (J2EE) ~ $2000 NET", "url": "/it-jobs/mid-sr-java-engineer-j2ee-1800-net-saigon-technology-solutions-1806/content"},
{"address": ["Tầng 3, Tầng 4, Tòa nhà VVA, Số 277 - 279 Lý Tự Trọng, District 1, Ho Chi Minh", "Tầng 1,2,3 tòa nhà VNPT, 344 đường 2-9, Hai Chau, Da Nang"], "benefits": "Join many new technologies, Hight benefits, The nice office,free style", "company": "Neolab HCM", "description": "Join many new technologies\nHight benefits\nThe nice office,free style\nJoin and Develop projects.\nTeam work under the assignment of project manager\nCreatively, suggest ideas for product development of companies.\nAt least 2 years experience\n​Can practice of Kotlin programming\n​Understanding of OOP, design pattern and the client-server model\nKnow how to use database such as MySQL, SQLite\n​Good practice of Java programming\n​Have knowledge in architecture design such as MVC, MVP\nWorking with Agile methodologies including Scrum and KanBan\nExperience in Android UI/UX, using 3rd library, customizing vie\nCan practice React-Native\nHave knowledge Architecture design MVVM\nExperience in Payment methods: PayPal, Stripe is a plus\nEnglish skills\n​ In Neolab Viet Nam, you can join many exciting projects and new technologies (AI, Drone, Fintech, HRTech, Medicine, Calling, ...)\nIn our company, focusing on the human factor, always creates conditions for each individual to develop and achieve success.\nYou will work with the high skill members, experts from Japan and You are participate in new technology courses.\nWorking with Agile Scrum model.\nYour health will be protected by Top of insurance company in Vietnam\nRefund remain Annual leave (once a year)\n12 days of holiday allowance per year\nFree annual medical examination (once a year)\nAnnual company trips (once a year)\nMonthly team building\n13th month salary. Review salary every year\nFull salary insurance.\n", "elem_id": "job_82097", "salary": "You'll love it", "title": "Android Developer(java,kotlin)", "url": "/it-jobs/android-developer-java-kotlin-neolab-hcm-2448/content"},
{"address": ["Tầng 3, Tầng 4, Tòa nhà VVA, Số 277 - 279 Lý Tự Trọng, District 1, Ho Chi Minh", "Tầng 1,2,3 tòa nhà VNPT, 344 đường 2-9, Hai Chau, Da Nang"], "company": "Neolab HCM", "description": "Join many projects and many new technology\nFocusing on the human element and salary high\nTeam building, Bonus, Travel, Onsite Japan\nNeolabVietnam is a member of NeoCareer Group – Leading Technology and Human Resources Corporation in Japan. The Group has nearly 2000 employees working in more than 50 offices in Japan and branches in Asian countries.\nNeolab Vietnam specializes in providing IT products and solutions, including developing mobile applications, websites, and researching new technologies.\nAt least 2 years experience in software testing;\nExpert in developing test plans, test procedures, test reports;\nPassion for quality excellence and security;\nKnowledge about Codeceptjs;\nStrong analytical, testing and debugging skills;\nHave experience about API, SQL – Database testing.\nKnowledge about agile / scrum develoment;\nTask management / Task estimation;\nExperience in using an Automation testing tools (Selenium);\nGood at communication;\nCan support lower skill members.\nCan hold training for QC about QC technicals or soft skill is a plus;\nCan work with requirement definition and functional design are plus;\nHas QC leader experience is also plus;\nChallenge in learing new knowledge of quality control.\nHard working, responsible, strong interpersonal and communication skills;\nAbility of working independent and teamwork, can work under high pressure;\nIn Neolab Viet Nam, you can join many exciting projects and new technologies (AI, Drone, Fintech, HRTech, Medicine, Calling, ...)\nIn our company, focusing on the human factor, always creates conditions for each individual to develop and achieve success.\nYou will work with the high skill members, experts from Japan and You are participate in new technology courses.\nWorking with Agile Scrum model.\nYour health will be protected by Top of insurance company in Vietnam\nRefund remain Annual leave (once a year)\n12 days of holiday allowance per year\nFree annual medical examination (once a year)\nAnnual company trips (once a year)\nMonthly team building\n13th month salary. Review salary every year\nFull salary insurance.\nAllowances: Japanese, lunch, travel, birthday, wedding, funeral, sickness\n", "elem_id": "job_82096", "salary": "You'll love it", "title": "MANUAL QC( qc,qa,tester)", "url": "/it-jobs/manual-qc-qc-qa-tester-neolab-hcm-2353/content"},
{"address": ["02 Quang Trung, Hai Chau, Da Nang", "Tầng 5 Tòa Nhà HCC số 28 Lý Thường Kiệt, Phường Vĩnh Ninh,TP Huế"], "company": "IF Vietnam", "description": "Code từ design PSD/AI sang html/css/js (yêu cầu perfect pixel).\nThực hiện các công việc liên quan đến UI của giao diện website.\nThực hiện các công việc update nội dung website.\nThực hiện các công việc khác theo yêu cầu.\nCó từ 1-3 năm kinh nghiệm ở vị trí Frontend developer.\nCó kỹ năng tốt về HTML5, JavaScript, CSS responsive layout (hand coding dùng css/html).\nCó kinh nghiệm sử dụng: Scss, Gulp, Webpack, GIT.\nƯu tiên các ứng viên có kinh nghiệm với Wordpress.\nCó kinh nghiệm với JS Framework (ReactJS, VueJS,…) là một lợi thế\nKiến thức tốt về cấu trúc dữ liệu và thuật toán.\nCó khả năng làm việc độc lập và giải quyết vấn đề tốt.\nCó khả năng tự học tập nghiên cứu các kỹ thuật mới.\nCó kỹ năng làm việc nhóm, chịu được áp lực và có trách nhiệm với công việc được giao..\nCẩn thận tỉ mỉ trong công việc.\nLương thưởng theo năng lực.Được hưởng bảo hiểm xã hội, bảo hiểm y tế, bảo hiểm thất nghiệp theo chế độ nhà nước ban hành.Đánh giá và xét tăng lương hàng năm.Nghỉ phép 12 ngày/năm và nghỉ lễ theo quy định nhà nước.Company trip hàng năm.Khám sức khỏe 1 năm/1 lần.\n", "elem_id": "job_82071", "salary": "You'll love it", "title": "Frontend Dev (JavaScript, CSS, HTML5)", "url": "/it-jobs/frontend-dev-javascript-css-html5-if-vietnam-0432/content"},
{"address": ["WeWork, Lim Tower 3, 03-101, 29A Nguyễn Đình Chiểu, Đa Kao Ward, District 1, Ho Chi Minh", "Seahorse Office, 4.B3, 29 Yên Bái, Hai Chau, Da Nang"], "benefits": "Engineering-focused company, Fast-moving, agile environment, High-growth career path", "company": "Nimble", "description": "Engineering-focused company\nFast-moving, agile environment\nHigh-growth career path\nLead a team of developers in a project squad. We have a wide range of project sizes.\nDecide which technologies are going to be used for front-end, back-end and define the overall architecture.\nWork closely with the Product Owner to make sure the backlog is efficiently planned and occasionally assist in technical discussions with clients. Most of the client interfacing is done by the Product Owner.\nWrite clean, composable, and maintainable code as you develop world-class products for our clients.\nWrite automated tests to build and maintain the product we build for our clients.\nDo code reviews with your squad members.\nLearn new technologies languages like Ruby, Go, or Elixir, and techniques so that you are able to adapt to the evolving needs of our clients.\nKnowledge sharing through team rituals.\nCollaborate with other team members to define the internal processes and initiatives to help the company accomplish its mission. has been written by the whole team.\n5 years or more of professional web development experience. If you are an expert in either PHP, JavaScript, Ruby, or Python, and are wanting to step up your game by learning another language or two, this is the right place for you.\nProven ability to lead web projects end-to-end from front-end/back-end architecture to implementation and deployment.\nA \"can do attitude\" and ownership mentality.\nAt least basic experience with a modern JavaScript framework like Vue, React JS/Redux, or Angular JS.\nAdvanced experience in writing automated tests for web applications.\nYou believe that building great applications is not only about delivering code that “works”, but involves thinking about reusability, maintainability, security and performance.\nConfidence in communicating in English.\nYou will be proud of any product that has our name on it.\nWe are an engineering-focused company. Both co-founders are software engineers and led the tech teams at the most prominent e-commerce powerhouses in South East Asia.\nWe really pay attention and care about processes, high quality, and aesthetics.\nStrong processes. We not only believe but also really work following agile principles. Developers work on well-sized and well-defined user stories, do estimate using points and work iteratively in short sprints (1-2 weeks).\nRegular one-on-one reviews to constantly improve and grow. We have a clearly defined process for our developers to level up continuously not only their technical skills but also soft skills.\nThe vast amount of learning resources (Pluralsight, Pragpub, Leanpub, (e-)books, etc.) and yearly education allowance to step up your game.\nPrivate health insurance from day one, social welfare coverage, and company care fund when someone in the team is in need.\nGreat equipment consisting of a MacBook Pro, large screens, and any accessory to let you work comfortably. Our equipment is renewed every 3 years. If you already have a great laptop and wish to use instead of the company's one, we will reimburse with a laptop allowance monthly.\nCasual work attire for everyone.\nComfortable and modern office space environment in the heart of HCMC in district 1 and Da Nang.\n25 days of paid leaves/year (10 public holidays + 15 personal days).\nSabbatical month every 3 years.\nCompany outing every year.\nMany more perks!\n", "elem_id": "job_81592", "salary": "2,000 - 4,000 USD", "title": "Mid-Senior Web Developers (PHP/Ruby/JS)", "url": "/it-jobs/mid-senior-web-developers-php-ruby-js-nimble-5911/content"},
{"address": ["2 Nguyen The Loc, Ward 12, Tan Binh, Ho Chi Minh", "69 Quang Trung, Hai Chau, Da Nang"], "company": "Saigon Technology Solutions", "description": "Technical training sessions (internal – external)\nAttractive salary and benefits\nHealthcare insurance\nWork directly with client and development team\nTest strategy composition and tasks estimation;\nDesign and write test cases, regression tests and test scenarios;\nFunctional testing according to test cases;\nFree functional testing, reporting and verification according to defined test strategy;\nOwn work planning and reporting;\nAt least 2 year of experience QC engineer\nExperience in API testing (manual or automation), Database testing (SQL)\nHaving solid knowledge of testing design techniques and testing strategies.\nGood at English communication\nExperience in JMeter\nExperience in Postman\nCrypto trading system real-time transactions ideally in trading experience.\nAttractive salary and benefits( 13th, Salary review – twice/year)\nProject bonus\nFree English course\nPVI health care program\nCompany trip every year\nWeekly happy hour\nThe staff of the month/year reward\nParty celebration(Christmas, Birthday,...)\nTeam-building activities\nTechnical training sessions(internal-external)\nWeekly Knowledge Exchange\nA professional working environment with Agile – Scrum\nSports clubs (football, badminton…)\nEnjoy Relax and beautiful Pantry in the company\nPeriodic health examination\n", "elem_id": "job_82019", "salary": "Up to $1200", "title": "Manual QC (Tester, QA QC)", "url": "/it-jobs/manual-qc-tester-qa-qc-saigon-technology-solutions-2002/content"},
{"address": ["2 Nguyen The Loc, Ward 12, Tan Binh, Ho Chi Minh", "69 Quang Trung, Hai Chau, Da Nang"], "company": "Saigon Technology Solutions", "description": "Technical training sessions (internal – external)\nAttractive salary and benefits\nHealthcare insurance\nWork directly with client and development team\nTest strategy composition and tasks estimation\nDesign and write test cases, regression tests and test scenarios\nFunctional testing according to test cases\nFree functional testing, reporting and verification according to defined test strategy\nOwn work planning and reporting\nAt least 2 year of experience QC engineer\nAt least 1 year of experience in Selenium\nUnderstand about Page Object Model\nGood coding skills at any in .NET/ Java/ Node JS/ Python\nExperience in API testing (manual or automation), Database testing (SQL)\nHaving solid knowledge of testing design techniques and testing strategies.\nGood at English communication\nExperience in JavaScript\nExperience in any TestNG / JUnit / NUnit\nExperience in building framework and/or maintaining large scale automation framework for multi browsers\nExperience in any performance tool: JMeter, LoadRunner\nGood teamwork, generates enthusiasm among team members\nAttractive salary and benefits( 13th, Salary review – twice/year)\nProject bonus\nFree English course\nPVI health care program\nCompany trip every year\nWeekly happy hour\nThe staff of the month/year reward\nParty celebration(Christmas, Birthday,...)\nTeam-building activities\nTechnical training sessions(internal-external)\nWeekly Knowledge Exchange\nA professional working environment with Agile – Scrum\nSports clubs (football, badminton…)\nEnjoy Relax and beautiful Pantry in the company\nPeriodic health examination\n", "elem_id": "job_82001", "salary": "1,000 - 1,800 USD", "title": "Automation QA/QC (Tester)", "url": "/it-jobs/automation-qa-qc-tester-saigon-technology-solutions-5705/content"},
{"address": ["Tầng 9, Tòa Nhà ACB, 218 Bạch Đằng, P. Phước Ninh, Hai Chau, Da Nang"], "company": "NitroTech Asia, Inc", "description": "Lập trình chính trong dự án lớn cho khách hàng Nhật sử dụng PHP.\nTham gia các công đoạn tìm hiểu yêu cầu, phân tích, thiết kế, nghiên cứu công nghệ khi được phân công.\nTham gia quản lý nhóm nếu có khả năng phù hợp.\nCó ít nhất 1 năm kinh nghiệm làm các dự án PHP\nCó kinh nghiệm về JavaScript, Laravel, HTML, CSS, JQuery là 1 lợi thế\nHiểu biết về webservice bằng Apache hoặc Nginx\nCó kinh nghiệm một trong các framework PHP: Symfony Framework, Laravel Framework, CodeIgniter, CakePHP,...là một lợi thế.\nCó kỹ năng phân tích và giải quyết vấn đề. Tinh thần trách nhiệm và tỉ mỉ trong công việc.\nCó kỹ năng giao tiếp và làm việc nhóm.\nMức lương: 500$ ~ 1,200$\nThưởng thâm niên, trợ cấp nuôi con nhỏ, trợ cấp tiếng Nhật, tiếng Anh\nLương tháng 13, thưởng các ngày lễ, tết, sinh nhật, party, du lịch công ty, khám sức khỏe…\nPhép năm, bảo hiểm xã hội theo đúng quy định nhà nước\nMôi trường làm việc trẻ trung, năng động, vui vẻ\nThời gian làm việc: 7h30/ngày, Từ 8:00~17:00 (nghỉ trưa 1 tiếng rưỡi) thứ 2- thứ 6\n", "elem_id": "job_81944", "salary": "500 - 1,200 USD", "title": "PHP Developers (JavaScript, Laravel)", "url": "/it-jobs/php-developers-html5-css-js-laravel-nitrotech-asia-inc-2054/content"},
{"address": ["20 Cong Hoa Garden, Cong Hoa, Tan Binh, Ho Chi Minh", "36 Tran Quoc Toan, Hai Chau 1, Hai Chau, Da Nang"], "benefits": "Remote working 2 days/week, Private Health Insurance, Technical/Lunch Allowance", "company": "MTI TECHNOLOGY", "description": "Remote working 2 days/week\nPrivate Health Insurance\nTechnical/Lunch Allowance\nDeveloping, testing and debugging for ASP.NET/C# Web application/System\nResearching new technology & sharing your knowledge\nPlanning and suggesting new apps and service\nPassion for Web development\nPassion in Programing\nEnthusiasm to deliver fun and useful applications to users\nAt least 3 years experience in development with .NET (ASP/C#) .Net MVC5, Web API, Entity Framework, jQuery\nStrong knowledge about OOP, Dependency Injection, Design Patterns, Programming principles, Unit tests\nExperience on Cloud service - Microsoft Azure\nExperience for html/CSS/JavaScript\nFluent English (at least reading/writing)\nWilling to learn and do application tasks.\nHaving experience in mobile is a plus point\nExperience in AWS, Google Cloud Platform, Microsoft Azure\nFluent Japanese is a plus\nFor Product, we always practice “the best way and culture” to make the best products.\nFor Viet Nam & Staff, we contribute to the development of Viet Nam and make all our employees happy.\nRemote working 2 days/week\n13th-month salary (Paid 2 times in June and December)\nPerformance Bonus\nMonthly Allowances for Lunch, Gasoline, Internal Cafeteria\nSeniority Allowance\nTechnical Allowance\nJapanese Language Allowance\nPrivate Medical Insurance\nEmployee Referral Incentive\nFun Activities: English Class, Sports Clubs, Happy Hours, Team Building\nChance to work in Japan site\nYearly Staff Trip, Company Party\n", "elem_id": "job_81492", "salary": "1,000 - 1,800 USD", "title": "[Mid/Sr] .NET Developer (C#, ASP.NET)", "url": "/it-jobs/mid-senior-net-develop-c-asp-net-mti-technology-5158/content"},
{"address": ["539 Lầu 3,GMG Building,Lý Thường Kiệt, Tan Binh, Ho Chi Minh", "39 Quang Trung, Hai Chau, Da Nang"], "company": "Nexle Corporation", "description": "Attractive salary\nExcellent working environment\nHigh compensation\nReview business requirements working with team members\nPerform a technical analysis of requirements\nProduce a solid, detailed technical design\nWrite clean, modular, robust code to implement the desired requirements with little or no supervision\nWork with the other partners to triage and fix bugs with rapid turnaround\nContribute ideas for making the application better and easier to use\nDevelop and maintain embedded system application using C++, QT\nActive participation in customer/partner design meetings and general engagements\nEnsure on time, on budget, and the quality of the product.\nB.S. in Computer Science, or equivalent\n3+ years experienced developing software application\n1+ years experienced working embeded system using C++/QT\nBe creative and good at user experiences\nA creative mind which can work alongside a very drunk design and creative team\nHighly organised driven individual with skills in an agency environment\nExcellent communication skills\nA commitment to quality and a thorough approach to work\nGood teamwork and reliability\nDrive and enthusiasm with the ability to manage and co-ordinate multiple projects\nChance to work with people across continents U.S, Australia, United Kingdom\nChance to work overseas based on the request from clients\nChance to improve English skill since the main communication is English during working hours.\nChance to improve the technical skill during working with clients on new technology.\nBe encouraged and rewarded with attractive remuneration for initiating the ideas that brings the innovation\nEnglish training in VUS School for team leaders and key staff.\nTechnical and soft skill training.\nSpecial health care insurance:\nPersonal accident: 210,000,000/occurrence and no limited occurrences\nHealth insurance: 63,000,000/disability and no limited disabilities\n13rd month salary as permanent bonus,\nOther bonuses depend on the performance and contributions to the project/company.\nAnnual company trip\nThere are 2 PAs (Performance Appraisal) per year. The percentage of salary adjustment is 10%-24% depending on the individual’s performance within a specific period.\nAdhoc salary review and promotion are performed in the year.\nProvide laptop for working and can take home.\nFor iOS development, the company provides a MAC MINI for normal developers. For the team leader, the company provides a MAC BOOK PRO for working.\nProfessional working space in office building: Coffee is served every day, Microwave oven and refrigerator serving lunch in the office\nHaving monthly happy hour either in the office or outside\nSport clubs: Football, Badminton.\n", "elem_id": "job_81983", "salary": "Upto 1500 based on skills", "title": "Senior Embedded Developer (C++,QT)", "url": "/it-jobs/senior-embedded-developer-c-qt-nexle-corporation-3933/content"},
{"address": ["23F Crystal Tower - 65 Hai Phong street, Hai Chau, Da Nang", "72 Lê Thánh Tôn, District 1, Ho Chi Minh"], "company": "NFQ Asia", "description": "We truly value your thoughts and opinions\nGlobal and professional\nHonest, Transparent, Open-minded, Respect, Empathy\nIt is not just about coding, but also about building the awesome infrastructure for the products.\nYou will be joining an awesome startup team to build cool applications that serve millions of users, from idea to production and develop API/ Integration using PHP/Javascript/Java stack.\nAs our customers are typically ambitious foreign startups, you will have a chance to improve your English, learn about startup culture and product mindset along the way. If you want to make a great impact on the world, this is your chance now.\nManaging full lifecycle customer projects with Agile methods.\nDeveloping strong relationships with customers, acting as the primary point of contact as well as managing stakeholder expectations and always seek for solution improvement.\nStrong understanding of all Amazon AWS, GCP, Azure Cloud Services.\nExperience and understand the concept of web application and it’s related technologies (RESTful API/SOAP, CDN, etc.)\nPractical experienced with multiple Infrastructure as Code like CloudFormation/Terraform for infrastructure provisioning in cloud environments (an ability to write and run modules, documents)\nContainerize Orchestration – Experience in container technology and its concepts such as Docker, Kubernetes.\nConfiguration Management – at least 1-year experience in using configuration management tools (Ansible, Puppet).\nFamiliarity with at least one programming language (PHP, Ruby, Python, Bash, etc.)\nUnderstands and can explain TDD.\nConfident with troubleshooting large scale cloud orchestration issues as well as low-level Linux issues.\nWorking knowledge of network protocols and standards.\nHands-on experience in operating and maintaining high intensive RDBMS/NoSQL databases and search engines (e.g MySQL, MongoDB, Elasticsearch, etc.).\nWell working experience with the source control and its related concepts (Git, Gitflow, branches, tags, etc.)\nMonitor systems such as Telegraf, InfluxDB, Grafana, AWS Cloudwatch, Prometheus, GCP Stackdriver, Datadog.\nLogging system such as Elastic Stack (ELK/EFK), Graylog, Logentries.\nError exception tracking & APM tracing such as Sentry, NewRelic APM, Datadog APM, Elasticsearch APM.\nExtensive experience in setting up and maintaining CI/CD processes using self-managed tools or relevant cloud technologies (e.g TeamCity, CircleCI, etc.)\nStrong DevOps mindset and excellent team player (Calm, Cooperative, Problem-solving focus, no Ego, Trust, and Respect)\nStrong sense of ownership, critical thinking, and ability to drive DevOps mindset initiatives across teams for agile release train. Analytical thinking, excellent communication skills and being accountable for the results of your decisions. (Positive, Cooperative, Problem-solving focus, Humble, Trust, and Respect)\nGood negotiation, communication skills including well-organized personality with analytical and conceptual abilities.\nKnowledge of algorithms, data structures, complexity analysis, and software design.\nKnowledge about Computer Security, Application Security, and Security Standards & Best Practices (e.g OWASP, ISO 27000, etc.)\nAdvanced Database tuning and debugging skills (slow queries identification, performance tuning, security hardening, high-availability setup)\nAWS/GCP/Azure Certificates (Solutions Architect, DevOps Engineer, Security Specialty)\nHonest we only tell the truth\nTransparent we share information adequately, and openly\nOpen-minded we approach things with candid attitude\nRespect we treat everyone with the same kindness\nEmpathy sharing feelings matters\nLaptop is provided.\nA fun & dynamic environment and freedom to be creative.\nRock in open-mind, kind & humble band.\nModern office with the flexible relaxing zone.\nCompany trip, team building & other community Tech activities.\nYear-end bonus.\nPerformance review  2 times/ year.\nExtra Medical Insurance.\n15 days annual leaves, working Monday – Friday.\n", "elem_id": "job_81720", "salary": "You'll love it", "title": "Sr to Lead DevOps Engineer (AWS, Cloud)", "url": "/it-jobs/sr-to-lead-devops-engineer-aws-cloud-nfq-asia-5720/content"},
{"address": ["2 Nguyen The Loc, Ward 12, Tan Binh, Ho Chi Minh", "69 Quang Trung, Hai Chau, Da Nang"], "company": "Saigon Technology Solutions", "description": "Technical training sessions (internal – external)\nAttractive salary and benefits\nHealthcare insurance\nWork directly with Australian, EU client to clarify requirements\nDevelop UI Elements to integrate with server-side logic\nSolve technical problems\nSupport teammates to solve problems\nAt least 1 years of experience in ReactJS, Redux\nHave good knowledge or experience in front-end technologies, such as HTML5, and CSS3\nExperience with GIT source control, Agile process\nArchitecture, algorithm knowledge\nVery good at verbal/non verbal English, able to work in an international environment\nGood at analyzing & problem solving skill\nWeb development with NodeJS\nDocker\nGraphQL\nAWS, Serverless\nAttractive salary and benefits( 13th, Salary review – twice/year)\nProject bonus\nFree English course\nPVI health care program\nCompany trip every year\nWeekly happy hour\nThe staff of the month/year reward\nParty celebration(Christmas, Birthday,...)\nTeam-building activities\nTechnical training sessions(internal-external)\nWeekly Knowledge Exchange\nA professional working environment with Agile – Scrum\nSports clubs (football, badminton…)\nEnjoy Relax and beautiful Pantry in the company\n", "elem_id": "job_81831", "salary": "Up to $1800 net", "title": "Mid/Sr ReactJS Developer", "url": "/it-jobs/mid-sr-reactjs-developer-saigon-technology-solutions-1050/content"},
{"address": ["539 Lầu 3,GMG Building,Lý Thường Kiệt, Tan Binh, Ho Chi Minh", "39 Quang Trung, Hai Chau, Da Nang"], "company": "Nexle Corporation", "description": "Attractive salary\nExcellent working environment\nHigh compensation\nReview business requirements working with team members\nMeeting with client to clarify requirements\nManage team members to do project\nPerform a technical analysis of requirements\nProduce a solid, detailed technical design\nWrite clean, modular, robust code to implement the desired requirements with little or no supervision\nWork with the other partners to triage and fix bugs with rapid turnaround\nContribute ideas for making the application better and easier to use\nActive participation in customer/partner design meetings and general engagements\nEnsure on time, on budget, and the quality of the product.\nB.S. in Computer Science, or equivalent\n2+ years experience working with Manager Role\nStrong knowledge of software development\nExperienced in developer role is a plus\nBe creative and good at user experiences\nA creative mind which can work alongside a very drunk design and creative team\nHighly organised driven individual with skills in an agency environment\nExcellent communication skills\nA commitment to quality and a thorough approach to work\nGood teamwork and reliability\nDrive and enthusiasm with the ability to manage and co-ordinate multiple projects\nChance to work with people across continents U.S, Australia, United Kingdom\nChance to work overseas based on the request from clients\nChance to improve English skill since the main communication is English during working hours.\nChance to improve the technical skill during working with clients on new technology.\nBe encouraged and rewarded with attractive remuneration for initiating the ideas that brings the innovation\nEnglish training in VUS School for team leaders and key staff.\nTechnical and soft skill training.\nSpecial health care insurance:\nPersonal accident: 210,000,000/occurrence and no limited occurrences\nHealth insurance: 63,000,000/disability and no limited disabilities\n13rd month salary as permanent bonus,\nOther bonuses depend on the performance and contributions to the project/company.\nAnnual company trip\nThere are 1-2 PAs (Performance Appraisal) per year. The percentage of salary adjustment is 10%-24% depending on the individual’s performance within a specific period.\nAdhoc salary review and promotion are performed in the year.\nProvide laptop for working and can take home.\nFor iOS development, the company provides a MAC MINI for normal developers. For the team leader, the company provides a MAC BOOK PRO for working.\nProfessional working space in office building: Coffee is served every day, Microwave oven and refrigerator serving lunch in the office\nHaving monthly happy hour either in the office or outside\nSport clubs: Football, Badminton.\n", "elem_id": "job_81501", "salary": "Upto 2000 based on skills", "title": "Project Manager (Mobile and Web app)", "url": "/it-jobs/project-manager-mobile-and-web-app-nexle-corporation-1553/content"},
{"address": ["72 Lê Thánh Tôn, District 1, Ho Chi Minh", "23F Crystal Tower - 65 Hai Phong street, Hai Chau, Da Nang"], "company": "NFQ Asia", "description": "We truly value your thoughts and opinions\nGlobal and professional\nHonest, Transparent, Open-minded, Respect, Empathy\nWork with super nice clients, make sure that we understand their needs, and deliver their dreams.\nWorking with cutting edge technology companies, where you can contribute to making dreams into products together with an awesome engineering team.\nAs a central point of contact with our foreign clients, you will have a significant influence on our company’s success by using your super good English communication skills or even better your German skills and your head and common sense.\nIf you know what Agile means it’s a plus. If you know the ins and outs of eCommerce - even better. If not, then we will teach you. It’s no rocket science - as long as you are smart and willed to learn.\nChance to travel and visit the customers on-site. Well not now - we all want to travel! And we hate COVID19...\nAt least 3 years of Project Management in the Software Development industry or alternative. You know your stuff and know how to deal with demanding clients, not having worked as a waiter, but experience in consulting or similar definitely.\nPerfect English communication skills and German is a plus.\nCross-cultural communication with English/German-speaking. And not to forget your Vietnamese team. Speaking Vietnamese is a huge plus. Understanding the mentality here is a must as well as being capable of singing karaoke. Okay just kidding. Not.\nA degree would be nice, however passion, attitude, and experience matter more.\nAn entrepreneurial mindset and the ability to develop a vision for the direction of the product.\nDemonstrate the ability and willingness to continuously acquire new competencies and accept new challenges as well as Agility and flexibility in response to changing priorities and needs.\nCritical thinker with innovative problem-solving skills.\nFantastic organizational, time management & customer relations development, and strong knowledge of project management such as planning, monitoring, and controlling skills.\nTechnical background or experiences in hands-on coding tasks is a plus\nHonest - we only tell the truth (upfront). Unless it’s the boss then we just say ‘Yes, Yes Boss’. jk.\nTransparent - we share information adequately, and openly\nOpen-minded - we approach things with a candid attitude\nRespect - we treat everyone with the same kindness. Yes, the tea lady counts.\nEmpathy - sharing feelings matters\nYou will be working on a daily basis with a team of passionate entrepreneurs who believes in the value of Trust, Transparency, Open-mindedness, Honesty, and Respect\nA fun & dynamic environment and we want you if you love to help us create and shape the best place to work in IT in Vietnam. Yes, that’s us. And we want that it gets even better so we need your ideas and contribution.\nLaptop is provided. Yes, for real. A Laptop! Woohoooo! Okay it’s a nice laptop.\nLovely benefits package, including competitive salary, Year-end bonus, Medical Insurance, and 15 days annual leave.\nMeaningful Company activities and Management Retreats. Did you note the “meaningful”? Not only drinking… But no worries, there is also enough drinking and partying\n", "elem_id": "job_81331", "salary": "You'll love it", "title": "Senior Project Manager (English)", "url": "/it-jobs/senior-project-manager-english-nfq-asia-2526/content"},
{"address": ["AAC Building, 7th floor, Lot.78-80, 30/4 Street, Hai Chau, Da Nang"], "company": "DataHouse Asia", "description": "Collaborating with our sales team to create and negotiate sales proposals with our client.\nAnalyzing financial data, including project budgets, risks, and resource allocation.\nCollaborating with other managers to define, prioritize, and develop projects.\nProviding financial reports and budget outlines to higher managers.\nPlanning project management, including setting deadlines, prioritizing deliveries, and assigning team members to various deliverables.\nOverseeing the development of the project and ensuring that team members are carrying out their tasks efficiently while upholding the company’s standards.\nContinuously evaluating projects to ensure they are meeting company standards, adhering to budgets, and meeting deadlines.\nAccurately documenting the project’s creation, development, and execution as well as documenting the project’s scope, budget, and justification.\nDrafting new and improving existing project management processes.\nA minimum of five years’ experience managing software development projects.\nStrong leadership and strategic management skills.\nGood written and verbal English communication skills.\nStrong attention to details.\nExcellent organizational skills.\nGood interpersonal and multi-tasking skills.\nSelf-motivated and high result-oriented working style; professionalism and high senses of responsibility.\nInformation Technology or Computer Science degree or a related field.\nA Project Management Professional (PMP) Certification may be advantageous.\nA minimum of three years working as a technical engineer may be advantageous.\nA minimum of one year’s experience in a supervisory position may be advantageous.\nUnlimited learning budget with no commitment.\nDynamic assignments based on mutual agreement.\nBook library.\nUdemy courses.\n1-1 English lessons.\nOnsite opportunities and working in the US.\nCaring Managers for your career development and happiness at work.\nHealthcare program.\n12 annual days off and 1 family day off quarterly.\nWellness workshops every 2 weeks is a where we gather to learn and discuss fascinating topics related to work, culture, interpersonal skills and etc.\nWellness talks if you are looking for a good listener whom you can confide in. Yes, we have a Wellness Coach here.\nMonthly sporty activities for men and ladies. We love football and outdoors team bonding, how about you?\nAppraisal meetings are conducted 2 times per year to provide constructive feedback and follow up with your career goals. This is also a time to align salary with those who earn a raise for good performance at work.\nOutstanding performance bonus for great ownership behaviors.\nMonthly lunch and gasoline allowances.\n13th salary.\nProfit-sharing.\nProject celebration, toasting small wins and our team effort.\nOuting trips 2 times/year for outdoor and nature lovers.\nAnnual company trip, enhancing team building and engagement among our members.\nYear-end party and Tet gifts.\nWe are not rich, yet our fridge and kitchen shelves are always full of fruits, snacks, coffee and tea, which you feel free to take at anytime.\nTea-break, is our company break where you are not supposed to be working but chilling and recharging your energy instead.\nA gift for your newborn.\nYou know someone who would be a great teammate in our team? Why not invite your friends to work with us? We’d love to appreciate you by either a staycation or tech gifts 😉\n", "elem_id": "job_81294", "salary": "You'll love it", "title": "Service Delivery Manager/Project Manager", "url": "/it-jobs/service-delivery-manager-project-manager-datahouse-asia-0911/content"},
{"address": ["19th Floor – Thanh Loi Building, 01 Le Dinh Ly, Vinh Trung Ward, Thanh Khe, Da Nang", "27 A Hoàng Việt, Tan Binh, Ho Chi Minh"], "company": "Rikai Technology", "description": "Lương hấp dẫn tuỳ vị trí\nLương tháng 13 + thưởng\nCơ hội thăng tiến cao\nPhát triển và hỗ trợ bảo trì product mới cho khách hàng (là 1 startup với 1 production siêu hot về communication and workspace)\nPhát triển UI component, theme cho khách hàng Nhật trên nhiều lĩnh vực. Được làm việc trực tiếp với khách hàng.\nĐọc hiểu requirement, đưa ra các suggestion cho khách hàng\nLocation: Đà Nẵng\nCó 2+ năm kinh nghiệm làm việc với ReactJs, React Hooks (core technology), Redux\nCó kiến thức về HTML/CSS, các framework UI dành cho React (Javascript, TypeScript)\nCó kinh nghiệm sử dụng công cụ quản lý source như GitHub\nƯu tiên hiểu về asynchronous Javascript coding (callbacks, promises, event loop…)\nCó kinh nghiệm làm việc với các dịch vụ của Firebase: Cloud functions, Firestore, Realtime DB, Storage… là 1 lợi thế\nCó khả năng làm việc độc lập, làm việc nhóm & research công nghệ mới nhanh.\nCó tinh thần trách nhiệm với công việc, dự án\nLương: upto 1500$\nMôi trường làm việc chuyên nghiệp, năng động, có cơ hội thăng tiến.\nĐược hưởng các chế độ BHXH, BHYT… và các phúc lợi khác theo quy định của Luật lao động và của Công ty.\nĐào tạo ngoại ngữ (English/Japanese) miễn phí\nĐược xét tăng lương hàng năm.\nLương tháng 13 và thưởng theo năng lực\nĐược đi du lịch và tham gia các hoạt động vui chơi, giải trí khác do công ty tổ chức hàng quý, hàng năm.\nVà rất nhiều quyền lợi hấp dẫn khác…\n", "elem_id": "job_82367", "salary": "Up to $1500", "title": "10 ReactJS (JavaScript, CSS) - All level", "url": "/it-jobs/10-reactjs-javascript-css-all-level-rikai-technology-1943/content"},
{"address": ["270 Tran Hung Dao, An Hai Tay, Son Tra, Da Nang", "E. Town Central, 11 Doan Van Bo, Ward 12, District 4, Ho Chi Minh"], "company": "Xenia Tech", "description": "Completing web development tasks to assigned deadlines.\nCommunicating and updating the Project Manager/ Team leader with progress.\nPerforming towards predetermined KPIs and OKRs.\nHitting deadlines for all projects.\nMinimum 02 years for Intermediate, minimum 04 years for Senior experience in professional web-app development.\nGood working experience in NodeJs, ReactJs, AngularJs, Bootstrap.\nGood working experience in HTML, CSS, jQuery/ Javascript, Typescript.\nGood working experience in Mongodb, MySQL, PostGres.\nGood working experience in back-end, front-end frameworks.\nHave knowledge in RESTful API.\nUse GIT fluently.\nKnowing Python, PHP is a plus.\nMust be professionally minded.\nWritten and verbal communication in English.\nFamiliar with Trello, JIRA, Zeplin and GSuite Apps (Docs, Sheets, Drive, Gmail etc).\nWilling to learn and improve.\nBecome part of a dynamic, hard-working team in a scale-up where you have the possibility to grow with the company\nA work environment built on transparency, seamless processes and a sensible approach combined with mixed cultures and English speaking environment\nTo continuously grow with the company as the business grows\nYearly appraisals\nVaried and challenging work to help you grow your technical skill sets\nEnglish class\nVietnamese Public holidays + UK Public holidays off.\n15 days of annual leave\nCompetitive salary\nBonus: 13th-month Salary\nSocial insurance for employers who pass the probation\nHigh end Health insurance\n6 days of fully  paid sick leave per year\nWorking time: Monday - Friday, 9am - 5pm\nCentrally located office in the heart of Da Nang and Ho Chi Minh City (District 4)\n", "elem_id": "job_82318", "salary": "Up to 50m", "title": "Fullstack (NodeJS/ReactJS) Up to 50M", "url": "/it-jobs/sr-fullstack-nodejs-reactjs-up-to-50m-xenia-tech-5156/content"},
{"address": ["., Ngu Hanh Son, Da Nang"], "company": "Global Hi-Tech", "description": "Cùng tham gia các dự án phát triển web, làm việc tại công ty khách hàng.\nNghe hiểu tư vấn giải pháp tối ưu cho khách hàng.\nQuản lý tiến độ , báo cáo thường xuyên cho khách hàng.\nTiếng Nhật N2 trở lên, giao tiếp trôi chảy do sẽ làm việc trực tiếp với khách hàng.\nCó kinh nghiệm BrSE là một lợi thế.\nCó kinh nghiệm lập trình 1 trong các ngôn ngữ PHP, JAVA, PYTHON từ 2 năm trở lên.\nLàm việc theo giờ hành chính.\nĐược làm việc với đội ngũ lãnh đạo trẻ nhiệt huyết.\nMôi trường làm việc năng động với tiêu chí: Tin tưởng – Đoàn kết – Tôn trọng – Luôn luôn học hỏi và tiến bộ.\nĐược hưởng mọi chế độ phúc lợi: Bảo hiểm xã hội, ngày phép, công tác phí, thưởng thêm trong các dự án xuất sắc, …\n", "elem_id": "job_82104", "salary": "You'll love it", "title": "PHP Developer (Java, Python)", "url": "/it-jobs/php-developer-java-python-global-hi-tech-1442/content"},
{"address": ["23F Crystal Tower - 65 Hai Phong street, Hai Chau, Da Nang", "72 Lê Thánh Tôn, District 1, Ho Chi Minh"], "company": "NFQ Asia", "description": "We truly value your thoughts and opinions\nGlobal and professional\nHonest, Transparent, Open-minded, Respect, Empathy\nYou will be joining an awesome team to build cool applications that serve millions of users, from idea to production.\nAs our customers are typically ambitious foreign startups, you will have a chance to improve your English, learn about startup culture and product mindset along the way. If you want to make a great impact on the world, this is your chance now.\nManaging full lifecycle customer projects with Agile methods.\nDeveloping strong relationships with customers, acting as the primary point of contact as well as managing stakeholder expectations and always seek for solution improvement.\nAt least 3 years in PHP development\nStrong understanding of OOP\nExperience in PHP Framework (Symfony/ Laravel…)\nFamiliar with Webserver (Apache/ Nginx…), database (MySQL/ MongoDB…), RESTful API or SOAP\nExperience in Caching (Redis/ Memcache)\nFamiliar with Git, Composer, CI\nBe able to communicate in English\nHand on experience with Symfony\nFront-End knowledge (VueJS /ReactJS)\nElasticsearch\nDesign Patterns\nTech Rockstar : Apply the latest technology\nExciting Projects : Working with overseas clients and awesome projects.\nGrowing Opportunity : Work with top-notch experts from around the world.\nOur core value:Honest we only tell the truth (upfront)Transparent we share information adequately, and openlyEmpathy sharing feelings mattersOpen-minded we approach things with candid attitudeRespect we treat everyone with the same kindness\nHonest we only tell the truth (upfront)\nTransparent we share information adequately, and openly\nEmpathy sharing feelings matters\nOpen-minded we approach things with candid attitude\nRespect we treat everyone with the same kindness\nHonest we only tell the truth (upfront)\nTransparent we share information adequately, and openly\nEmpathy sharing feelings matters\nOpen-minded we approach things with candid attitude\nRespect we treat everyone with the same kindness\nLaptop is provided.\nA fun & dynamic environment and freedom to be creative.\nRock in open-mind, kind & humble band.\nModern office with a flexible relaxing zone.\nFlexible work arrangement\nCompany trip, team building & other community Tech activities.\nYear-end bonus.\nPerformance review  2 times/ year.\nExtra Medical Insurance.\n15 days annual leaves, working Monday – Friday.\n", "elem_id": "job_80911", "salary": "You'll love it", "title": "Senior PHP Developer (Laravel/Symfony)", "url": "/it-jobs/senior-php-developer-laravel-symfony-nfq-asia-5514/content"},
{"address": ["278-280 đường Xô Viết Nghệ Tĩnh, phường Khuê Trung, Cam Le, Da Nang"], "company": "UOYmedia", "description": "", "elem_id": "job_81721", "salary": "Thương lượng", "title": "Back-end dev (Golang, PostgreSQL, MySQL)", "url": "/it-jobs/back-end-dev-golang-postgresql-mysql-uoymedia-5804/content"},
{"address": ["3F, 94 Ho Nghinh, Son Tra, Da Nang"], "company": "Digital Unicorn", "description": "Positive attitude, hard working\nAbility to self-study, self-teach\nCreativity, thinking outside the box\nAbility to collaborate\nNo hesitation to share and speak up\nAble to work as a team is needed.\nTechnical Lead should be flexible enough and be adaptable to the changing and varied work settings.\nDetermining project requirements and developing work schedules for the team.\nDelegating tasks and achieving daily, weekly, and monthly goals.\nLiaising with team members, management, and clients to ensure projects are completed to standard.\nIdentifying risks and forming contingency plans as soon as possible.\nAnalyzing existing operations and scheduling training sessions and meetings to discuss improvements.\nKeeping up-to-date with industry trends and developments.\nUpdating work schedules and performing troubleshooting as required.\nMotivating the team and creating a space where they can ask questions and voice their concerns.\nBeing transparent with the team about challenges, failures, and successes.\nWriting progress reports and delivering presentations to the relevant stakeholders.\nStrong foundation in software development\nFamiliar with Scrum Agile\nStrong proficiency of data structures and algorithms.\nExperience in a similar role would be advantageous.\nExcellent technical, diagnostic, and troubleshooting skills.\nStrong leadership and organizational abilities.\nWillingness to build professional relationships with staff and clients.\nExcellent communication, motivational, and interpersonal skills.\nBeing able to speak and use English everyday\nA professional environment to practice and express your skills\nCompetitive salary, welfare and insurance policies\n", "elem_id": "job_81941", "salary": "Competitive salary", "title": "Technical Lead (JavaScript/NodeJS/Agile)", "url": "/it-jobs/technical-lead-javascript-nodejs-agile-digital-unicorn-1234/content"},
{"address": ["Tòa nhà Vĩnh Trung Plaza Tầng 10, 255 257 Hùng Vương, Phường Vĩnh Trung, Quận Thanh Khê, Đà Nẵng, Thanh Khe, Da Nang"], "company": "Everfit", "description": "An open workspace that celebrates everyone's ideas\nShared knowledge between Silicon Valley and VN\nFast-paced learning for motivated individuals\nBuild new features and improve current features on our web platform\nFollow the product roadmap and product specs guideline\nOperate effectively on Jira\nOperate effectively on Bitbucket\nCollaborate closely with the Product team and Engineering team Members to ship great products\n2+ years experience with React.js\nMust have strong JavaScript skills\nKnowledge of modern javascript frameworks and build tools\nExperience with REST,  web development, test-driven development, and writing tests with testing frameworks (Jest, chai, mocha, etc.).\nHands-on with Git\nPreferred Skills\nStrong written communication skills in English\nGood verbal communication skills in English\nStrong written communication skills in English\nGood English speaking Skill (You will get better with us)\nVery attractive salary with 13th-month salary\nPerformance bonus based on effort and output (14th-month salary)\nAnnual sponsored retreat trip\nSick leave, maternity leave, vacation days\nHealth insurance\nContinuous growth and development for your career path\nDedication: With devotion to our craft, we put our heart into our work and take responsibility for our contributions. We always make sure this is the best work we present.\nCollaboration: A startup is like a relay, each leg is as important as another. We achieve success together as a team: sharing new ideas, being responsible to others, and helping each other out always.\nWinner Spirit: We have our eyes set on the prize. We are willing to buckle down, stay driven, and put in more effort to outwork the competition. But we don’t just work hard; we also work smart. We find solutions and learn new skills. Because we aim to be the winner, the #1.\nJoy every day: There will be tough days. But we remember to have fun and enjoy our friendship with each other. We bring positivity to the team, remembering to cheer on each other and celebrate our wins - no matter how large or small.\n", "elem_id": "job_81104", "salary": "900 - 1,500 USD", "title": "Frontend Reactjs Engineer (US Startup)", "url": "/it-jobs/frontend-reactjs-engineer-us-startup-everfit-4843/content"},
{"address": ["539 Lầu 3,GMG Building,Lý Thường Kiệt, Tan Binh, Ho Chi Minh", "39 Quang Trung, Hai Chau, Da Nang"], "company": "Nexle Corporation", "description": "Attractive salary\nExcellent working environment\nHigh compensation\nReview business requirements working with team members\nPerform a technical analysis of requirements\nProduce a solid, detailed technical design\nWrite clean, modular, robust code to implement the desired requirements with little or no supervision\nWork with the other partners to triage and fix bugs with rapid turnaround\nContribute ideas for making the application better and easier to use\nDevelop and maintain mobile related application on iOS/Android using React Native\nActive participation in customer/partner design meetings and general engagements\nEnsure on time, on budget, and the quality of the product.\nB.S. in Computer Science, or equivalent\n2+ years experienced in iOS/Android development using React Native\nExperience working on ReactJS/NodeJS is a plus\nBe creative and good at user experiences\nA creative mind which can work alongside a very drunk design and creative team\nHighly organised driven individual with skills in an agency environment\nExcellent communication skills\nA commitment to quality and a thorough approach to work\nGood teamwork and reliability\nDrive and enthusiasm with the ability to manage and co-ordinate multiple projects\nChance to work with people across continents U.S, Australia, United Kingdom\nChance to work overseas based on the request from clients\nChance to improve English skill since the main communication is English during working hours.\nChance to improve the technical skill during working with clients on new technology.\nBe encouraged and rewarded with attractive remuneration for initiating the ideas that brings the innovation\nEnglish training in VUS School for team leaders and key staff.\nTechnical and soft skill training.\nSpecial health care insurance:\nPersonal accident: 210,000,000/occurrence and no limited occurrences\nHealth insurance: 63,000,000/disability and no limited disabilities\n13rd month salary as permanent bonus,\nOther bonuses depend on the performance and contributions to the project/company.\nAnnual company trip\nThere are 1-2 PAs (Performance Appraisal) per year. The percentage of salary adjustment is 10%-24% depending on the individual’s performance within a specific period.\nAdhoc salary review and promotion are performed in the year.\nProvide laptop for working and can take home.\nFor iOS development, the company provides a MAC MINI for normal developers. For the team leader, the company provides a MAC BOOK PRO for working.\nProfessional working space in office building: Coffee is served every day, Microwave oven and refrigerator serving lunch in the office\nHaving monthly happy hour either in the office or outside\nSport clubs: Football, Badminton.\n", "elem_id": "job_81103", "salary": "Upto 1500 based on skills", "title": "Senior Developer (React Native)", "url": "/it-jobs/senior-developer-react-native-nexle-corporation-3234/content"},
{"address": ["3F, 94 Ho Nghinh, Son Tra, Da Nang"], "company": "Digital Unicorn", "description": "Positive attitude, hard working\nAbility to self-study, self-teach\nCreativity, thinking outside the box\nAbility to collaborate\nNo hesitation to share and speak up\nLeading project planning sessions\nCoordinating staff and internal resources\nManaging project progress and adapt work as required\nEnsuring projects meet deadlines\nManaging relationships with clients and stakeholders\nDesigning and signing off on contracts\nOverseeing all incoming and outgoing project documentation\nParticipating in tender process i.e. design, submission and review\nDesigning risk mitigation plan\nConducting project review and creating detailed reports for executive staff\nOptimising and improving processes and the overall approach where necessary\nSecuring growth opportunities and initiating new projects\nManaging large and diverse teams\nStrong foundation in software development\nGood knowledge with Scrum Agile and having Scrum Master certificate is plus\nWritten and verbal communication skills\nCapacity to manage high stress situations\nAbility to multi-task and manage various project elements simultaneously\nLeadership skills\nBig-picture thinking and vision\nAttention to detail\nConflict resolution skills\nBeing able to speak and use English everyday\nA professional environment to practice and express your skills\nCompetitive salary, welfare and insurance policies\n", "elem_id": "job_81088", "salary": "Competitive salary", "title": "Project Manager (Scrum Master, Agile)", "url": "/it-jobs/project-manager-scrum-master-agile-digital-unicorn-5319/content"},
{"address": ["7 Pasteur, Hải Châu 1, Hai Chau, Da Nang", "7 Phan Chau Trinh, Hải Châu 1, Hai Chau, Da Nang"], "company": "mgm technology partners Vietnam", "description": "Professional IT company - Globally connected\nSkilled and passionate developers\nYoung office environment with top-notch equipment\nTake the lead of scrum teams as the Product Owner\nProviding vision and direction to the Agile development team and stakeholders throughout the project and create requirements\nEnsure that the team always has an adequate amount of prior prepared tasks to work on\nPlan and prioritize product feature backlog and development for the product\nDefine product vision, road-map and growth opportunities\nAssess value, develop cases, and prioritize stories, epics and themes to ensure work focuses on those with maximum value that are aligned with product strategy\nProvide backlog management, iteration planning, and elaboration of the user stories\nWork closely with Product Management to create and maintain a product backlog according to business value or ROI\nLead the planning product release plans and set the expectation for delivery of new  functionalities\nProvide an active role in mitigating impediments impacting successful team completion of Release/Sprint Goals\nKeep abreast with Agile/Scrum best practices and new trends\nFrom 4 years of experiences in software development &  2 years of experience in this position, having full application development to deployment experience\nIn-depth knowledge of Agile process and principles\nDegree in engineering or natural sciences (university or technical college)\nStrong communication skills (Vietnamese & English)\nExcellent organizational and time management skills\nSharp analytical and problem-solving skills\nCreative thinker with a vision\nAttention to details\nSelf-motivated and high result-oriented working style; good learning attitude, professionalism and high senses of responsibility\nGood salary and a bonus if things work well\nWorking & growing with an international team\nOnsite opportunities: short-term and long-term assignments in Europe\nRelocate support (for candidates from HN, HCMC want to move to DN): an apartment is provided for the first month in DN.\n16 days off allowance per year (on top of public holidays like Tet)\nPremium insurance for you and your spouse (husband or wife) & yearly check-up\nFlexible working time (40h/week)\nHighly professional equipment (own laptop, 2 screens, adjustable desks)\nIntense English course for the first 3 months by our native English teachers\nOptional English seminars during the work time\nAmazing company trip once a year, month-end with the whole company and team building with the project team every month covered by mgm\nFree in-house entertainment facilities (darts, piano, climbing wall), drinks (coffee, beer, soft drinks,…) and food (cookies, fruit,…) and out-house company-funded sport clubs (football, swimming, badminton).\n", "elem_id": "job_81070", "salary": "You'll love it", "title": "Product Owner", "url": "/it-jobs/product-owner-mgm-technology-partners-vietnam-5203/content"},
{"address": ["Tầng 9, Tòa nhà SEABANK, 373 Nguyễn Văn Linh, Thanh Khe, Da Nang"], "company": "Caters De Vietnam", "description": "Có kinh nghiệm lập trình Python, PHP, Node.js (mạnh về Python là lợi thế lớn)\nCó kinh nghiệm lập trình RESTful API\nCó kinh nghiệm vận hành RDBS (MySQL. PostgreSQL)\nCó thể thao tác cơ bản trên Linux\nCó kinh nghiệm quản lý source với các tool như là Git hoặc Subversion\nCó kinh nghiệm lập trình trên 1 năm là lợi thế lớn.\nNgoài những kỹ năng cần thiết trên, ứng viên có các kỹ năng dưới đây là lợi thế:\nCó kinh nghiệm xây dựng server trên Linux\nCó kinh nghiệm lập trình với WebSocket\nCó kinh nghiệm phát triển hệ thống dựa theo nhiều server trên IaaS\nCó thể sử dụng tiếng Nhật cơ bản\n", "elem_id": "job_80995", "salary": "1,000 - 1,500 USD", "title": "Backend Dev (PHP/Python/NodeJS) Từ 1000$", "url": "/it-jobs/backend-dev-php-python-nodejs-tu-1000-caters-de-vietnam-1703/content"},
{"address": ["Tòa nhà FPT Complex, Đường Nam Kỳ Khởi Nghĩa, Phường Hòa Hải, Ngu Hanh Son, Da Nang"], "company": "FPT Software", "description": "Global Exposure\nFast Track Career\nDiversified Jobs & Technologies\nPhụ trách các công việc liên quan đến setup môi trường phát triển\nHỗ trợ các vấn đề về technical phát sinh trong dự án , phát triển tool trong trường hợp cần thiết\nHỗ trợ , tham gia bidding / prototype đối với các dự án phát triển mới\nCó kinh nghiệm trong phát triển Enterprise Java Web ít nhất 3 năm\nThành thạo ở mức nguyên lý các framework phát triển web cơ bản như Struts , Seasar , Spring , Spring Boot\nCó kiến thức thành thạo về Oracle ( Setup , sử dụng , db administrator , performance tuning )\nNắm và sử dụng được các framework FE thông dụng là một lợi thế\nCó kiến thức về network / Devops , có thể setup được CI/CD là một lợi thế ( Ansible , Jenkin , Sonar … )\nCó kiến thức và sử dụng được các ngôn ngữ khác ngoài Java là một lợi thế\nThu nhập hấp dẫn, Lương tháng thứ 13, Thưởng lương mềm theo dự án.\nSigning bonus 10-20M\nChế độ chuyển vùng 80-100M\nChế độ cầu hiền – suất mua căn hộ FPT Plaza với giá ưu đãi\nXét tăng lương hàng năm.\nĐóng BHXH đầy đủ và tặng thêm gói BHXH sức khỏe FPT care cho nhân viên\nLộ trình thăng tiến rõ ràng, rất nhiều vị trí và cơ hội thăng tiến cho nhân viên.\nLàm việc từ thứ 2 đến thứ 6.\nĐược đào tạo về ngôn ngữ, kỹ năng mềm\nCó cơ hội đi Onsite tại Nhật Bản\nTham gia các hoạt động nghỉ mát, du lịch, Teambuilding do công ty tổ chức hàng năm.\nTham gia các hoạt động event sôi động, câu lạc bộ thể thao, văn nghệ…\n", "elem_id": "job_80939", "salary": "You'll love it", "title": "Technical Leader–Signing bonus up to 20M", "url": "/it-jobs/technical-leadersigning-bonus-up-to-20m-fpt-software-1857/content"},
{"address": ["Tầng 2, Tòa nhà 03-05 Xuân Tâm, Phường Thuận Phước, Hai Chau, Da Nang"], "company": "ASTI R&D Vietnam", "description": "Là thành viên của bộ phận nghiên cứu và phát triển, bạn sẽ đóng vai trò của một kỹ sư lập trình ứng dụng nhúng\nThực hành và phát triển dự án Robot AGV\nTham gia vào nhiều dự án nghiên cứu và phát triển sản phẩm\nCác công việc khác theo yêu cầu của quản lý\nTốt nghiệp Đại học\nCó tư duy lập trình\nCó kinh nghiệm lập trình C/C ++\nĐã từng làm việc với các dòng vdk của Renesas, STM hoặc Arduino ...\nCó kiến thức về điều khiển và lập trình logic\nĐã từng làm những dự án về Robot tự hành hoặc điều khiển lớn, nhỏ\nCó trình độ ngoại ngữ giao tiếp, có thể đọc tốt các tài liệu tiếng Anh\nBiết tiếng Nhật là một lợi thế\nYêu thích công việc và có mong muốn được làm việc gắn bó lâu dài\nLương tháng 13\nHỗ trợ chi phí cho các chứng chỉ ngoại ngữ: Toiec, năng lực tiếng Nhật\n12 ngày nghỉ phép thường niên và các ngày nghỉ lễ theo quy định\nLàm việc từ thứ 2-thứ 7, tuy nhiên được nghỉ 02 ngày nghỉ công ty có hưởng lương/tháng\nĐược tham gia BHXH đầy đủ cùng gói bảo hiểm UIC chăm sóc sức khỏe và tai nạn\nĐược hưởng chế độ làm việc linh hoạt, work from home nếu cần thiết\nCơ hội đào tạo, làm việc tại Nhật Bản\nLàm việc theo nề nếp của người Nhật\n", "elem_id": "job_81683", "salary": "You'll love it", "title": "Software Engineer (C Language/ C++)", "url": "/it-jobs/software-engineer-c-language-c-asti-r-d-vietnam-3441/content"},
{"address": ["E. Town Central, 11 Doan Van Bo, Ward 12, District 4, Ho Chi Minh", "270 Tran Hung Dao, An Hai Tay, Son Tra, Da Nang"], "company": "Xenia Tech", "description": "Completing web development tasks to assigned deadlines.\nCommunicating and updating the Project Manager with progress.\nPerforming towards predetermined KPIs and OKRs.\nHitting deadlines for all projects.\nTraining app development skills to other developers.\nMinimum 1.5+ year experience in developing the Shopify theme.\nGood working experience in Frontend (JavaScript, AJAX, HTML, CSS, Liquid).\nGood experience in UI/UX.\nHaving experience in Shopify app & Wordpress is a big plus.\nUse GIT fluently.\nBe interested in learning more of these languages. Outgoing, energetic and enthusiastic.\nMust be professionally minded.\nGood written and verbal communication in English.\nFamiliar with Trello, JIRA, Figma and GSuite Apps (Docs, Sheets, Drive, Gmail etc).\nWilling to learn and improve.\nBecome part of a dynamic, hard-working team in a scale-up where you have the possibility to grow with the company\nA work environment built on transparency, seamless processes and a sensible approach combined with mixed cultures and English speaking environment\nTo continuously grow with the company as the business grows\nEnglish class\nYearly appraisals\nVaried and challenging work to help you grow your technical skill sets\nVietnamese Public holidays + UK Public holidays off.\n15 days of annual leave\nCompetitive salary\nBonus: 13th-month Salary\nSocial insurance for employers who pass the probation\nHigh end Health insurance after probation time\n6 days of fully  paid sick leave per year\nWorking time: Monday - Friday, 9am - 5pm\nCentrally located office in the heart of Da Nang and Ho Chi Minh City (District 4)\n", "elem_id": "job_80847", "salary": "30 - 50m + bonus 30m", "title": "Shopify Theme Customization/Java Script", "url": "/it-jobs/shopify-theme-customization-java-script-xenia-tech-5145/content"},
{"address": ["HIU Tower, 215 Điện Biên Phủ, Phường 15, Binh Thanh, Ho Chi Minh", "DNC - Danang Coworking Space, Hai Chau, Da Nang"], "company": "TymeGlobal", "description": "Excellent environment and team to help you grow.\nCompetitive salary and learning culture\nFortnightly and Monthly Fun Activities\nExcellent English speaking and written skills. (Mandatory)\nFoster an open, honest and transparent relationship with key stakeholders\nExcellent presentation and facilitation, coaching and mentorship skills\nStrong stakeholder management and communications experience\nStrong ability to influence cross-functional teams and leadership\nDemonstrate assertiveness, being the voice of reason and authority\nMust be enthusiastic and bring high-energy to the delivery team\nResponsible for continuous delivery and management of technical debt\nPrevious experience leading small teams while still being hands-on\nAt least 2+ years recent experience as a Scrum Master.\nAccountable for the quality of agile ceremonies including daily scrums, sprint planning, showcases and retrospectives\nAbility to provide constructive and timely feedback to delivery team members and stakeholders\nConflict resolution within/between delivery team and stakeholders\nAbility to negotiate priorities and timelines with stakeholders\nSetting the pace/cadence for delivery and motivating teams to succeed\nEnsuring the delivery team commits to their definition of done\nVisual representation and management of work in the sprint e.g. card walls and burn-up charts\nManagement of the Master Story List (MSL), ensuring it is adequately maintained, stories are up to date and ready to play into a sprint\nMobile: iOS or Android\nWeb: HTML5, CSS3, Angular JS, Javascript\nMicrosoft .Net (C#, ASP, Framework), SQL Server\nQuality Assurance, Automation Testing\nWeb Security, OWASP\nJava, Oracle\nDevOps, Continuous Delivery\nMeal and parking allowance covered by company.\nFull benefits and salary rank during probation.\nInsurances as Vietnamese labor law and premium health care for you and your family.\nSMART goals and clear career opportunities (technical seminar, conference and career talk) - we focus on your development.\nValues driven, international working environment and agile culture.\nOverseas travel opportunities for training and working related.\nInternal Hackathons and company's events (team building, coffee run, blue card...)\n13th-month salary and performance bonus.\n15-day annual + 3-day sick leave per year from company.\nWork-life balance 40-hr per week from Mon to Fri.\n", "elem_id": "job_80865", "salary": "You'll love it", "title": "Scrum Master", "url": "/it-jobs/scrum-master-tymeglobal-0839/content"},
{"address": ["539 Lầu 3,GMG Building,Lý Thường Kiệt, Tan Binh, Ho Chi Minh", "39 Quang Trung, Hai Chau, Da Nang"], "company": "Nexle Corporation", "description": "Attractive salary\nExcellent working environment\nHigh compensation\nReview business requirements working with team members\nPerform a technical analysis of requirements\nProduce a solid, detailed technical design\nWrite clean, modular, robust code to implement the desired requirements with little or no supervision\nWork with the other partners to triage and fix bugs with rapid turnaround\nContribute ideas for making the application better and easier to use\nDevelop and maintain web application using Python\nActive participation in customer/partner design meetings and general engagements\nEnsure on time, on budget, and the quality of the product.\nBS in Computer Science, or equivalent.\n2+ years working in Software development\n1+ years of hands-on coding experience with Python and Django as the MVC framework\nExperienced with MariaDB, Apache/ Tomcat/ NGinx\nExperienced with pyCharm as an IDE for debugging and revision control.\nCapable of working with HTML5/ CSS/ JQuery\nExperienced with Redis is a plus\nExperienced with NodeJS/ AngularJS/ React.js is a plus\nExcellent communication skills\nGood teamwork and reliability\nChange to work onsite in Germany\nChance to work with people across continents U.S, Australia, United Kingdom\nChance to work overseas based on the request from clients\nChance to improve English skill since the main communication is English during working hours.\nChance to improve the technical skill during working with clients on new technology.\nBe encouraged and rewarded with attractive remuneration for initiating the ideas that brings the innovation\nEnglish training in VUS School for team leaders and key staff.\nTechnical and soft skill training.\nSpecial health care insurance:\nPersonal accident: 210,000,000 VND/ occurrence and no limited occurrences\nHealth insurance: 63,000,000 VND/ disability and no limited disabilities\n13rd month salary as permanent bonus,\nOther bonuses depend on the performance and contributions to the project/company.\nAnnual company trip\nThere are 2 PAs (Performance Appraisal) per year. The percentage of salary adjustment is 10%-24% depending on the individual’s performance within a specific period.\nAdhoc salary review and promotion are performed in the year.\nProvide laptop for working and can take home.\nFor iOS development, the company provides a MAC MINI for normal developers. For the team leader, the company provides a MAC BOOK PRO for working.\nProfessional working space in office building: Coffee is served every day, Microwave oven and refrigerator serving lunch in the office\nHaving monthly happy hour either in the office or outside\nSport clubs: Football, Badminton.\n", "elem_id": "job_80758", "salary": "Above 20m vnd", "title": "Senior Python Developer", "url": "/it-jobs/senior-python-developer-nexle-corporation-3013/content"},
{"address": ["HIU Tower, 215 Điện Biên Phủ, Phường 15, Binh Thanh, Ho Chi Minh", "DNC - Danang Coworking Space, Hai Chau, Da Nang"], "company": "TymeGlobal", "description": "Excellent environment and team to help you grow.\nCompetitive salary and learning culture\nFortnightly and Monthly Fun Activities\nEvolve to build or enhance test automation frameworks, test environments and automated tests.\nBuild up and maintain testing artifacts for our Products team.\nWork closely with everyone on Product team. Be involved in Agile activities such as iteration planning, requirements analysis, deployment process etc.\nGather and understand new testing requirements to build up testing artifacts to support testing demand for products.\nTrain and coach junior Automation QA engineers, support features team to update and maintain automation testing framework.\n4-6 years experience in Automation testing for Web applications and Mobile applications and API testing.\nExperience in Selenium WebDriver, Appium, Rest Assured, PyTest, Cucumber.\nStrong skills with object-oriented and programming languages (Preferably: Java, Python).\nDeep Understanding of software development tools, including REST, Git, SQL, NoSQL….\nExperience to build up test automation framework.\nExperience in working with BDD (Behavior-Driven Development)\nWell communication skills & analytical ability\nUnderstanding of the terms of software testing and software development life cycle\nExperience of working in an Agile environment\nFlexibility and the ability to work effectively with internal and external clients\nStrong motivation, intellect. Resourcefulness, independence and energy\nFamiliar with performance testing with tools: JMeter, …\nExperience working with CI/CD system (Teamcity / Jenkin)\nHave experiences in Domains about Finance / Banking is a plus\nTertiary qualifications in IT or a related field\nSoftware development experiences\nSecurity testing experiences\nMeal and parking allowance covered by company.\nFull benefits and salary rank during probation.\nInsurances as Vietnamese labor law and premium health care for you and your family.\nSMART goals and clear career opportunities (technical seminar, conference and career talk) - we focus on your development.\nValues driven, international working environment and agile culture.\nOverseas travel opportunities for training and working related.\nInternal Hackathons and company's events (team building, coffee run, blue card...)\n13th-month salary and performance bonus.\n15-day annual + 3-day sick leave per year from company.\nWork-life balance 40-hr per week from Mon to Fri.\n", "elem_id": "job_80755", "salary": "You'll love it", "title": "QA/Senior Automation Engineer (Tester)", "url": "/it-jobs/qa-senior-automation-engineer-tester-tymeglobal-2110/content"},
{"address": ["1915 Monarchy B, Son Tra, Da Nang"], "company": "Hodfords", "description": "Cutting-edge technology\nInternational\nLots to learn\n~2 years minimum experience in the industry and related fields\nNode.js​ application design and testing experience (proficiency with modern​ JavaScript)\nExtensive experience with​ Typescript\nExperience in​ Vue.JS,​ HTML (HTML5)​ and​ CSS (SCSS / LESS)\nExperience with high scalability​ SaaS​ systems built with​ Micro​ Services\nExperience with​ Kubernetes​ (or any other Docker orchestration tool)\nGood understanding of implementing​ CI/CD​ processes\nVast experience with databases, preferably SQL with​ PostgreSQL, as well as NoSQL.\nPractical knowledge using version control (git), CI/CD tools, issue trackers, and working with agile methods\nExperience with Unit testing –​ Jest, Mocha, Chai\nExposure to international working environment\nLearning experience for latest technologies and cross-cultural collaborations\n", "elem_id": "job_80638", "salary": "1,000 - 2,000 USD", "title": "NodeJS Developers (VueJS, HTML5)", "url": "/it-jobs/nodejs-developers-vuejs-html5-hodfords-5638/content"},
{"address": ["3F, 94 Ho Nghinh, Son Tra, Da Nang"], "company": "Digital Unicorn", "description": "Positive attitude, hard working\nAbility to self-study, self-teach\nCreativity, thinking outside the box\nAbility to collaborate\nNo hesitation to share and speak up\nIntegration of user-facing elements developed by front-end developers with server side logic\nWriting reusable, testable, and efficient code\nDesigning and implementing  low-latency, high-availability, and performant applications\nImplementation of security and data protection\nIntegration of data storage solutions\nStrong proficiency of JavaScript or Typescript\nKnowledge of NodeJS and frameworks available for it such as Express, StrongLoop, etc depending on your technology stack\nKnowledge of AWS is needed and Stripe is a plus\nUnderstanding the nature of asynchronous programming and its quirks and workarounds\nGood understanding of server-side templating languages such as Jade, EJS, etc\nGood understanding of server-side CSS preprocessors such as Stylus, Less, etc\nBasic understanding of front-end technologies, such as HTML5, and CSS3\nUnderstanding accessibility and security compliance\nUser authentication and authorization between multiple systems, servers, and environments\nIntegration of multiple data sources and databases into one system\nUnderstanding fundamental design principles behind a scalable application\nUnderstanding differences between multiple delivery platforms, such as mobile vs. desktop, and optimizing output to match the specific platform\nCreating database schemas that represent and support business processes\nProficient understanding of code versioning tools, such as Git\nBeing able to speak and use English everyday\nA professional environment to practice and express your skills\nCompetitive salary, welfare and insurance policies\n", "elem_id": "job_81571", "salary": "You'll love it", "title": "NodeJS developer (JavaScript, CSS)", "url": "/it-jobs/nodejs-developer-javascript-css-digital-unicorn-4547/content"},
{"address": ["Tầng 6, toà nhà Bưu Điện - 271 Nguyễn Văn Linh, Vĩnh Trung, Hai Chau, Da Nang"], "company": "Astraler Technology", "description": "Làm việc trực tiếp với Product Owner và các thành viên khác trong team để nắm rõ yêu cầu của sản phẩm.\nPhối hợp với team design trong quá trình thiết kế UX/UI.\nPhối hợp với team backend để đưa ra đặc tả API phù hợp.\nChuyển đổi thiết kế thành giao diện web.\nPhát triển ứng dụng trên nền tảng web.\nĐề xuất và đưa ra feedback trong team để cải thiện hiệu suất và sản phẩm.\nTham gia vào tất cả quá trình phát triển sản phẩm từ phân tích yêu cầu, thiết kế, phát triển, triển khai và bảo trì.\nChia sẻ kiến thức và kinh nghiệm với đồng nghiệp.\nChịu trách nhiệm hỗ trợ, feedback cho thành viên trong team.\nCó kinh nghiệm với Web Front-end (HTML/CSS/JS).\nBiết Reactjs, Redux, Typescript là một lợi thế.\nCó kinh nghiệm về Restful API.\nSẵn sàng học hỏi công nghệ mới nếu dự án cần.\nCó tinh thần trách nhiệm, kỹ năng giao tiếp và làm việc theo team.\nVăn hoá làm việc: đề cao sự nhanh nhẹn, thông minh và hiệu quả trong công việc.\nMôi trường làm việc thân thiện, cởi mở, coi trọng ý kiến của từng cá nhân.\nTự phát triển sản phẩm riêng, khách hàng là hàng triệu người dùng cuối.\nNhân viên có quyền tự đề xuất ý tưởng làm sản phẩm.\nCập nhật những xu hướng công nghệ mới nhất.\nCoi trọng chất lượng cuộc sống ngoài công việc.\nMức lương cạnh tranh, thưởng theo thành tích. Tham gia đầy đủ BHXH và tài trợ thêm bảo hiểm nhân thọ. Đi company trip 4 lần / năm\n", "elem_id": "job_80603", "salary": "You'll love it", "title": "2 Frontend Dev (ReactJS, HTML5, CSS)", "url": "/it-jobs/2-frontend-dev-reactjs-html5-css-astraler-technology-0849/content"},
{"address": ["Tầng 6, toà nhà Bưu Điện - 271 Nguyễn Văn Linh, Vĩnh Trung, Hai Chau, Da Nang"], "company": "Astraler Technology", "description": "Cùng với Product Owner (PO), tham gia vào quá trình phân tích, thiết kế sản phẩm và đánh giá mức độ khả thi của từng ý tưởng trong sản phẩm.\nPhối hợp với team backend, PO để đưa ra đặc tả API phù hợp.\nPhát triển ứng dụng trên nền tảng iOS. Sử dụng Swift hoặc Swift UI.\nQuản lý source code, quản lý version, quản lý chất lượng sản phẩm và trải nghiệm người dùng.\nĐề xuất và đưa ra feedback trong team để cải thiện hiệu suất và sản phẩm.\nTham gia vào tất cả quá trình phát triển sản phẩm từ phân tích yêu cầu, thiết kế, phát triển, triển khai và bảo trì.\nChịu trách nhiệm hỗ trợ, feedback cho thành viên trong team.\nChia sẻ kiến thức và kinh nghiệm với đồng nghiệp.\nCó kinh nghiệm 2 năm lập trình mobile .\nCó kinh nghiệm với cloud message APIs, push notification, iap, app analytics, crashlytics.\nCó kinh nghiệm với MVVM, Clean Architecture.\nCó kinh nghiệm làm việc với offline storage, threading và performance tuning.\nSẵn sàng học hỏi công nghệ mới nếu dự án cần.\nCó tinh thần trách nhiệm, kỹ năng giao tiếp và làm việc theo team.\nVăn hoá làm việc: đề cao sự nhanh nhẹn, thông minh và hiệu quả trong công việc.\nMôi trường làm việc thân thiện, cởi mở, coi trọng ý kiến của từng cá nhân.\nTự phát triển sản phẩm riêng, khách hàng là hàng triệu người dùng cuối.\nNhân viên có quyền tự đề xuất ý tưởng làm sản phẩm.\nCập nhật những xu hướng công nghệ mới nhất.\nCoi trọng chất lượng cuộc sống ngoài công việc.\nMức lương cạnh tranh, thưởng theo thành tích. Tham gia đầy đủ BHXH và tài trợ thêm bảo hiểm nhân thọ. Đi company trip 4 lần / năm\n", "elem_id": "job_80589", "salary": "You'll love it", "title": "3 iOS Developers (Swift/Flutter)", "url": "/it-jobs/3-ios-devs-swift-swift-ui-flutter-astraler-technology-1259/content"},
{"address": ["Tầng 6, toà nhà Bưu Điện - 271 Nguyễn Văn Linh, Vĩnh Trung, Hai Chau, Da Nang"], "company": "Astraler Technology", "description": "Cùng với Product Owner (PO), tham gia vào quá trình phân tích, thiết kế sản phẩm và đánh giá mức độ khả thi của từng ý tưởng trong sản phẩm.\nPhối hợp với Product Owner, mobile team và front-end team để phân tích và đưa ra đặc tả API cho dự án.\nPhát triển ứng dụng trên nền tảng web, xây dựng hệ thống backend, APIs.\nNghiên cứu, tìm giải pháp để xử lý những vấn đề khó.\nĐề xuất đưa ra những công nghệ cần được áp dụng vào dự án để có hiệu suất tốt nhất.\nĐề xuất và đưa ra feedback trong team để cải thiện hiệu suất và sản phẩm.\nTham gia vào tất cả quá trình phát triển sản phẩm từ phân tích yêu cầu, thiết kế, phát triển, triển khai và bảo trì.\nChia sẻ kiến thức và kinh nghiệm với đồng nghiệp.\nChịu trách nhiệm hỗ trợ, feedback cho thành viên trong team.\nVăn hoá làm việc: đề cao sự nhanh nhẹn, thông minh và hiệu quả trong công việc.\nMôi trường làm việc thân thiện, cởi mở, coi trọng ý kiến của từng cá nhân.\nTự phát triển sản phẩm riêng, khách hàng là hàng triệu người dùng cuối.\nNhân viên có quyền tự đề xuất ý tưởng làm sản phẩm.\nCập nhật những xu hướng công nghệ mới nhất.\nCoi trọng chất lượng cuộc sống ngoài công việc.\nMức lương cạnh tranh, thưởng theo thành tích. Tham gia đầy đủ BHXH và tài trợ thêm bảo hiểm nhân thọ. Đi company trip 4 lần / năm\n", "elem_id": "job_80588", "salary": "You'll love it", "title": "2 FullStack Dev (NodeJS, ReactJS, NoSQL)", "url": "/it-jobs/2-fullstack-dev-nodejs-reactjs-nosql-astraler-technology-2005/content"},
{"address": ["Tầng 3, Tầng 4, Tòa nhà VVA, Số 277 - 279 Lý Tự Trọng, District 1, Ho Chi Minh", "Tầng 1,2,3 tòa nhà VNPT, 344 đường 2-9, Hai Chau, Da Nang"], "benefits": "Join many new technologies, High benefits, The nice office, free style", "company": "Neolab HCM", "description": "Join many new technologies\nHigh benefits\nThe nice office, free style\nJoin and develop projects with PHP language.\nTeam work under the assignment of project manager.\nResearch new technologies on the web and server.\nCreatively, suggest ideas for product development of companies.\n1+ year experience working in PHP\nExperience with at least one of the PHP frameworks (Laravel, Codeigniter...)\nExperience with frontend technologies (HTML, CSS, JS)\nHave knowledge about AWS (EC2, S3,...), API.\nStrong knowledge of OOP and Design Patterns.\nKnowledgeable and good use Git, Bitbucket\nExperience with MySQL, database design, query profiling and optimization\nBeing good at self-learning, willing to learn about new technologies\nBeing cooperative and responsible while working in group\nBeing hard-working and able to handle things well under pressure\nIn Neolab Viet Nam, you can join many exciting projects and new technologies (AI, Drone, Fintech, HRTech, Medicine, Calling, ...)\nIn our company, focusing on the human factor, always creates conditions for each individual to develop and achieve success.\nYou will work with the high skill members, experts from Japan and You are participate in new technology courses.\nWorking with Agile Scrum model.\nYour health will be protected by Top of insurance company in Vietnam\nRefund remain Annual leave (once a year)\n12 days of holiday allowance per year\nFree annual medical examination (once a year)\nAnnual company trips (once a year)\nMonthly team building\n13th month salary. Review salary every year\nFull salary insurance.\nAllowances: Japanese, lunch, travel, birthday, wedding, funeral, sickness\n", "elem_id": "job_81039", "salary": "You'll love it", "title": "6 PHP Developers (Laravel, OOP)", "url": "/it-jobs/6-php-developers-laravel-oop-neolab-hcm-2754/content"},
{"address": ["39 Le Thach Street, District 4, Ho Chi Minh", "110/5 Nguyen Huu Tho, Hoa Thuan Nam, Hai Chau, Da Nang"], "company": "Wonderlabs", "description": "Working with leading companies from Singapore\nAttractive salaries\nFun & dynamic working environment\nDevelop features across our complete product range (server-side as well as client- facing) to deliver industry leading solutions\nDevelop software solutions by working with various stakeholders to determine end\nuser needs, study system interactions and data flows, designing and building integration APIs, and investigating problem areas by following an Agile software development lifecycle.\nMaintain a focus on the needs of our customers\nProvide in-depth engineering support (debugging, performance optimizations, etc.) during the rollout phase to customers\nPerform peer code review\nMentor and grow junior developers\nProactive, positive thinking and strong desire to build a better software\n4 or more years of relevant work experience, with at least 2 years of experience in Python web development using Flask/Django\nHas experience working with Docker, Ansible script, Travis/Jenkins\nHaving knowledge in the following is a PLUS: Java, Scala, Kafka, Apache, Nginx, AWS, Alicloud, Microservices, Distributed Computing Concepts\nGood knowledge in HTML5, CSS, Javascript\nHave experience working with SQL and NoSQL databases, such as Postgres, MongoDB, ArangoDB and Neo4J\nAbility to work as part of a team - both in the context of the Development team, as well as with the greater organization as a whole\nExcellent time management and highly motivated\nA team player that’s a strong communicator and biased for action\nComfortable working in a startup environment\nStrong interest in technology (or fintech!)\nProfessional development – Our software engineers are led by industry experts. Even the most experienced engineers will have opportunity to further develop their skill-sets and perceptions.\nGreat environment – Awesome team spirit. Creativity and innovations are our driving force. We are expanding very fast and you will be part of that success.\nApart from attractive salary and benefits, you get to work with fun colleagues that constantly challenge your thinking and ideas.\n", "elem_id": "job_80566", "salary": "1,500 - 2,000 USD", "title": "Senior Python Developer", "url": "/it-jobs/senior-python-developer-wonderlabs-3936/content"},
{"address": ["2F Ricco building, 363 Nguyen Huu Tho, Cam Le, Da Nang"], "company": "SupremeTech", "description": "We appreciate your thoughts and opinions\nStart up to Scale up\nTop notch RnD team lead by Google Developer\nWork closely with Business Analyst and Backend engineers in order to create modern and robust web applications targeting multiple devices.\nCommunicate proactively with Project Manager, Quality Control engineers, and other team members to continuously develop new features and improve project quality.\nDo the code-review process, lead the dev team to achieve success in projects.\nInvolve in training programs as a trainer, mentor to contribute to building up team quality, team size.\nInvolved in the RnD team, leading the team to catch up on new technology.\n+3 years' experience working in Software Development covering Web Development.\nStrong foundation in HTML5/CSS3/JS and preprocessing CSS languages such as SASS/LESS.\nSolid experience with one of the popular JS frameworks/libraries like React/Angular.\nExperience in modern front-end build pipelines and tools (e.g. Webpack, Babel, NPM, Git).\nExperience working in a cross-functional team delivering using Agile methods.\nWell-versed in writing structured, well-documented, maintainable, and clean code.\nGood problem-solving and analytical skills;\nExperience with mentoring and coaching junior developers with best practices in software development.\nPossesses good English for everyday and technical communication.\nSolid experience in designing & developing RESTful APIs (any language, NodeJS is preferred)\nExperience with deployment by using CI/CD and DevOps practices, processes, and tooling.\nHave awareness and experience with popular AWS services such as IAM User/Group/Policy, S3.\nHave awareness and experience with Containers (ECS, Kubernetes, Docker) and FaaS (AWS Lambda) technologies.\n13th month pay (yearly bonus).\nBonus on National Public Days\nAnnual leave: 12 days of Annual leave and 11 days of National public holiday\nPTI Health Insurance\nSalary review: 2 times a year\nPromotion opportunity\nYearly company trip, Year-end party\nMacbook is provided\n", "elem_id": "job_80488", "salary": "700 - 2,000 USD", "title": "Senior Frontend Dev (ReactJS, Angular)", "url": "/it-jobs/frontend-developer-reactjs-angular-supremetech-0448/content"},
{"address": ["2F Ricco building, 363 Nguyen Huu Tho, Cam Le, Da Nang"], "company": "SupremeTech", "description": "We appreciate your thoughts and opinions\nStart up to Scale up\nTop notch RnD team lead by Google Developer\nWork closely with Business Analyst and Front-end/Mobile engineers in order to develop highly responsible and scalable back-end applications\nPrepare API specifications for better communication with other team members.\nEnsure thorough Unit testing is done for all developed codes.\nParticipate in code review and optimisation to maximise system performance.\nAt least 1 year experience developing RESTful API and other back-end applications using 1 of the below programming languages:\nAbility to quickly learn new back-end (scripting) programming languages to adopt the needs of project\nStrong knowledge and experience with SQL Database such as MySQL, PostgreSQL\nExperienced in using Git and Github.\nBasic understanding or experienced with Docker, CI/CD (CircleCI, Github Action, Jenkins)\nAbility to research and understand technical documentation in English\nGood learning attitude, professionalism and high sense of responsibility.\nExperienced or certified in using AWS services or other cloud infrastructure\n13th month pay (yearly bonus).\nBonus on National Public Days\nAnnual leave: 12 days of Annual leave and 11 days of National public holiday\nPTI Health Insurance\nSalary review: 2 times a year\nPromotion opportunity\nYearly company trip, Year-end party\nMacbook is provided\n", "elem_id": "job_80493", "salary": "500 - 1,500 USD", "title": "Backend Dev (NodeJS, Ruby, PHP, Python)", "url": "/it-jobs/backend-dev-nodejs-ruby-php-python-supremetech-2002/content"},
{"address": ["2F Ricco building, 363 Nguyen Huu Tho, Cam Le, Da Nang"], "company": "SupremeTech", "description": "We appreciate your thoughts and opinions\nStart up to Scale up\nTop notch RnD team lead by Google Developer\nCollaborate with a small, autonomous team of developers, designers, and product owners to find end-to-end solutions for important problems.\nImplement these solutions for our Android client, adhering best practices in Android development.\nHelp your team to solve problems appropriately for Android users and our codebase.\nJoin other developers and help to orient Android development at our company.\nContinue to learn, grow, and help us tackle brand new challenges\nKnow how to write readable, maintainable, performant object-oriented Java/Kotlin.\nUnderstanding the latest Android development.\nCapturing knowledge of Android Jetpack Components and solid knowledge of the mobile development life cycle.\nGood knowledge of MVVM architecture for Android, Reactive patterns and DI.\nExperience with RESTful APIs to connect Android applications to back-end services.\nExperience with offline storage, threading, and performance tuning\nExperience with Git source control, Git Flow.\nKnowledge in MediaPlayer, Video Streaming and Voice/Video calling will be an added advantage.\nGood command of English is a must.\n13th month pay (yearly bonus).\nBonus on National Public Days\nAnnual leave: 12 days of Annual leave and 11 days of National public holiday\nPTI Health Insurance\nSalary review: 2 times a year\nPromotion opportunity\nYearly company trip, Year-end party\nMacbook is provided\n", "elem_id": "job_80486", "salary": "500 - 1,500 USD", "title": "Mobile Dev (Android, Java, Kotlin)", "url": "/it-jobs/mobile-dev-android-java-kotlin-supremetech-3712/content"},
{"address": ["20 Cong Hoa Garden, Cong Hoa, Tan Binh, Ho Chi Minh", "36 Tran Quoc Toan, Hai Chau 1, Hai Chau, Da Nang"], "benefits": "Private Health Insurance 24/7, Gasoline/Lunch Support Fee, Remote working 2 days/week", "company": "MTI TECHNOLOGY", "description": "Private Health Insurance 24/7\nGasoline/Lunch Support Fee\nRemote working 2 days/week\nResponsible for promoting and supporting Scrum by helping everyone understand Scrum theory, practices, principles, and values.\nEnsure that the Scrum process works well and properly.\nCoach the team on how to use Scrum practices and values to delight customers.\nWork closely with the developers and Product Owner to ensure an Agile culture is established in your team.\nFacilitate scrum events and other meetings as needed, e.g. product backlog refinement, print planning, daily scrum, sprint review, sprint retrospective.\nFacilitate getting the work done without coercion, assigning, or dictating the work.\nFacilitate discussion, decision making, and conflict resolution.\nRemove impediments or guide the team to remove impediments.\nProvide all support to the team using a servant leadership style whenever possible.\nHelp the scrum team achieve higher levels of scrum maturity.\nBuild a trusting and safe environment where problems can be raised without fear of blame, retribution, or being judged.\nHelp build a productive environment where team members ‘own’ the product and enjoy working on it.\nMotivate/ encourage the scrum team to improve continuously.\nPay attention to the motivation of team members every day and improve their motivation if there are any low-motivated members.\nWork with other Scrum Masters to increase the effectiveness of applying Scrum in the Organization.\n1-4 years of experience in playing the Scrum Master role for a software development team that was diligently applying Scrum principles, practices, and theory.\nExcellent knowledge of Scrum techniques and artifacts\nHighly proficient in spoken and written English skills\nWorking technical knowledge of the software development process – design, development, test, and deployment\nStrong communication, collaboration, leadership, conflict resolution and time management skills\nApplicable knowledge of the technologies used by the team\nAnalytical skills to be able to solve problems and remove impediments\nStrong interpersonal skills including mentoring, coaching, collaborating, and team building\nGood knowledge of Software Testing Technique.\nCertified Scrum Master is a plus\nBe able to communicate in Japanese\nMTI Technology is being a grown-up company, focused on innovative products and new technologies\nRemote working 2 days/Week\nFlat organization structure. We don't have Boss, Your ideas and opinions are as important as everyone else.\nAnnual Wage Supplement of 1 month's salary (Paid 2 times in June and December)\nThe 3F: Fun, Friendly and Flexible. We are colleagues and a small family\nPerformance Bonus Overtime payment\nJapanese Language allowance, Technical allowance (Azure and AWS certifications), Seniority Allowance, Transport allowance Lunch allowance\nPrivate Medical Insurance\nLanguage Class (English Class)\nHaving an opportunity to work in Japan\nFree snack and coffee\nVery competitive salary\nPing-Pong, Badminton, Swimming, and Football ready\n", "elem_id": "job_80722", "salary": "1,200 - 2,100 USD", "title": "[ HCM/DN ] Scrum Master (1,200$ - 2100$)", "url": "/it-jobs/hcm-dn-scrum-master-1-200-2100-mti-technology-2012/content"},
{"address": ["16 Tam Dao, District 10, Ho Chi Minh", "NA, Hai Chau, Da Nang"], "company": "East Agile", "description": "Best agile environment\nTalented developers\nHigh salary with HR review every 6 months\n", "elem_id": "job_80783", "salary": "You'll love it", "title": "Golang Developer", "url": "/it-jobs/golang-developer-east-agile-3910/content"},
{"address": ["Tòa nhà Vĩnh Trung Plaza Tầng 10, 255 257 Hùng Vương, Phường Vĩnh Trung, Quận Thanh Khê, Đà Nẵng, Thanh Khe, Da Nang"], "company": "Everfit", "description": "An open workspace that celebrates everyone's ideas\nShared knowledge between Silicon Valley and VN\nFast-paced learning for motivated individuals\nInvestigate existing software products and data domains.\nCollaborate with Product Owner to help define, manage & review requirements (documents, mockups, designs) to provide timely and impactful feedback\nDevelop a risk-based test plan to determine the highest areas of risk in the product\nChampion the quality process through all stages of the product.\nFocus on scale: Deliver solutions that can be quickly adapted to changing scenarios.\nCreate test strategy composition and task estimation.\nDesign and write test cases and checklists.\nExecute testing according to the checklist.\nOpen issues to a bug tracking system.\nManage sprint releases and milestone releases.\nProduce detailed reports documenting test results and processes to be provided to the engineering team and Tech Lead.\nWork closely with developer teams.\nLead and mentor employees\nManage a team of manual testers engineers to investigate and measure the quality of the Everfit product\nEmpower your team to drive for results independently.\nHave more than 3 years of experience as a QA engineer.\nHave practical knowledge of manual testing techniques for both web and mobile apps, dealing with browsers under Windows OS/ MAC OS family;\nHave the ability to design and write test cases, checklist, and regression tests.\nBe able to plan and estimate your own work with good precision, and track progress and hours spent/left.\nBe able to manage releases.\nGood at English communication.\nIndependent, good at self-management and full of energy at working.\nStrong written communication skills in English\nStrong verbal communication skills in English\nHave experience with Automation Testing\nHave > 1-2 years of experience managing a QA team\nVery attractive salary with 13th-month salary ( even 14th-month salary)\nPerformance bonus based on effort and output\nAnnual sponsored retreat trip\nSick leave, maternity leave, vacation days\nHealth insurance\nContinuous growth and development for your career path\n", "elem_id": "job_80527", "salary": "Super attractive salary", "title": "Sr. QA QC Tester - US Startup", "url": "/it-jobs/sr-qa-qc-tester-english-us-startup-everfit-3605/content"},
{"address": ["Tòa nhà Vĩnh Trung Plaza Tầng 10, 255 257 Hùng Vương, Phường Vĩnh Trung, Quận Thanh Khê, Đà Nẵng, Thanh Khe, Da Nang"], "company": "Everfit", "description": "An open workspace that celebrates everyone's ideas\nShared knowledge between Silicon Valley and VN\nFast-paced learning for motivated individuals\nBuild new features and improve current features on our current iOS platform\nFollow the product roadmap and product specs guideline\nOperate effectively on Jira\nOperate effectively on Bitbucket\nCollaborate closely with Product team and Engineering team Members to ship great products\nEnsure the performance, quality, and responsiveness of applications\nIdentify and correct bottlenecks and fix bugs\nHelp maintain code quality, organization\nAt least 3 years Prior iOS development experience, Proficient with Swift and Cocoa Touch\nExperience with iOS frameworks such as Core Data, Core Animation, etc.\nExperience with offline storage, threading, and performance tuning\nFamiliarity with RESTful APIs to connect iOS applications to back-end services\nUnderstanding of Apple’s design principles and interface guidelines\nUnderstand at least one of these architectures: MVP, MVVM, Clean Architecture\nExperience with and understanding of test driven design and unit testing is a plus\nGood English communication skills, confident to interact with worldwide engineers\nAgile/Scrum experience is a plus\nStrong written communication skills in English\nGood verbal communication skills in English\nVery attractive salary with 13th-month salary (or even 14th)\nPerformance bonus based on effort and output\nAnnual sponsored retreat trip\nSick leave, maternity leave, vacation days\nHealth insurance\nContinuous growth and development for your career path\nDedication: With devotion to our craft, we put our heart into our work and take responsibility for our contributions. We always make sure this is the best work we present.\nCollaboration: A startup is like a relay, each leg is as important as another. We achieve success together as a team: sharing new ideas, being responsible to others, and helping each other out always.\nWinner Spirit: We have our eyes set on the prize. We are willing to buckle down, stay driven, and put in more effort to outwork the competition. But we don’t just work hard; we also work smart. We find solutions and learn new skills. Because we aim to be the winner, the #1.\nJoy every day: There will be tough days. But we remember to have fun and enjoy our friendship with each other. We bring positivity to the team, remembering to cheer on each other and celebrate our wins - no matter how large or small.\n", "elem_id": "job_80526", "salary": "Super attractive salary", "title": "Senior iOS Engineer (US Startup)", "url": "/it-jobs/senior-ios-engineer-us-startup-everfit-3450/content"},
{"address": ["HIU Tower, 215 Điện Biên Phủ, Phường 15, Binh Thanh, Ho Chi Minh", "DNC - Danang Coworking Space, Hai Chau, Da Nang"], "company": "TymeGlobal", "description": "Excellent environment and team to help you grow.\nCompetitive salary and learning culture\nFortnightly and Monthly Fun Activities\nWork closely with team members of the Scrum team to identify testing areas across the deliverable.\nDrive-up Quality of product for the Scrum team and strong knowledge about testing concepts and ensure quality releases to Production.\nCarry out all other testing activities such as functional testing, smoke test, regression testing … and exploratory testing as required by the project.\nFlexibility and the ability to work effectively with internal and external clients.\nCommunicate status, risks, and issues to management and team members to prevent issues, risks, defects.\nHave opportunities to learn and practice Automation Testing, Performance Testing,… (Create, execute, and maintain automated test scripts in the designed framework).\nTrain and coach junior QA engineers and increase testing mindset for Scrum team.\n4-6 years experience in QA / Testing, preferably in Finance / Banking.\nHas strong experience in software testing for Web Application, Mobile Application (iOS and Android).\nStrong skills and experiences for API testing (Restful API, SOAP API, …. with Postman, SOAPUI, ..)\nStrong in Database queries, experience with SQL, NoSQL.\nFamiliar with Tracking Tools / Test management tools: Jira, Confluence, Test Rails, …\nExperience of working in an Agile environment.\nStrong knowledge about testing concepts and Testing Foundation (Functional and Non-functional testing, Adhoc Testing, Exploratory testing, …).\nGood communication and well collaboration with members of Agile team to drive up the Quality of the product.\nCompetence in requirements analysis and testing.\nExperience in technical problem solving; root cause analysis; and data gathering, analysis, and reporting within a system.\nAble to communicate English well (write, read, speak and listen).\nFlexibility and the ability to work effectively with internal and external clients\nStrong motivation, intellect. Resourcefulness, independence, and energy\nExperiences in Selenium WebDriver, Appium or Rest Assured is a plus\nKnowledge/familiarity with object-oriented and programming languages (Java, Python).\nExperiences in Behavior-Driven-Development design.\nPerformance testing experiences (JMeter)\nExperience with Version Control (GIT), CI/CD system (Teamcity / Jenkin)\nFriendly with Linux command\nMeal and parking allowance covered by company.\nFull benefits and salary rank during probation.\nInsurances as Vietnamese labor law and premium health care for you and your family.\nSMART goals and clear career opportunities (technical seminar, conference and career talk) - we focus on your development.\nValues driven, international working environment and agile culture.\nOverseas travel opportunities for training and working related.\nInternal Hackathons and company's events (team building, coffee run, blue card...)\n13th-month salary and performance bonus.\n15-day annual + 3-day sick leave per year from company.\nWork-life balance 40-hr per week from Mon to Fri.\n", "elem_id": "job_80753", "salary": "You'll love it", "title": "QA/Senior Manual Engineer (Tester, Eng.)", "url": "/it-jobs/qa-senior-manual-engineer-tester-eng-tymeglobal-1349/content"},
{"address": ["539 Lầu 3,GMG Building,Lý Thường Kiệt, Tan Binh, Ho Chi Minh", "39 Quang Trung, Hai Chau, Da Nang"], "company": "Nexle Corporation", "description": "Attractive salary\nExcellent working environment\nHigh compensation\nReview business requirements working with team members\nPerform a technical analysis of requirements\nProduce a solid, detailed technical design\nWrite clean, modular, robust code to implement the desired requirements with little or no supervision\nWork with the other partners to triage and fix bugs with rapid turnaround\nContribute ideas for making the application better and easier to use\nDevelop and maintain mobile related application on iOS/Android using native code\nActive participation in customer/partner design meetings and general engagements\nEnsure on time, on budget, and the quality of the product.\nB.S. in Computer Science, or equivalent\n2+ years experienced in iOS or Android development using native code\nExperience working on React Native is a plus\nBe creative and good at user experiences\nA creative mind which can work alongside a very drunk design and creative team\nHighly organised driven individual with skills in an agency environment\nExcellent communication skills\nA commitment to quality and a thorough approach to work\nGood teamwork and reliability\nDrive and enthusiasm with the ability to manage and co-ordinate multiple projects\nChance to work with people across continents U.S, Australia, United Kingdom\nChance to work overseas based on the request from clients\nChance to improve English skill since the main communication is English during working hours.\nChance to improve the technical skill during working with clients on new technology.\nBe encouraged and rewarded with attractive remuneration for initiating the ideas that brings the innovation\nEnglish training in VUS School for team leaders and key staff.\nTechnical and soft skill training.\nSpecial health care insurance:\nPersonal accident: 210,000,000/occurrence and no limited occurrences\nHealth insurance: 63,000,000/disability and no limited disabilities\n13rd month salary as permanent bonus,\nOther bonuses depend on the performance and contributions to the project/company.\nAnnual company trip\nThere are 1-2 PAs (Performance Appraisal) per year. The percentage of salary adjustment is 10%-24% depending on the individual’s performance within a specific period.\nAdhoc salary review and promotion are performed in the year.\nProvide laptop for working and can take home.\nFor iOS development, the company provides a MAC MINI for normal developers. For the team leader, the company provides a MAC BOOK PRO for working.\nProfessional working space in office building: Coffee is served every day, Microwave oven and refrigerator serving lunch in the office\nHaving monthly happy hour either in the office or outside\nSport clubs: Football, Badminton.\n", "elem_id": "job_80720", "salary": "Upto 1500 based on skills", "title": "Sr Mobile Dev (React Native/iOS/Android)", "url": "/it-jobs/senior-mobile-developer-ios-android-nexle-corporation-0224/content"},
{"address": ["19 Lỗ Giáng 18, Hòa Xuân, Cam Le, Da Nang"], "company": "VisualViet", "description": "Viết code thông qua việc áp dụng các phần mềm phát triển\nThiết kế giao diện người dùng bằng cách sử dụng các HTML/CSS cơ bản\nHợp nhất data từ các dịch vụ và dữ liệu\nThu thập và cải thiện các bản mô tả và yêu cầu dựa trên các nhu cầu về kĩ thuật\nTạo ra và duy trì các tài liệu phần mềm\nCó trách nhiệm duy trì, mở rộng website\nCập nhật các xu hướng công nghệ và ứng dụng chúng vào các hoạt động\nLàm việc với web designers để tạo ra sự phối hợp thiết kế đẹp mắt\nSáng tạo, chăm học hỏi và tư duy logic\nCó Laptop riêng\nKinh nghiệm 1 năm\nLương thỏa thuận\nBảo hiểm đầy đủ\nThưởng và nghỉ tết theo luật nhà nước\nThưởng tháng 13\nĐược đưa đi đào tạo nếu có cống hiến và năng lực\nLộ trình thăng tiến rõ ràng\n", "elem_id": "job_81242", "salary": "You'll love it", "title": "Frontend Dev (HTML5, CSS, Javascript)", "url": "/it-jobs/frontend-dev-html5-css-javascript-visualviet-5144/content"},
{"address": ["150-156 Nguyễn Văn Linh, Vĩnh Trung, Thanh Khe, Da Nang"], "company": "Aodigy", "description": "Flexible working hours\nGlobal Experience\nFun Co-Workers\n", "elem_id": "job_80409", "salary": "500 - 700 USD", "title": "Saleforce Developer (Fresher Welcomed)", "url": "/it-jobs/software-developer-nodejs-reactjs-aodigy-5155/content"},
{"address": ["434 Trần Khát Chân, Hai Ba Trung, Ha Noi", "11th Floor, Thanh Loi 2, 03 Le Dinh Ly Street, Vinh Trung, Thanh Khe, Đa Nang, Thanh Khe, Da Nang"], "benefits": "Attractive salary package, Our sole focus is AI-products, People-oriented culture", "company": "FTECH CO., LTD", "description": "Attractive salary package\nOur sole focus is AI-products\nPeople-oriented culture\n", "elem_id": "job_80448", "salary": "1,000 - 3,000 USD", "title": "AI Engineer (Up to 3000$)", "url": "/it-jobs/ai-engineer-up-to-3000-ftech-viet-nam-3332/content"},
{"address": ["DITP Tower, Nam O 1, Lien Chieu, Da Nang, Lien Chieu, Da Nang"], "benefits": "Competitive salary & bonus, Attractive allowances, Flexible working time", "company": "LG Vehicle Component Solutions Development Center Vietnam (LG VS DCV)", "description": "Competitive salary & bonus\nAttractive allowances\nFlexible working time\n", "elem_id": "job_80454", "salary": "You'll love it", "title": "Software Development Project Manager", "url": "/it-jobs/software-development-project-manager-lg-development-center-vietnam-4250/content"},
{"address": ["Helios Bldg + QTSC9, Quang Trung Software City, Tan Chanh Hiep Ward, District 12, Ho Chi Minh City, Vietnam, District 12, Ho Chi Minh", "Floor 6th, Phi Long Bldg, 52 Nguyen Van Linh Street, Nam Duong Ward, Hai Chau District, Danang City, Vietnam, Hai Chau, Da Nang"], "company": "Hitachi Vantara", "description": "International working environment\nCompetitive compensation package and benefits\nInteracting with leading-edge technologies\nLead technical role at division-wide and company-wide\nProactively introduce new service processes, automation tools to improve productivity\nGuide, mentor and develop a team of skilled software engineers\nBuild up technical knowledge base of architectural lessons learnt, patterns, common libraries\nArchitectural solution: Interact and work collaboratively with multiple project teams for application architecture and design\nDevelop technical proposal\nDefine system architecture and core technologies\nDo architectural analysis and proof-of-concept\nDefine system’s scalability and failover strategies\nMake technical decisions that constrain the overall design and implementation for the project\nTrain/explain architectural ideas to team members\nGive advices for system level technical problems\nAny assignments from Line Manager if any.\n8+ years of experience in software development and delivery with 2+ last years worked as Technical/Solution Architect\nExpert in object oriented analysis and design (OOAD) skills, XML, SOA, Messaging (MQ/JMS), design pattern, common framework, UML, microservice\nExtremely strong in general IT knowledge (applications development, testing, deployment, operations, documentation, standards, best practices, security, hardware, networking, OS, DBMS, middleware, etc.)\nPractical experience of design and development for large scale projects with expert-level skills in .NET/JAVA technologies and front-end frameworks\nFamiliar with at least one cloud computing platform (Google Cloud Platform, AWS, Microsoft Azure)\nKnowledge/experience in AI, machine learning is a plus\nStrong analytical problem solving skills; ability to gather and analyze disparate information from multiple sources into meaningful insights and associated action plans\nQuality and on-time oriented mindset\nPassionate in driving new technology solutions\nStrong communication and customer interface skills\nGood at business mindset\nGood at English\nCertified in AWS/Azure/GCP is a plus\nUnique opportunity to work with multinational team of Hitachi in over 130 countries.\nIncomparable chance to participate in full Software Development Life Cycle (SDLCs) and comprehensive soft skills training.\nCompetitive remuneration with attractive allowances & bonuses.\nOpportunities for advanced career development overseas, including the US, Japan...\nCompetitive & attractive compensation and benefits packages:Allowance for academy degrees and language certification, i.e. Master, Ph.D., English, Japanese language certifications.Subsidy for transportation and meals.13th salary.Additional International Insurance Package for employees.Company trip for employees.\nAllowance for academy degrees and language certification, i.e. Master, Ph.D., English, Japanese language certifications.\nSubsidy for transportation and meals.\n13th salary.\nAdditional International Insurance Package for employees.\nCompany trip for employees.\nBeing an integral part of a dynamic and fast growing global enterprise.\nAn open, professional and nourishing environment with out-side of work activities, such as football, tennis, badminton, dancing, music, and charity.\nAllowance for academy degrees and language certification, i.e. Master, Ph.D., English, Japanese language certifications.\nSubsidy for transportation and meals.\n13th salary.\nAdditional International Insurance Package for employees.\nCompany trip for employees.\n", "elem_id": "job_80453", "salary": "You'll love it", "title": "Solution Architect/Tech Lead (Manager)", "url": "/it-jobs/solution-architect-tech-lead-danang-hcm-hitachi-vantara-4136/content"},
{"address": ["Tầng 34 & 36, tòa nhà Keangnam Landmark 72, đường Phạm Hùng, Nam Tu Liem, Ha Noi", "DITP Tower, Nam O 1, Lien Chieu, Da Nang, Lien Chieu, Da Nang"], "benefits": "Competitive salary & bonus, Attractive allowances, Flexible working time", "company": "LG Vehicle Component Solutions Development Center Vietnam (LG VS DCV)", "description": "Competitive salary & bonus\nAttractive allowances\nFlexible working time\n", "elem_id": "job_80443", "salary": "700 - 2,000 USD", "title": "C++ Software Engineer - Up to $2000", "url": "/it-jobs/c-software-engineer-up-to-2000-lg-development-center-vietnam-0909/content"},
{"address": ["72 Lê Thánh Tôn, District 1, Ho Chi Minh", "23F Crystal Tower - 65 Hai Phong street, Hai Chau, Da Nang"], "company": "NFQ Asia", "description": "We truly value your thoughts and opinions\nGlobal and professional\nHonest, Transparent, Open-minded, Respect, Empathy\nManaging full lifecycle customer projects with Agile methods.\nDeveloping strong relationships with customers, acting as the primary point of contact as well as managing stakeholder expectations and always seek for solution improvement.\nYou will create, test, maintain user-friendly / mobile-friendly web application\nOptimizing web application for maximum speed\nBuilding reusable components for future use\nCollaborating with back-end developers and web designers to improve usability\nAt least 5+ years in Frontend technology stack, especially React framework\nProficient understanding of code versioning tools (Git is preferred)\nIn-depth understanding of in HTML/CSS, Javascript\nExperience in unit testing frameworks (e.g. Ava, Jest, Mocha)\nKnowledge of Docker container\nStrong teamwork collaboration\nAbility to work independently with minimal supervision while achieving benchmarks\nCapability to collaborate with team members and stakeholders.\nExperience in booking business domain (hotel booking, car rental)\nExperience in front-end tools (e.g. Grunt, Gulp, Webpack)\nStrong knowledge of development based on REST API\nExperience in GIS (e.g. OpenLayers)\nKnowledge of Realtime Communication (Pusher, PubNub, FireBase)\nIn-depth understanding of the entire web development process (design, development and deployment)\nThat would be nice if the candidate has in-depth knowledge of ATOMIC web design and domain knowledge in the E-commerce shop system (Oxid, Magento).\nTech Rockstar: Apply the latest technology\nExciting Projects: Working with overseas clients and awesome projects.\nGrowing Opportunity: Work with top-notch experts from around the world.\nOur core value:Honest we only tell the truth (upfront)Transparent we share information adequately, and openlyEmpathy sharing feelings mattersOpen-minded we approach things with candid attitudeRespect we treat everyone with the same kindness\nHonest we only tell the truth (upfront)\nTransparent we share information adequately, and openly\nEmpathy sharing feelings matters\nOpen-minded we approach things with candid attitude\nRespect we treat everyone with the same kindness\nHonest we only tell the truth (upfront)\nTransparent we share information adequately, and openly\nEmpathy sharing feelings matters\nOpen-minded we approach things with candid attitude\nRespect we treat everyone with the same kindness\nLaptop is provided.\nA fun & dynamic environment and freedom to be creative.\nRock in open-mind, kind & humble band.\nModern office with the flexible relaxing zone.\nCompany trip, team building & other community Tech activities.\nYear-end bonus.\nPerformance review  2 times/ year.\nExtra Medical Insurance.\n15 days annual leaves, working Monday – Friday.\n", "elem_id": "job_80441", "salary": "Up to $3000", "title": "Frontend Lead (ReactJS/JavaScript/HTML5)", "url": "/it-jobs/frontend-lead-reactjs-javascript-html5-nfq-asia-1539/content"},
{"address": ["539 Lầu 3,GMG Building,Lý Thường Kiệt, Tan Binh, Ho Chi Minh", "39 Quang Trung, Hai Chau, Da Nang"], "company": "Nexle Corporation", "description": "Attractive salary\nExcellent working environment\nHigh compensation\nReview business requirements working with team members\nProduce a solid, detailed UI/UX design\nWork with the other partners to triage and fix bugs with rapid turnaround\nContribute ideas for making the application better and easier to use\nDesign, develop and maintain application using HTML/CSS/JS\nActive participation in customer/partner design meetings and general engagements\nEnsure on time, on budget, and the quality of the product.\nB.S. in Graphic Design, Multimedia or equivalent\n2+ years of experience working as web/mobile app designer\nExperienced in Photoshop, Corel Draw or Sketch…\nBe capable of making HTML page using HTML/CSS/JS\nKnowledge of Javascript, ReactJS, React Native is a plus\nBe creative and good at user experiences\nA creative mind which can work alongside a very drunk design and creative team\nHighly organised driven individual with skills in an agency environment\nExcellent communication skills\nA commitment to quality and a thorough approach to work\nGood teamwork and reliability\nDrive and enthusiasm with the ability to manage and co-ordinate multiple projects\nChance to work with people across continents U.S, Australia, United Kingdom\nChance to work overseas based on the request from clients\nChance to improve English skill since the main communication is English during working hours.\nChance to improve the technical skill during working with clients on new technology.\nBe encouraged and rewarded with attractive remuneration for initiating the ideas that brings the innovation\nEnglish training in VUS School for team leaders and key staff.\nTechnical and soft skill training.\nSpecial health care insurance:\nPersonal accident: 210,000,000/occurrence and no limited occurrences\nHealth insurance: 63,000,000/disability and no limited disabilities\n13rd month salary as permanent bonus,\nOther bonuses depend on the performance and contributions to the project/company.\nAnnual company trip\nThere are 1-2 PAs (Performance Appraisal) per year. The percentage of salary adjustment is 10%-24% depending on the individual’s performance within a specific period.\nAdhoc salary review and promotion are performed in the year.\nProvide laptop for working and can take home.\nFor iOS development, the company provides a MAC MINI for normal developers. For the team leader, the company provides a MAC BOOK PRO for working.\nProfessional working space in office building: Coffee is served every day, Microwave oven and refrigerator serving lunch in the office\nHaving monthly happy hour either in the office or outside\nSport clubs: Football, Badminton.\n", "elem_id": "job_80700", "salary": "Upto 1300 based on skills", "title": "Senior UI/UX Designer (Html5/CSS)", "url": "/it-jobs/senior-ui-ux-designer-html5-css-nexle-corporation-0002/content"},
{"address": ["38E Tran Cao Van, District 3, Ho Chi Minh", "31 Đường Trần Phú, Hai Chau, Da Nang"], "benefits": "Work remotely& flexible hours, Latest macbook pro, Premium insurance (PVI)", "company": "Oivan", "description": "Work remotely& flexible hours\nLatest macbook pro\nPremium insurance (PVI)\n+3 years experience with Ruby on Rails\nFront end experience such as HTML, JavaScript, Angular, CSS, SASS, jQuery\nExperience with RESTful API\nExperience with database systems (postgreSQL)\nExperience with Git\nExcellent verbal and written English skills\nExperience with NodeJS, postgreSQL and others a plus\nFlexible hours and remote work - our team can work outside office up to 3 days or more a week\nMacbook Pro, Phone and Headphones\nPremium insurance from PVI\nFree weekly team lunch outside\n100% net salary paid during probation period\nTravel opportunity to Oivan international locations and client sites\nInternational team and work environment opportunities (Finland, Thailand, Middle-East)\nUnlimited snacks, coffee and drinks at the office.\nRegular team social events\nSelf-study time and company-sponsored opportunities for development (+4h per week)\n12 Days Annual Leave\nAnnual Health Checkup\n13th Month Salary\n", "elem_id": "job_80405", "salary": "1,500 - 3,500 USD", "title": "Full Stack Ruby on Rails Developer", "url": "/it-jobs/full-stack-ruby-on-rails-developer-oivan-0010/content"},
{"address": ["30 Nguyen Huu Tho, Hai Chau, Da Nang"], "company": "EM&AI", "description": "Lương, Thưởng xứng đáng\nỨng dụng Công Nghệ mới hàng đầu Thế Giới\nMôi trường Chuyên Nghiệp, Năng Động, Trẻ Trung\nCộng tác với các bạn Back-end Developers và các team khác để thiết lập mục tiêu và phát triển nhiều giao diện người dùng hơn, các thành phần có thể tái sử dụng (reuse component), mã liên kết để nâng cao trải nghiệm người dùng.\nTối ưu hóa các thành phần để có hiệu suất tối đa trên một loạt các thiết bị và trình duyệt hỗ trợ web.\nHỗ trợ nền tảng của chúng tôi trong việc bảo trì và khắc phục bất kỳ sự cố nào.\nCung cấp hướng dẫn kỹ thuật cho đồng đội thông qua huấn luyện và cố vấn.\nCác công việc khác theo chỉ đạo của giám đốc, leaders.\nHơn 2 năm kinh nghiệm làm việc trong lĩnh vực phát triển Front-end.\nCó kiến thức nền tảng vững chắc về HTML5 / CSS3 & Javascript.\nCó kinh nghiệm sử dụng các bộ tiền xử lý CSS (Less, Scss, Sass, Stylus), Mobile First / Website Responsive\nCó kinh nghiệm xây dựng môi trường phát triển front-end bằng Webpack, Gulp\nCó kiến thức về tối ưu hóa giao diện người dùng, thiết kế và cung cấp các hệ thống dựa trên đám mây có tính khả dụng cao, có thể mở rộng.\nThành thạo các nguyên tắc phát triển application qua API và kiến trúc server.\nCó kiến thức về API RESTful, bảo mật, API, JSON, XML\nBiết dùng một trong các cơ sở dữ liệu từ cơ bản tới phân tán như MongoDB.\nQuen thuộc với các công cụ kiểm soát phiên bản (git)\nCó tư duy sáng tạo, đam mê xây dựng các công trình mang tính ứng dụng cao, tinh tường về chi tiết, luôn tìm tòi cải tiến UI / UX để mang đến trải nghiệm người dùng vượt trội.\n", "elem_id": "job_80299", "salary": "500 - 700 USD", "title": "Front End Dev (HTML5; CSS; Javascript)", "url": "/it-jobs/2-front-end-dev-html5-css-javascript-em-ai-5725/content"},
{"address": ["Tòa nhà FPT Complex, Đường Nam Kỳ Khởi Nghĩa, Phường Hòa Hải, Ngu Hanh Son, Da Nang"], "company": "FPT Software", "description": "Global Exposure\nFast Track Career\nDiversified Jobs & Technologies\nQuản lý vận hành liền mạch, đảm bảo giao hàng SLA đúng thời gian cùng với duy trì sự hài lòng của nhân viên và khách hàng tốt nhất. (Manage the operations seamlessly, ensuring timely SLA delivery along with maintaining high level of employee and customer satisfaction)\nChịu trách nhiệm tuân theo cơ cấu tổ chức quản trị, kế hoạch trao đổi và phân quyền đã được thống nhất … (Be responsible for following agreed governance model, escalation & communication plan)\nĐảm bảo thành viên nhóm đạt được những tiêu chuẩn đã đề ra theo nhiệm vụ được giao (Ensure team members achieve agreed standards in relation to their job assignments)\nXây dựng mối quan hệ đối tác bền chặc với khách hàng bằng việc phát triển và nuôi dưỡng các mối quan hệ hiện có để đảm bảo hoạt động gắn kết và nền tảng hiệu quả cho sự phát triển tương lai (Build strong partnership with the client by growing and nurturing the existing relationships to ensure operational cohesion & effective foundation for future growth)\nĐào tạo và hướng dẫn cho teamlead để có thể quản lý team tốt hơn (Coach & mentor Team lead so that they are able to manage their teams better)\nLà người liên hệ chính cho tất cả vấn đề và thắc mắc của những công việc được giao (Be the Key contact for all problems and queries with specific business assigned)\nCó ít nhất 3 năm kinh nghiệm quản trị dự án với khách hàng Nhật, Hàn, Mỹ…\nƯu tiên các bạn đã có hoạt động trong lĩnh vực BPO service\nƯu tiên các bạn đã có kinh nghiệm negotiation, delivery issue analysis &report ở mức khách hàng (external negotiation/report)\nƯu tiên các bạn có kinh nghiệm quản lý team trên 30 người (delivery management)\nTiếng Nhật tốt 4 skills (nghe, nói, đọc, viết) (bắt buộc) – N2 trở lên\nCó khả năng thích ứng tốt, luôn sẵn sàng nhận nhiệm vụ/thử thách mới\nKhả năng giao tiếp và điều phối tốt, tạo được động lực cho member\nMức lương cạnh tranh, có thể thỏa thuận tùy năng lực\nThưởng nóng lên đến 25 triệu\nCơ hội được tiếp xúc, làm việc với khách hàng Nhật\nCơ hội làm việc và thăng tiến trong một môi trường chuyên nghiệp, hiện đại, năng động, đa văn hoá\nCơ hội đi công tác ngắn hạn tại Nhật Bản\nĐược hưởng bảo hiểm FPT Care và chế độ nghỉ mát cho bản thân và gia đình.\nXét tăng lương theo năm dựa trên kết quả đánh giá công việc\nVà nhiều quyền lợi hấp dẫn khác…\n", "elem_id": "job_80354", "salary": "You'll love it", "title": "Project Manager N2 (BPO)", "url": "/it-jobs/project-manager-n2-bpo-fpt-software-3326/content"},
{"address": ["8th Floor, Vietnam Post Building, 271 Nguyen Van Linh St, Thanh Khe, Da Nang"], "company": "GETZ SOFTWARE LTD", "description": "Monthly revenue sharing to all individuals\nInteresting products which are worth to achieve\nGood welfare\nHelping software development teams apply the Scrum framework\nPlanning deliverables and helping teams monitor performance\nResolving issues that hinder the teams’ work\nManage each project’s scope and timeline\nCoordinate sprints, retrospective meetings and daily stand-ups\nCoach team members in Agile frameworks\nFacilitate internal communication and effective collaboration\nBe the point of contact for external communications (e.g. from customers or stakeholders)\nWork with product owners to handle backlogs and new requests\nResolve conflicts and remove obstacles that occur\nHelp teams implement changes effectively\nEnsure deliverables are up to quality standards at the end of each sprint\nGuide development teams to higher scrum maturity\nHelp build a productive environment where team members ‘own’ the product and enjoy working on it.\nHelping the PO & Development team to achieve customer satisfaction\nExperience in a Scrum framework.\nFamiliarity with software development.\nGood knowledge of Scrum techniques and artifacts (such as definition of done, user stories, automated testing, backlog refinement)\nExcellent communication and servant leadership skills\nProblem-solving and conflict-resolution ability, to quickly analyze and resolve the conflict.\nOutstanding organizational skills\nSelf-motivation and ability to stay focused in the middle of distraction.\nAbility to adapt to a changing environment, open-mindset & strong teamwork spirit.\nExperience in talking/dealing with customer requirement, be able to accept or reject the requirement in constructive way.\nAbility to work with and lead a team.\nStrong communication, interpersonal and mentoring skills\nScrum master certification is a plus\nExperience in UI/UX matter & F&B service is a plus\nRevenue Sharing Monthly\n13th month salary (AWS)\nSpecial Day Bonus\nEmployee Referral Incentive\nPeriodical Performance Review: Junior: 2 times/year - Senior: 1 time/year\nGETZ Personal Health Care (extra service)\nMI/SI/UI: basing on full of Gross salary\nAnnual Health Check\nFinancial assistance for employee's kid(s) to attend kindergarten (up to 2 kids)\nLunch fee provided\nFree pantry\nAnnual Company Rest & Relax overseas trip\nParticipate in Employee motivational activities\nMonthly movie nights (at movie theatre) for entire team\nSport Clubs: football, badminton etc\n", "elem_id": "job_80353", "salary": "You'll love it", "title": "Scrum Master Asisstant", "url": "/it-jobs/scrum-master-asisstant-asm-getz-software-ltd-2703/content"},
{"address": ["8th Floor, Vietnam Post Building, 271 Nguyen Van Linh St, Thanh Khe, Da Nang"], "company": "GETZ SOFTWARE LTD", "description": "Monthly revenue sharing to all individuals\nInteresting products which are worth to achieve\nGood welfare\nParticipate in software development projects on Cloud/Mobile.\nMake the project master plan, execution plan in detail and implement them.\nRead & review code, architecture and design related to products/projects.\nPerform software design, development, testing, deployment and support.\nPerform Agile SCRUM development methodology experience.\nResearch the new technologies and update to company knowledge database.\nPerform other tasks if assigned.\nAt least 2+ years working experience as a .Net Developer.\nExperience with Microsoft Entity Framework and/or LINQ to SQL, LINQ to Entities, MS SQL Server 2008 above.\nSolid fundamental of OOP, object oriented design and analysis\nHave high level profile capable of modeling entities/systems\nHave excellent knowledge of .NET Framework and MVC\nHave highly specialized knowledge of .NET C# (efficient code, object and pure) and .NET architecture Knowledge of Web.\nHave knowledge and experience with Unit test, TDD and continuous integration tools\nHave knowledge and experience with JS framework AngularJS, RequireJS\nHave knowledge and experience with front-end framework Bootstrap, SASS,..\nExperience with Angular or AngularJS stack\nExperience with React stack (ReactJS, Redux, State Management)\nBe experienced in REST Service Architecture\nBe experiences with Agile Software Development, especially SCRUM\nEnglish communication & reading skill.\nExcellent written and oral communications skills\nTeamwork and able to work independently.\nRevenue Sharing Monthly\n13th month salary (AWS)\nSpecial Day Bonus\nEmployee Referral Incentive\nPeriodical Performance Review: Junior: 2 times/year - Senior: 1 time/year\nGETZ Personal Health Care (extra service)\nMI/SI/UI: basing on full of Gross salary\nAnnual Health Check\nFinancial assistance for employee's kid(s) to attend kindergarten (up to 2 kids)\nLunch fee provided\nFree pantry\nAnnual Company Rest & Relax overseas trip\nParticipate in Employee motivational activities\nMonthly movie nights (at movie theatre) for entire team\nSport Clubs: football, badminton etc\n", "elem_id": "job_80351", "salary": "You'll love it", "title": ".NET Developer", "url": "/it-jobs/net-developer-getz-software-ltd-2251/content"},
{"address": ["8th Floor, Vietnam Post Building, 271 Nguyen Van Linh St, Thanh Khe, Da Nang"], "company": "GETZ SOFTWARE LTD", "description": "Monthly revenue sharing to all individuals\nInteresting products which are worth to achieve\nGood welfare\nParticipate in software development projects on Cloud/Mobile.\nParticipate in the full SDLC of iOS based applications from design through to deployment.\nActively design, develop, and implement commercially released and enterprise applications for iOS platform.\nMake the project master plan, execution plan in detail and implement them.\nRead & review code, architecture and design related to products/projects.\nResearch the new technologies and update to company knowledge database.\nPerform other tasks if assigned\n2+ years experience as a front-end engineer/architect, and/or mobile engineer working in consumer-facing environment.\nObjective-C - Strong experience with server/client model, Xcode, Cocoa Touch, iOS SDK, user interface design and information architecture is a must.\nSwift - with a good knowledge of its ecosystems.\nGood industry experience of network and multithreading programming.\nGood understanding of data types and protocols connecting web services.\nExperience using Databases, including SQLite, MySQL, Core Data, Couchbase Lite.\nFamiliar with standard frameworks, such as Cocoa, Google API.\nExperience with third-party libraries and APIs, such as ASIHTTP, Facebook SDK, JSON, Epson SDK, Brother SDK, RegEx Lite, and etc.\nFundamentals in object-oriented design, data structures, algorithm design, problem solving, and complexity analysis.\nExperience building native iOS applications for iPad, iPhone and / or both including deployments through the Apple iTunes App Store or Enterprise licensing.\nSelf-motivated to explore new technologies, applications and environments\nProficient understanding of code versioning tools (SVN, Git)\nHave applications in the Apple App Store is a plus\nGood English communication skills with demonstrated ability to work in a team environment.\nWillingness and ability to thrive in a fast paced and Agile development environment.\nRevenue Sharing Monthly\n13th month salary (AWS)\nSpecial Day Bonus\nEmployee Referral Incentive\nPeriodical Performance Review: Junior: 2 times/year - Senior: 1 time/year\nGETZ Personal Health Care (extra service)\nMI/SI/UI: basing on full of Gross salary\nAnnual Health Check\nFinancial assistance for employee's kid(s) to attend kindergarten (up to 2 kids)\nLunch fee provided\nFree pantry\nAnnual Company Rest & Relax overseas trip\nParticipate in Employee motivational activities\nMonthly movie nights (at movie theatre) for entire team\nSport Clubs: football, badminton etc\n", "elem_id": "job_80349", "salary": "You'll love it", "title": "iOS Developer", "url": "/it-jobs/ios-developer-getz-software-ltd-1842/content"},
{"address": ["8th Floor, Vietnam Post Building, 271 Nguyen Van Linh St, Thanh Khe, Da Nang"], "company": "GETZ SOFTWARE LTD", "description": "Monthly revenue sharing to all individuals\nInteresting products which are worth to achieve\nGood welfare\nAs a DevOps Engineer, you will be a part of a team to build AWS cloud architecture for our .Net/NodeJS applications.\nDefine and manage cloud infrastructure as code (IAC), improve CI/CD pipeline, ensure scalability and availability of the system, build monitoring stack, automate build, configuration, and deployment orchestration scripts, ...\nUtilize a broad toolset for DevOps/Infra like Docker, Jenkins … and leverage multiple services from AWS: EC2, ECS, S3, RDS, IAM, Route53, CloudWatch…\nWork to improve speed, efficiency, and scalability of all systems.\nMonitor, troubleshoot and manage all environments of the team.\nShould be high responsible, fast & 24/7 response for zero-downtime of the system.\nWork with the Development team to build tools to reduce occurrences of errors and improve customer experience, as well as to give the architectural decision for system level.\nAt least 1 year of experience in Linux Administration (Ubuntu)\nAt least 1 year working experience in projects with C#, ASP.NET, MVC or NODEJS\nAmazon Web Services (primarily EC2, S3, Cloud formation, Cloud front, ECS, Lamda, RDS, Cloud Watch)\nExperience with Application-level monitoring (APM) or monitoring tools (prefer: Zabbix, Cloud Watch, Stackify, Pm2)\nExperience with automation and deployment templates for relational and SQL and NoSQL databases such as MSSQL, MongoDB, CouchBase...\nCI/CD Tools: Jenkins, Bamboo (prefer: Jenkins)\nGood experience with the source control and its related concepts (Git, Gitflow, branches, tags, etc.)\nBe good attention on details to detect and report the root cause analysis for the production error, as well as strong problem-solving skill to give the best optimal solution.\nGood team work skill.\nRevenue Sharing Monthly\n13th month salary (AWS)\nSpecial Day Bonus\nEmployee Referral Incentive\nPeriodical Performance Review: Junior: 2 times/year - Senior: 1 time/year\nGETZ Personal Health Care (extra service)\nMI/SI/UI: basing on full of Gross salary\nAnnual Health Check\nFinancial assistance for employee's kid(s) to attend kindergarten (up to 2 kids)\nLunch fee provided\nFree pantry\nAnnual Company Rest & Relax overseas trip\nParticipate in Employee motivational activities\nMonthly movie nights (at movie theatre) for entire team\nSport Clubs: football, badminton etc\n", "elem_id": "job_80348", "salary": "You'll love it", "title": "Devops Engineer", "url": "/it-jobs/devops-engineer-getz-software-ltd-1247/content"},
{"address": ["20 Cong Hoa Garden, Cong Hoa, Tan Binh, Ho Chi Minh", "36 Tran Quoc Toan, Hai Chau 1, Hai Chau, Da Nang"], "benefits": "Private Health Insurance, Gasoline/Lunch Support Fee, Remote working 2 days/week", "company": "MTI TECHNOLOGY", "description": "Private Health Insurance\nGasoline/Lunch Support Fee\nRemote working 2 days/week\nHave at least 1 years of experience in developing flutter applications.\nExperience with third-party libraries and APIs, writing Unit Test.\nWrite clear, maintainable and testable code.\nExperience with Git, GitFlow.\nBasic English communication.\nAble to work under pressure with a positive attitude towards the other team members.\nExperience working in an agile development process.\nExperience with CI/CD.\nExperience with Automation Testing.\nMTI Technology is being a grown-up company, focused on innovative products and new technologies\nRemote working 2 days/Week\nFlat organization structure. We don't have Boss, Your ideas and opinions are as important as everyone else.\nAnnual Wage Supplement of 1 month's salary (Paid 2 times in June and December)\nThe 3F: Fun, Friendly and Flexible. We are colleagues and a small family\nPerformance Bonus Overtime payment\nJapanese Language allowance, Technical allowance (Azure and AWS certifications), Seniority Allowance, Transport allowance Lunch allowance\nPrivate Medical Insurance\nLanguage Class (English Class)\nHaving an opportunity to work in Japan\nFree snack and coffee\nVery competitive salary\nPing-Pong, Badminton, Swimming, and Football ready\n", "elem_id": "job_80717", "salary": "800 - 1,800 USD", "title": "Flutter Developer (iOS, Android)", "url": "/it-jobs/flutter-developer-mti-technology-4314/content"},
{"address": ["., Other, Da Nang", "., Other, Ho Chi Minh"], "company": "KeyReply", "description": "Autonomy in role and in managing your portfolio\nCompetitive salaries and medical benefits\nWorking remotely, with passionate and driven team\nTake responsibility within an engineering team that builds and supports amazing customer- facing products, providing innovative solutions to challenging programming and design problems.\nAccurately scope effort, identify risks and clearly communicate trade-offs with team members and other stakeholders; sometimes this includes clients, if you need to.\nStay aware of industry trends, confidently make technology choices and strategic decisions.\nShip high quality products and features with an end-to-end mind set from conception to delivery and production support, owning specifications, quality, release deployments and monitoring of production health.\nSelf-driven and care about maintainability of code, automation, deployment processes, and want to write the highest quality code with utmost attention to scalability and performance.\n3+ years of experience designing and developing applications\nExperience working most of the following: VueJS, ReactJS, Node.js, TypeScript, GraphQL, MySQL/Postgres/MSSQL, WebSocket\nExperience and adamant in creating well thought-out applications that have reusable components, readable code, resilient design, low maintenance, computational efficiency, modular and future-proof (i.e. easy to modify and add on later)\nExpertise in software design and architecture. Strong problem solving and communication skills. Passion for emerging JavaScript and machine learning technologies.\nExperience with DevOps, like Azure/AWS/on-premise deployments and maintenance with Machine Learning/AI systems will be a plus.\nExperience in developing secure systems that fulfil stringent enterprise non-functional requirements will be a plus.\nWe solve difficult problems that are very meaningful. Healthcare organizations around the world are now planning for what post-covid-19 will look like. What does a smart hospital look like? What changes should they make for Healthcare 2.0?\nBy being more nimble in the way of delivering care â€“ in person or remote; moving from reactive to proactive and preventive care; empowering patients to make informed first-level decisions on their next course of actions; and more efficient resource allocation, we can positively impact the lives of millions in very tangible ways.\nWe are proud to work with some of the largest and most well-respected healthcare institutions. Your work will be used prominently by millions to improve the future of patient engagement.\nLead the innovation in Healthcare and Insurance by joining KeyReply today.\nUnique opportunity: Be a part of the digital disruption in #1 AI chat automation company. Exposure to the fast-paced world of high-tech start-ups.\nAutonomy: Autonomy in the role and in managing your own portfolio and freedom to suggest improvements to the company.\nEnvironment: Working with passionate, smart and driven colleagues in a vibrant environment. Teamactivities, snacks, games, outings etc\nFlexibility: Flexible vacation policy and work arrangements\nAttractive: Package: Competitive salaries and medical benefits.\n", "elem_id": "job_80401", "salary": "Up to $1800", "title": "Remote Fullstack (NodeJS/VueJS/ReactJS)", "url": "/it-jobs/remote-fullstack-reactjs-nodejs-vuejs-keyreply-4037/content"},
{"address": ["N/A, District 1, Ho Chi Minh", "N/A, Hai Chau, Da Nang"], "benefits": "Attractive salary, Good working environment, Work remote", "company": "Resola Inc", "description": "Attractive salary\nGood working environment\nWork remote\nCollaborate with the rest of the engineering and product team to design and launch new features\nContribute to the entire app lifecycle\nDesign client-side and server-side architecture\nDevelop and manage well-functioning applications and databases\nWrite effective APIs\nWriting clean, functional code on the front-end and back-end\nWrite well tested software to ensure quality, responsiveness and efficiency\nWrite technical documentation\nTroubleshooting issues and problem solving as necessary\nProven experience as a FullStack Engineer or similar role\nExperience developing web and mobile applications\nFamiliarity with common stacks\nKnowledge of multiple front-end languages and libraries (e.g. HTML/ CSS, JavaScript)\nKnowledge of multiple back-end languages (e.g. Python, Go, NodeJS)\nKnowledge of multiple frameworks (e.g. React, Django)\nFamiliarity with databases (e.g. MySQL, MongoDB)\nFamiliarity with development tools (e.g. Git, Docker)\nExcellent communication and teamwork skills\nGreat attention to detail\nOrganizational skills\nCan communicate in English\nFamiliarity integrating APIs\nSpeak Japanese\nExperience developing and operating SaaS products and services\nAttractive Salary\nInteresting challenges\nDevelop Your Career\nInternational environment\nFlexible hours + work remote\nsynal.io\npep.work\nlibero-app.com\nvirtualstore.jp\n", "elem_id": "job_80581", "salary": "2,000 - 3,000 USD", "title": "Remote Fullstack Dev (Python, ReactJS)", "url": "/it-jobs/remote-fullstack-engineer-python-resola-inc-1034/content"},
{"address": ["Tầng 34 & 36, tòa nhà Keangnam Landmark 72, đường Phạm Hùng, Nam Tu Liem, Ha Noi", "DITP Tower, Nam O 1, Lien Chieu, Da Nang, Lien Chieu, Da Nang"], "benefits": "Competitive salary & bonus, Attractive allowances, Flexible working time", "company": "LG Vehicle Component Solutions Development Center Vietnam (LG VS DCV)", "description": "Competitive salary & bonus\nAttractive allowances\nFlexible working time\n", "elem_id": "job_80446", "salary": "700 - 2,000 USD", "title": "Java Software Engineer - Up to $2,000", "url": "/it-jobs/java-software-engineer-up-to-2-000-lg-development-center-vietnam-2912/content"},
{"address": ["72 Lê Thánh Tôn, District 1, Ho Chi Minh", "23F Crystal Tower - 65 Hai Phong street, Hai Chau, Da Nang"], "company": "NFQ Asia", "description": "We truly value your thoughts and opinions\nGlobal and professional\nHonest, Transparent, Open-minded, Respect, Empathy\nManaging full lifecycle customer projects with Agile methods.\nDeveloping strong relationships with customers, acting as the primary point of contact as well as managing stakeholder expectations and always seeking for solution improvement.\nYou will create, test, maintain user-friendly / mobile-friendly web application\nOptimizing web application for maximum speed\nBuilding reusable components for future use\nCollaborating with back-end developers and web designers to improve usability\n3+ years of overall software development experience, with an emphasis on web applications and front-end technologies\nProficient understanding of code versioning tools (Git is preferred)\nIn-depth understanding of in HTML/CSS, Javascript\nExperience in front-end frameworks (e.g. Angular, React, Vue)\nExperience in unit testing frameworks (e.g. Ava, Jest, Mocha)\nExperience in booking business domain (hotel booking, car rental)\nExperience in front-end tools (e.g. Grunt, Gulp, Webpack)\nStrong knowledge of development based on REST API\nExperience in GIS (e.g. OpenLayers)\nKnowledge of Realtime Communication (Pusher, PubNub, FireBase)\nIn-depth understanding of the entire web development process (design, development and deployment)\nGood at English communication\nTech Rockstar : Apply the latest technology\nExciting Projects : Working with overseas clients and awesome projects.\nGrowing Opportunity : Work with top-notch experts from around the world.\nOur core value:Honest we only tell the truth (upfront)Transparent we share information adequately, and openlyEmpathy sharing feelings mattersOpen-minded we approach things with candid attitudeRespect we treat everyone with the same kindness\nHonest we only tell the truth (upfront)\nTransparent we share information adequately, and openly\nEmpathy sharing feelings matters\nOpen-minded we approach things with candid attitude\nRespect we treat everyone with the same kindness\nHonest we only tell the truth (upfront)\nTransparent we share information adequately, and openly\nEmpathy sharing feelings matters\nOpen-minded we approach things with candid attitude\nRespect we treat everyone with the same kindness\nLaptop is provided.\nA fun & dynamic environment and freedom to be creative.\nRock in open-mind, kind & humble band.\nModern office with the flexible relaxing zone.\nCompany trip, team building & other community Tech activities.\nYear-end bonus.\nPerformance review  2 times/ year.\nExtra Medical Insurance.\n15 days annual leaves, working Monday – Friday.\n", "elem_id": "job_80442", "salary": "You'll love it", "title": "Sr Front-end Dev (Javascript, ReactJS)", "url": "/it-jobs/sr-front-end-dev-javascript-reactjs-nfq-asia-1629/content"},
{"address": ["4th floor, Bach Dang Building, 51 Xo Viet Nghe Tinh street, Hai Chau, Da Nang"], "company": "NiftyJS", "description": "", "elem_id": "job_80830", "salary": "You'll love it", "title": "Frontend Dev (JavaScript, HTML5, CSS)", "url": "/it-jobs/frontend-dev-javascript-html5-css-niftyjs-3521/content"},
{"address": ["HIU Tower, 215 Điện Biên Phủ, Phường 15, Binh Thanh, Ho Chi Minh", "DNC - Danang Coworking Space, Hai Chau, Da Nang"], "company": "TymeGlobal", "description": "Excellent environment and team to help you grow.\nCompetitive salary and learning culture\nFortnightly and Monthly Fun Activities\nWorking with stakeholders to understand their needs, concerns and the environment that they operate in to define detailed requirements. Gather, organise and synthesize large amounts of information from various sources.\nEffectively identify and define business needs and problems/issues to enable a feasible solution scope to be developed.\nEffectively communicating requirements to stakeholders, managing conflicts, issues and changes in order to ensure that stakeholders and project team members remain in agreement on solution scope.\nContributes to the conversion of business needs into functional designs and conduct product training as needed.\nIdentifies and manages gaps, determining the effectiveness of proposed solutions and developing Business Requirements documents and models.\nIdentify the risks associated with the proposed solution as well as the risk for not implementing the solution.\nWork closely with Digital Product Owner (DPO) to understand product vision, priority and road-map, clarify and manage product backlog.\nEnsure the Team understand the product requirements & backlog and the product is delivered at high quality.\nAt least 3 years in business analysis.\nExcellent English communication (write, read, speak and listen).\nUnderstanding of BABOK® Knowledge Areas.\nBeing knowledgeable or experienced in Agile environment, good logical and analytical thinking.\nExperience in working in technology enabled change programs/projects, software development is a plus.\nRelevant IT or business tertiary qualification.\nProfessional certificates in Business Analysis is a plus.\nAt TYME Digital opportunities are here for the taking. If want to be part of our purpose and live and lead through our values, we can offer exciting development opportunities through expanded lateral roles, stretch assignments or people leadership.\nSome of our benefits:\nMeal and parking allowance covered by company.\nFull benefits and salary rank during probation.\nInsurances as Vietnamese labor law and premium health care for you and your family.\nSMART goals and clear career opportunities (technical seminar, conference and career talk) - we focus on your development.\nValues driven, international working environment and agile culture.\nOverseas travel opportunities for training and working related.\nInternal Hackathons and company's events (team building, coffee run, blue card...)\n13th-month salary and performance bonus.\n15-day annual + 3-day sick leave per year from company.\nWork-life balance 40-hr per week from Mon to Fri.\n", "elem_id": "job_80862", "salary": "You'll love it", "title": "Business Analyst (English, Agile)", "url": "/it-jobs/business-analyst-english-agile-tymeglobal-0706/content"},
{"address": ["Phi Long Technology building, 52 Nguyen Van Linh , Hai Chau, Da Nang"], "company": "Flodesk", "description": "Design and develop our high traffic internal/public API\nTake our backend services to the next level (100k active users, sending 500m emails/mo)\nDevelop native integrations with our 3rd party partners (Shopify/Zapier...)\nStrong computer science foundation and problem-solving skills\nGood (at minimum) and excellent (preferred) written English skills for documentation and communication with the team\n2+ years of experiences in backend development (SOA architecture, Golang/NodeJS are preferred)\nExperience working with MongoDB and PostgreSQL\nExperience working with AWS services\nExperience with API integration testing\nExperience with a high-paced startup environment where refactoring and requirement changes are common\nExperience with SaaS problem like fair usage, noisy neighbor\nExperience working with large database like sharding, partitioning, no downtime migration\nExperience working with Martech (email deliverability, tracking, embed analytics)\nCompetitive Salary + 13th month bonus\nAnnual Personal Development Package (up to $1000/ year for growth development program)\nFive working days per week (From Monday - Friday)\nPremium healthcare insurance\nOpportunities for advanced career development overseas\nBonus based on your performance (KPI)\nStock options\nHighly professional equipment (Macbook Pro 2019 and more)\nVaried and challenging work to help your  personal growth\n", "elem_id": "job_80518", "salary": "You'll love it", "title": "Backend Dev (NodeJS, Golang, PostgreSQL)", "url": "/it-jobs/backend-dev-nodejs-golang-postgresql-flodesk-1800/content"},
{"address": ["Phi Long Technology building, 52 Nguyen Van Linh , Hai Chau, Da Nang"], "company": "Flodesk", "description": "Implement, maintain, and update our component libraries, customer-facing websites/landing pages, and the web application at large\nPush the boundaries of our web application to the next level in terms of performance, accessibility and stability\nContinuously refactor, improve and add automation testing for components (code coverage > 80%)\nProactively collaborate with our designers, provide feedback about UI/UX + animation, and bring new ideas to the table\nProactively research new trends and updates in UX/UI technology\nWork hand-in-hand with our current team to resolve issues in our core product, including but not limited to our proprietary WYSIWYG email builder\nStrong experience in HTML, CSS and Javascript\nFluent in React, Redux and related tools\nExperience writing automation testingâ€”especially the React app\nExperience in debugging and improving webapp performance\nSpecific experience building web-based builder/drag and drop UI\nCompetitive Salary + 13th month bonus\nAnnual Personal Development Package (up to $1000/ year for growth development program)\nFive working days per week (From Monday - Friday)\nPremium healthcare insurance\nOpportunities for advanced career development overseas\nBonus based on your performance (KPI)\nStock options\nHighly professional equipment (Macbook Pro 2019 and more)\nVaried and challenging work to help your  personal growth\n", "elem_id": "job_80517", "salary": "You'll love it", "title": "Frontend Dev (ReactJS/HTML5/JavaScript)", "url": "/it-jobs/frontend-dev-reactjs-html5-javascript-flodesk-1440/content"},
{"address": ["., Other, Da Nang", "., Other, Ho Chi Minh"], "company": "KeyReply", "description": "Autonomy in role and in managing your portfolio\nCompetitive salaries and medical benefits\nWorking remotely, with passionate and driven team\nAnalyse current technology utilized within the company and develop steps and processes to improve and expand upon them.\nEstablish milestones for necessary contributions from departments and develop processes to facilitate their collaboration.\nProvide detailed specifications for proposed solutions including materials, manpower and time necessary.\nWork closely with engineering professionals within the company to maintain hardware and software needed for projects to be completed efficiently.\nMentor and train other engineers throughout the company and seek to continually improve processes companywide and apply troubleshooting methodologies to resolve problems.\nWork alongside project management teams to successfully monitor progress and implementation of initiatives\nUnderstand and apply security best practices and comply with customer security requirements\n4+ years of experience of working experience in the related field.\nBasic networking knowledge including networking fundamentals, security, routing and switching fundamentals, and configuring networks.\nSolid understanding of how to use Docker and Kubernetes to deploy non-trivial applications\nExperience with managing bare metal machines and cloud platform providers (especially Azure, AWS)\nAbility to communicate clearly and empathetically, especially in writing and documentation.\nComfortable using Terraform (or similar infrastructure-as-code) to build tooling and automation for deployments, CI/CD, and internal developer tools.\nExperience with analytics and monitoring tools like Elasticsearch, Logstash and Kibana (ELK), Telegraf, Prometheus and Grafana\nFamiliarity with authentication software like Keycloak and Auth0; Single sign-on services and protocols like ADFS, OAuth, OIDC\nProficiency with database systems like MS SQL Server, My SQL Server.\nExperience with web server technologies like Apache, NGINX and configuring them as reverse proxies\nExperience with web application security model, including Same-Origin Policy, Content Security Policies, SSL/TLS, HTTP Strict Transport Security,\nProfessional work experience and having processes in place around governance, auditing and compliance.\nWe solve difficult problems that are very meaningful. Healthcare organizations around the world are now planning for what post-covid-19 will look like. What does a smart hospital look like? What changes should they make for Healthcare 2.0?\nBy being more nimble in the way of delivering care – in person or remote; moving from reactive to proactive and preventive care; empowering patients to make informed first-level decisions on their next course of actions; and more efficient resource allocation, we can positively impact the lives of millions in very tangible ways.\nWe are proud to work with some of the largest and most well-respected healthcare institutions. Your work will be used prominently by millions to improve the future of patient engagement.\nLead the innovation in Healthcare and Insurance by joining KeyReply today.\nUnique opportunity: Be a part of the digital disruption in #1 AI chat automation company. Exposure to the fast-paced world of high-tech start-ups.\nAutonomy: Autonomy in the role and in managing your own portfolio and freedom to suggest improvements to the company.\nEnvironment: Working with passionate, smart and driven colleagues in a vibrant environment. Teamactivities, snacks, games, outings etc\nFlexibility: Flexible vacation policy and work arrangements\nAttractive: Package: Competitive salaries and medical benefits.\n", "elem_id": "job_80402", "salary": "Up to $1800", "title": "Remote DevOps (Docker, Kubernetes)", "url": "/it-jobs/devops-engineer-docker-kubernetes-keyreply-5115/content"},
{"address": ["38E Tran Cao Van, District 3, Ho Chi Minh", "31 Đường Trần Phú, Hai Chau, Da Nang"], "company": "Oivan", "description": "Big salary and great benefits like Macbook pro\nYou can work outside office up to 3 days a week\nInternational experience with travel possible\nLinux(Ubuntu)\nDatabases (Postgresql/MongoDB/SQLite)\nB.S. in computer science or a related field\n+3 years DevOps/SysAdmin experience\nEnglish (Strong written and verbal communication skills)\nExperience with CI/CD (GitLab CI)\nAnsible\nDocker\nTerraform\nMonitoring (New Relic, Prometheus/Grafana)\nProgramming (Ruby on Rails, Python, BashScript)\nFlexible hours and remote work - our team can work outside office up to 3 days or more a week\nMacbook Pro, Phone and Headphones\nPremium insurance from PVI\nFree weekly team lunch outside\nProbation period salary is 100%\nTravel opportunity to Oivan international locations and client sites\nInternational team and work environment opportunities (Finland, Thailand, Middle-East)\nDrinks and Snacks as much as you want + premium coffee\nRegular team social events\nSelf-study time and company-sponsored opportunities for development (+4h per week).\n12 Days Annual Leave\nAnnual Health Checkup\n13th Month Salary\n", "elem_id": "job_80362", "salary": "1,500 - 3,500 USD", "title": "Devops Engineer", "url": "/it-jobs/devops-oivan-5407/content"}]
